INSERT INTO faculty("name")
VALUES ('Биологии и экологии'),
    ('Информатики и вычислительной техники'),
    ('Исторический'),
    ('Математический'),
    ('Психологии'),
    ('Социально-политических наук'),
    ('Факультет иностранных языков'),
    ('Физический'),
    ('Филологии и коммуникации'),
    ('Экономический'),
    ('Юридический'),
    ('Университетский колледж');

-- Добавляем направления для каждого факультета
INSERT INTO course (faculty_id, "name", education_level)
VALUES
-- Факультет биологии и экологии
(1, 'Биология', 'bachelor'),
(1, 'Экология', 'master'),
(1, 'Биофизика', 'postgraduate'),
(1, 'Микробиология', 'bachelor'),
(1, 'Биохимия', 'master'),

-- Факультет информатики и вычислительной техники
(2, 'Программирование', 'bachelor'),
(2, 'Информационные технологии', 'master'),
(2, 'Искусственный интеллект', 'postgraduate'),
(2, 'Кибербезопасность', 'bachelor'),

-- Исторический факультет
(3, 'История', 'bachelor'),
(3, 'Археология', 'master'),
(3, 'Антропология', 'postgraduate'),
(3, 'Культурология', 'bachelor'),
(3, 'История искусства', 'master'),

-- Математический факультет
(4, 'Математика', 'bachelor'),
(4, 'Прикладная математика', 'master'),
(4, 'Статистика', 'postgraduate'),

-- Факультет психологии
(5, 'Психология', 'bachelor'),
(5, 'Клиническая психология', 'master'),
(5, 'Социальная психология', 'postgraduate'),

-- Факультет социально-политических наук
(6, 'Политология', 'bachelor'),
(6, 'Социология', 'master'),
(6, 'Социальная работа', 'postgraduate'),
(6, 'Экономическая социология', 'bachelor'),

-- Факультет иностранных языков
(7, 'Филология', 'bachelor'),
(7, 'Перевод и переводоведение', 'master'),
(7, 'Лингвистика', 'postgraduate'),

-- Факультет физики
(8, 'Физика', 'bachelor'),
(8, 'Космическая физика', 'master'),
(8, 'Квантовая физика', 'postgraduate'),

-- Факультет филологии и коммуникации
(9, 'Филология', 'bachelor'),
(9, 'Журналистика', 'master'),
(9, 'Коммуникации', 'postgraduate'),

-- Экономический факультет
(10, 'Экономика', 'bachelor'),
(10, 'Финансы', 'master'),
(10, 'Бухгалтерский учет', 'postgraduate'),

-- Юридический факультет
(11, 'Правоведение', 'bachelor'),
(11, 'Уголовное право', 'master'),
(11, 'Гражданское право', 'postgraduate'),

-- Университетский колледж
(12, 'Общее образование', 'bachelor'),
(12, 'Кросс-дисциплинарные исследования', 'master');

--UPDATE course
--SET education_level = 'bachelor'
--WHERE education_level = 'postgraduate';


-- Добавляем кафедры для каждого факультета
INSERT INTO department (faculty_id, "name")
VALUES
-- Факультет биологии и экологии
(1, 'Кафедра биологии'),
(1, 'Кафедра экологии'),
(1, 'Кафедра зоологии'),

-- Факультет информатики и вычислительной техники
(2, 'Кафедра программирования'),
(2, 'Кафедра кибербезопасности'),
(2, 'Кафедра информационных технологий'),

-- Исторический факультет
(3, 'Кафедра истории'),
(3, 'Кафедра археологии'),
(3, 'Кафедра культурологии'),

-- Математический факультет
(4, 'Кафедра математики'),
(4, 'Кафедра прикладной математики'),
(4, 'Кафедра статистики'),

-- Факультет психологии
(5, 'Кафедра психологии'),
(5, 'Кафедра клинической психологии'),
(5, 'Кафедра социальной психологии'),

-- Факультет социально-политических наук
(6, 'Кафедра политологии'),
(6, 'Кафедра социологии'),
(6, 'Кафедра социальной работы'),

-- Факультет иностранных языков
(7, 'Кафедра филологии'),
(7, 'Кафедра лингвистики'),
(7, 'Кафедра перевода'),

-- Факультет физики
(8, 'Кафедра физики'),
(8, 'Кафедра космической физики'),
(8, 'Кафедра квантовой физики'),

-- Факультет филологии и коммуникации
(9, 'Кафедра журналистики'),
(9, 'Кафедра коммуникаций'),

-- Экономический факультет
(10, 'Кафедра экономики'),
(10, 'Кафедра финансов'),
(10, 'Кафедра бухгалтерского учета'),

-- Юридический факультет
(11, 'Кафедра правоведения'),
(11, 'Кафедра уголовного права'),

-- Университетский колледж
(12, 'Кафедра общего образования'),
(12, 'Кафедра кросс-дисциплинарных исследований');

-- Добавляем преподавателей для каждой кафедры
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
-- Кафедра биологии
(1, 'Иванов', 'Иван', 'Иванович'),
(1, 'Петрова', 'Анна', 'Алексеевна'),
(1, 'Коваленко', 'Олег', 'Сергеевич'),

-- Кафедра экологии
(2, 'Сидоренко', 'Михаил', 'Андреевич'),
(2, 'Лебедева', 'Наталья', 'Дмитриевна'),
(2, 'Потапенко', 'Светлана', 'Васильевна'),

-- Кафедра зоологии
(3, 'Мартынов', 'Денис', 'Алексеевич'),
(3, 'Краковецкий', 'Дмитрий', 'Станиславович'),
(3, 'Беляев', 'Александр', 'Игоревич'),

-- Кафедра программирования
(4, 'Грищук', 'Артем', 'Викторович'),
(4, 'Смирнова', 'Елена', 'Николаевна'),
(4, 'Тарасюк', 'Анна', 'Владимировна'),

-- Кафедра кибербезопасности
(5, 'Иванова', 'Оксана', 'Петровна'),
(5, 'Кучеренко', 'Дмитрий', 'Юрьевич'),
(5, 'Савченко', 'Наталья', 'Сергеевна'),

-- Кафедра информационных технологий
(6, 'Баранов', 'Роман', 'Викторович'),
(6, 'Александров', 'Егор', 'Васильевич'),
(6, 'Логинов', 'Сергей', 'Анатольевич'),

-- Кафедра истории
(7, 'Громов', 'Владимир', 'Станиславович'),
(7, 'Лукашенко', 'Ирина', 'Владимировна'),
(7, 'Тихонов', 'Алексей', 'Петрович'),

-- Кафедра археологии
(8, 'Павлов', 'Максим', 'Олегович'),
(8, 'Мелехов', 'Дмитрий', 'Семенович'),

-- Кафедра культурологии
(9, 'Бекетов', 'Анатолий', 'Федорович'),

-- Кафедра математики (с греческим преподавателем)
(10, 'Пападопулос', 'Георгиос', 'Александрович'),
(10, 'Федоров', 'Николай', 'Иванович'),
(10, 'Миронов', 'Антон', 'Сергеевич'),

-- Кафедра прикладной математики
(11, 'Кузнецов', 'Денис', 'Викторович'),
(11, 'Михайлов', 'Игорь', 'Анатольевич'),

-- Кафедра статистики
(12, 'Нечаев', 'Алексей', 'Дмитриевич'),

-- Кафедра психологии
(13, 'Петров', 'Сергей', 'Васильевич'),
(13, 'Козлова', 'Анастасия', 'Петровна'),
(13, 'Гладкова', 'Ольга', 'Николаевна'),

-- Кафедра клинической психологии
(14, 'Соловьев', 'Антон', 'Станиславович'),
(14, 'Харченко', 'Елена', 'Анатольевна'),

-- Кафедра социальной психологии
(15, 'Горбачев', 'Виктор', 'Иванович'),

-- Кафедра политологии
(16, 'Сергеев', 'Максим', 'Дмитриевич'),
(16, 'Шевченко', 'Алексей', 'Игоревич'),
(16, 'Зайцев', 'Игорь', 'Станиславович'),

-- Кафедра социологии
(17, 'Мирошниченко', 'Ольга', 'Алексеевна'),
(17, 'Костенко', 'Светлана', 'Петровна'),

-- Кафедра социальной работы
(18, 'Дьяченко', 'Наталья', 'Станиславовна'),

-- Кафедра филологии
(19, 'Иваненко', 'Андрей', 'Валерьевич'),
(19, 'Котов', 'Денис', 'Олегович'),

-- Кафедра лингвистики
(20, 'Лисицын', 'Евгений', 'Михайлович'),
(20, 'Головко', 'Людмила', 'Владимировна'),

-- Кафедра перевода
(21, 'Шпак', 'Наталья', 'Юрьевна'),

-- Кафедра физики
(22, 'Григорьев', 'Дмитрий', 'Анатольевич'),
(22, 'Соломонов', 'Роман', 'Игоревич'),

-- Кафедра космической физики
(23, 'Ефимов', 'Александр', 'Станиславович'),
(23, 'Лаптев', 'Николай', 'Иванович'),

-- Кафедра квантовой физики
(24, 'Дубровский', 'Виктор', 'Валерьевич'),

-- Кафедра журналистики
(25, 'Снегирев', 'Алексей', 'Станиславович'),
(25, 'Васильева', 'Анна', 'Ивановна'),

-- Кафедра коммуникаций
(26, 'Зайцева', 'Наталья', 'Петровна'),

-- Кафедра экономики
(27, 'Киселев', 'Владимир', 'Дмитриевич'),
(27, 'Семенова', 'Татьяна', 'Николаевна'),

-- Кафедра финансов
(28, 'Федосов', 'Денис', 'Анатольевич'),
(28, 'Иванов', 'Олег', 'Игоревич'),

-- Кафедра бухгалтерского учета
(29, 'Гриценко', 'Людмила', 'Петровна'),

-- Кафедра правоведения
(30, 'Соболев', 'Сергей', 'Алексеевич'),
(30, 'Фомина', 'Елена', 'Викторовна'),

-- Кафедра уголовного права
(31, 'Якубович', 'Александр', 'Станиславович'),

-- Кафедра общего образования
(32, 'Петренко', 'Ирина', 'Николаевна'),
(32, 'Светличный', 'Анатолий', 'Петрович'),

-- Кафедра кросс-дисциплинарных исследований
(33, 'Романов', 'Дмитрий', 'Валерьевич');

UPDATE department
SET department_head_id = 
    CASE department_id
        WHEN 1 THEN (SELECT professor_id FROM professor WHERE department_id = 1 LIMIT 1)  -- Кафедра биологии
        WHEN 2 THEN (SELECT professor_id FROM professor WHERE department_id = 2 LIMIT 1)  -- Кафедра экологии
        WHEN 3 THEN (SELECT professor_id FROM professor WHERE department_id = 3 LIMIT 1)  -- Кафедра зоологии
        WHEN 4 THEN (SELECT professor_id FROM professor WHERE department_id = 4 LIMIT 1)  -- Кафедра программирования
        WHEN 5 THEN (SELECT professor_id FROM professor WHERE department_id = 5 LIMIT 1)  -- Кафедра кибербезопасности
        WHEN 6 THEN (SELECT professor_id FROM professor WHERE department_id = 6 LIMIT 1)  -- Кафедра информационных технологий
        WHEN 7 THEN (SELECT professor_id FROM professor WHERE department_id = 7 LIMIT 1)  -- Кафедра истории
        WHEN 8 THEN (SELECT professor_id FROM professor WHERE department_id = 8 LIMIT 1)  -- Кафедра археологии
        WHEN 9 THEN (SELECT professor_id FROM professor WHERE department_id = 9 LIMIT 1)  -- Кафедра культурологии
        WHEN 10 THEN (SELECT professor_id FROM professor WHERE department_id = 10 LIMIT 1) -- Кафедра математики
        WHEN 11 THEN (SELECT professor_id FROM professor WHERE department_id = 11 LIMIT 1) -- Кафедра прикладной математики
        WHEN 12 THEN (SELECT professor_id FROM professor WHERE department_id = 12 LIMIT 1) -- Кафедра статистики
        WHEN 13 THEN (SELECT professor_id FROM professor WHERE department_id = 13 LIMIT 1) -- Кафедра психологии
        WHEN 14 THEN (SELECT professor_id FROM professor WHERE department_id = 14 LIMIT 1) -- Кафедра клинической психологии
        WHEN 15 THEN (SELECT professor_id FROM professor WHERE department_id = 15 LIMIT 1) -- Кафедра социальной психологии
        WHEN 16 THEN (SELECT professor_id FROM professor WHERE department_id = 16 LIMIT 1) -- Кафедра политологии
        WHEN 17 THEN (SELECT professor_id FROM professor WHERE department_id = 17 LIMIT 1) -- Кафедра социологии
        WHEN 18 THEN (SELECT professor_id FROM professor WHERE department_id = 18 LIMIT 1) -- Кафедра социальной работы
        WHEN 19 THEN (SELECT professor_id FROM professor WHERE department_id = 19 LIMIT 1) -- Кафедра филологии
        WHEN 20 THEN (SELECT professor_id FROM professor WHERE department_id = 20 LIMIT 1) -- Кафедра лингвистики
        WHEN 21 THEN (SELECT professor_id FROM professor WHERE department_id = 21 LIMIT 1) -- Кафедра перевода
        WHEN 22 THEN (SELECT professor_id FROM professor WHERE department_id = 22 LIMIT 1) -- Кафедра физики
        WHEN 23 THEN (SELECT professor_id FROM professor WHERE department_id = 23 LIMIT 1) -- Кафедра космической физики
        WHEN 24 THEN (SELECT professor_id FROM professor WHERE department_id = 24 LIMIT 1) -- Кафедра квантовой физики
        WHEN 25 THEN (SELECT professor_id FROM professor WHERE department_id = 25 LIMIT 1) -- Кафедра журналистики
        WHEN 26 THEN (SELECT professor_id FROM professor WHERE department_id = 26 LIMIT 1) -- Кафедра коммуникаций
        WHEN 27 THEN (SELECT professor_id FROM professor WHERE department_id = 27 LIMIT 1) -- Кафедра экономики
        WHEN 28 THEN (SELECT professor_id FROM professor WHERE department_id = 28 LIMIT 1) -- Кафедра финансов
        WHEN 29 THEN (SELECT professor_id FROM professor WHERE department_id = 29 LIMIT 1) -- Кафедра бухгалтерского учета
        WHEN 30 THEN (SELECT professor_id FROM professor WHERE department_id = 30 LIMIT 1) -- Кафедра правоведения
        WHEN 31 THEN (SELECT professor_id FROM professor WHERE department_id = 31 LIMIT 1) -- Кафедра уголовного права
        WHEN 32 THEN (SELECT professor_id FROM professor WHERE department_id = 32 LIMIT 1) -- Кафедра общего образования
        WHEN 33 THEN (SELECT professor_id FROM professor WHERE department_id = 33 LIMIT 1) -- Кафедра кросс-дисциплинарных исследований
    END;

-- Добавляем преподавателей на кафедры с равномерным распределением от 1 до 4
-- Примерные данные. Вы можете изменить фамилии и имена на свои.
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
-- Кафедра биологии
(1, 'Иванов', 'Иван', 'Иванович'),  -- 1 преподаватель
(1, 'Петров', 'Сергей', 'Петрович'),

-- Кафедра экологии
(2, 'Сидоров', 'Алексей', 'Алексеевич'),  -- 3 преподавателя
(2, 'Семенова', 'Татьяна', 'Ивановна'),
(2, 'Коваленко', 'Олег', 'Сергеевич'),

-- Кафедра зоологии
(3, 'Лебедев', 'Николай', 'Николаевич'),  -- 1 преподаватель

-- Кафедра программирования
(4, 'Грищук', 'Артем', 'Викторович'),  -- 2 преподавателя
(4, 'Смирнова', 'Елена', 'Николаевна'),

-- Кафедра кибербезопасности
(5, 'Тарасюк', 'Анна', 'Владимировна'),  -- 3 преподавателя
(5, 'Иванова', 'Оксана', 'Петровна'),
(5, 'Шевченко', 'Александр', 'Дмитриевич'),

-- Кафедра информационных технологий
(6, 'Баранов', 'Роман', 'Викторович'),  -- 4 преподавателя
(6, 'Александров', 'Егор', 'Васильевич'),
(6, 'Логинов', 'Сергей', 'Анатольевич'),
(6, 'Нечаев', 'Владимир', 'Иванович'),

-- Кафедра истории
(7, 'Громов', 'Владимир', 'Станиславович'),  -- 2 преподавателя
(7, 'Лукашенко', 'Ирина', 'Владимировна'),

-- Кафедра археологии
(8, 'Павлов', 'Максим', 'Олегович'),  -- 1 преподаватель

-- Кафедра культурологии
(9, 'Бекетов', 'Анатолий', 'Федорович'),  -- 3 преподавателя
(9, 'Костенко', 'Светлана', 'Петровна'),
(9, 'Кравченко', 'Наталья', 'Ивановна'),

-- Кафедра математики (с греческим преподавателем)
(10, 'Пападопулос', 'Георгиос', 'Александрович'),  -- 4 преподавателя
(10, 'Федоров', 'Николай', 'Иванович'),
(10, 'Миронов', 'Антон', 'Сергеевич'),
(10, 'Михайлов', 'Петр', 'Анатольевич'),

-- Кафедра прикладной математики
(11, 'Кузнецов', 'Денис', 'Викторович'),  -- 3 преподавателя
(11, 'Михайлов', 'Игорь', 'Анатольевич'),
(11, 'Сидоренко', 'Светлана', 'Дмитриевна'),

-- Кафедра статистики
(12, 'Нечаев', 'Алексей', 'Дмитриевич'),  -- 1 преподаватель

-- Кафедра психологии
(13, 'Петров', 'Сергей', 'Васильевич'),  -- 4 преподавателя
(13, 'Козлова', 'Анастасия', 'Петровна'),
(13, 'Гладкова', 'Ольга', 'Николаевна'),
(13, 'Соловьев', 'Антон', 'Станиславович'),

-- Кафедра клинической психологии
(14, 'Харченко', 'Елена', 'Анатольевна'),  -- 1 преподаватель

-- Кафедра социальной психологии
(15, 'Горбачев', 'Виктор', 'Иванович'),  -- 2 преподавателя
(15, 'Белоусов', 'Сергей', 'Дмитриевич'),

-- Кафедра политологии
(16, 'Сергеев', 'Максим', 'Дмитриевич'),  -- 3 преподавателя
(16, 'Шевченко', 'Алексей', 'Игоревич'),
(16, 'Зайцев', 'Игорь', 'Станиславович'),

-- Кафедра социологии
(17, 'Мирошниченко', 'Ольга', 'Алексеевна'),  -- 2 преподавателя
(17, 'Костенко', 'Светлана', 'Петровна'),

-- Кафедра социальной работы
(18, 'Дьяченко', 'Наталья', 'Станиславовна'),  -- 1 преподаватель

-- Кафедра филологии
(19, 'Иваненко', 'Андрей', 'Валерьевич'),  -- 4 преподавателя
(19, 'Котов', 'Денис', 'Олегович'),
(19, 'Снегирев', 'Алексей', 'Станиславович'),
(19, 'Крылова', 'Мария', 'Петровна'),

-- Кафедра лингвистики
(20, 'Лисицын', 'Евгений', 'Михайлович'),  -- 2 преподавателя
(20, 'Головко', 'Людмила', 'Владимировна'),

-- Кафедра перевода
(21, 'Шпак', 'Наталья', 'Юрьевна'),  -- 3 преподавателя
(21, 'Сорокин', 'Игорь', 'Станиславович'),
(21, 'Громова', 'Анна', 'Дмитриевна'),

-- Кафедра физики
(22, 'Григорьев', 'Дмитрий', 'Анатольевич'),  -- 1 преподаватель

-- Кафедра космической физики
(23, 'Ефимов', 'Александр', 'Станиславович'),  -- 3 преподавателя
(23, 'Лаптев', 'Николай', 'Иванович'),
(23, 'Каштанов', 'Денис', 'Петрович'),

-- Кафедра квантовой физики
(24, 'Дубровский', 'Виктор', 'Валерьевич'),  -- 1 преподаватель

-- Кафедра журналистики
(25, 'Снегирев', 'Алексей', 'Станиславович'),  -- 2 преподавателя
(25, 'Васильева', 'Анна', 'Ивановна'),

-- Кафедра коммуникаций
(26, 'Зайцева', 'Наталья', 'Петровна'),  -- 4 преподавателя
(26, 'Савельева', 'Юлия', 'Анатольевна'),
(26, 'Кутузов', 'Евгений', 'Викторович'),
(26, 'Олейников', 'Тимур', 'Олегович'),

-- Кафедра экономики
(27, 'Киселев', 'Владимир', 'Дмитриевич'),  -- 3 преподавателя
(27, 'Семенова', 'Татьяна', 'Николаевна'),
(27, 'Беспалов', 'Андрей', 'Валерьевич'),

-- Кафедра финансов
(28, 'Федосов', 'Денис', 'Анатольевич'),  -- 2 преподавателя
(28, 'Иванов', 'Олег', 'Игоревич'),

-- Кафедра бухгалтерского учета
(29, 'Гриценко', 'Людмила', 'Петровна'),  -- 1 преподаватель

-- Кафедра правоведения
(30, 'Соболев', 'Сергей', 'Алексеевич'),  -- 4 преподавателя
(30, 'Фомина', 'Елена', 'Викторовна'),
(30, 'Смирнов', 'Игорь', 'Анатольевич'),
(30, 'Гладков', 'Степан', 'Станиславович'),

-- Кафедра уголовного права
(31, 'Якубович', 'Александр', 'Станиславович'),  -- 2 преподавателя
(31, 'Климова', 'Мария', 'Алексеевна'),

-- Кафедра общего образования
(32, 'Петренко', 'Ирина', 'Николаевна'),  -- 1 преподаватель

-- Кафедра кросс-дисциплинарных исследований
(33, 'Романов', 'Дмитрий', 'Валерьевич'),   -- 2 преподавателя
(33, 'Баранов', 'Евгений', 'Алексеевич');

-- Добавляем преподавателей для каждой кафедры
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
-- Кафедра биологии
(1, 'Иванов', 'Иван', 'Иванович'),
(1, 'Петрова', 'Анна', 'Сергеевна'),
(1, 'Сидоров', 'Дмитрий', 'Александрович'),
(1, 'Акимов', 'Олег', 'Анатольевич'),
(1, 'Мухамедов', 'Али', 'Султанович'),

-- Кафедра экологии
(2, 'Ларина', 'Елена', 'Викторовна'),
(2, 'Смирнов', 'Алексей', 'Станиславович'),
(2, 'Тимуров', 'Сергей', 'Юрьевич'),

-- Кафедра зоологии
(3, 'Кузнецов', 'Николай', 'Владимирович'),
(3, 'Старостин', 'Максим', 'Николаевич'),
(3, 'Ашуров', 'Рустам', 'Алиевич'),
(3, 'Турганбаев', 'Досым', 'Касымович'),

-- Кафедра программирования
(4, 'Петров', 'Владимир', 'Иванович'),
(4, 'Григорьева', 'Мария', 'Александровна'),
(4, 'Ковалев', 'Александр', 'Сергеевич'),
(4, 'Сидорова', 'Ольга', 'Вячеславовна'),

-- Кафедра кибербезопасности
(5, 'Набиева', 'Майя', 'Ильгизовна'),
(5, 'Фармаков', 'Станислав', 'Александрович'),

-- Кафедра информационных технологий
(6, 'Денисов', 'Роман', 'Юрьевич'),
(6, 'Герасимова', 'Наталья', 'Станиславовна'),
(6, 'Ибрагимов', 'Рустем', 'Рауфович'),

-- Кафедра истории
(7, 'Белов', 'Артем', 'Сергеевич'),
(7, 'Ермолаев', 'Георгий', 'Анатольевич'),
(7, 'Смирнова', 'Ксения', 'Дмитриевна'),

-- Кафедра археологии
(8, 'Гусев', 'Игорь', 'Сергеевич'),
(8, 'Абдуллаев', 'Нурлан', 'Амангельдиевич'),
(8, 'Павлова', 'Анна', 'Петровна'),

-- Кафедра культурологии
(9, 'Лебедев', 'Степан', 'Валерьевич'),
(9, 'Зайцева', 'Вера', 'Федоровна'),

-- Кафедра математики
(10, 'Головин', 'Илья', 'Александрович'),
(10, 'Дмитриев', 'Станислав', 'Евгеньевич'),
(10, 'Зимина', 'Светлана', 'Михайловна'),

-- Кафедра прикладной математики
(11, 'Савельев', 'Вадим', 'Дмитриевич'),
(11, 'Костина', 'Юлия', 'Алексеевна'),
(11, 'Суханов', 'Денис', 'Геннадьевич'),
(11, 'Левина', 'Мира', 'Фатиховна'),

-- Кафедра статистики
(12, 'Фролов', 'Павел', 'Сергеевич'),
(12, 'Черняев', 'Василий', 'Петрович'),

-- Кафедра психологии
(13, 'Филиппова', 'Людмила', 'Станиславовна'),
(13, 'Романов', 'Григорий', 'Игоревич'),

-- Кафедра клинической психологии
(14, 'Серова', 'Наталья', 'Викторовна'),
(14, 'Егоров', 'Роман', 'Николаевич'),

-- Кафедра социальной психологии
(15, 'Терентьева', 'Ольга', 'Петровна'),

-- Кафедра политологии
(16, 'Васильев', 'Станислав', 'Станиславович'),
(16, 'Молотова', 'Татьяна', 'Владимировна'),

-- Кафедра социологии
(17, 'Богданов', 'Дмитрий', 'Денисович'),
(17, 'Устинова', 'Маргарита', 'Сергеевна'),

-- Кафедра социальной работы
(18, 'Лавров', 'Петр', 'Александрович'),

-- Кафедра филологии
(19, 'Седова', 'Алина', 'Игоревна'),
(19, 'Коновалова', 'Наталья', 'Станиславовна'),

-- Кафедра лингвистики
(20, 'Сергеева', 'Татьяна', 'Филипповна'),
(20, 'Морозов', 'Николай', 'Вячеславович'),

-- Кафедра перевода
(21, 'Коваль', 'Ирина', 'Юрьевна'),

-- Кафедра физики
(22, 'Соловьев', 'Александр', 'Игоревич'),
(22, 'Барышева', 'Елизавета', 'Станиславовна'),

-- Кафедра космической физики
(23, 'Тихонов', 'Виктор', 'Сергеевич'),
(23, 'Маслова', 'Оксана', 'Владимировна'),

-- Кафедра квантовой физики
(24, 'Кравцов', 'Егор', 'Валерьевич'),
(24, 'Фомина', 'Мария', 'Александровна'),

-- Кафедра журналистики
(25, 'Терешкова', 'Юлия', 'Николаевна'),
(25, 'Галковский', 'Роман', 'Олегович'),

-- Кафедра коммуникаций
(26, 'Малюгина', 'Нина', 'Станиславовна'),

-- Кафедра экономики
(27, 'Забродин', 'Виктор', 'Семенович'),
(27, 'Яковлева', 'Ольга', 'Николаевна'),

-- Кафедра финансов
(28, 'Торопова', 'Анастасия', 'Дмитриевна'),
(28, 'Шевченко', 'Антон', 'Алексеевич'),

-- Кафедра бухгалтерского учета
(29, 'Соколов', 'Анатолий', 'Сергеевич'),

-- Кафедра правоведения
(30, 'Федосов', 'Кирилл', 'Дмитриевич'),
(30, 'Масленникова', 'Алина', 'Романовна'),

-- Кафедра уголовного права
(31, 'Ефремов', 'Денис', 'Станиславович'),
(31, 'Сергеев', 'Григорий', 'Петрович'),

-- Кафедра общего образования
(32, 'Гусева', 'Светлана', 'Юрьевна'),
(32, 'Костенко', 'Алексей', 'Владимирович'),

-- Кафедра кросс-дисциплинарных исследований
(33, 'Павленко', 'Роман', 'Дмитриевич');

-- Добавляем по одному преподавателю на разные кафедры
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
-- Кафедра экологии (Беларусь)
(2, 'Ковалёв', 'Александр', 'Викторович'),  -- Беларусская фамилия

-- Кафедра психологии (Украина)
(5, 'Шевченко', 'Оксана', 'Андреевна'),     -- Украинская фамилия

-- Кафедра истории (Германия)
(7, 'Мюллер', 'Кристиан', 'Фридрихович'),   -- Немецкая фамилия

-- Кафедра программирования (Китай)
(4, 'Ли', 'Вэй', 'Чжун'),                     -- Китайская фамилия

-- Кафедра финансов (Турция)
(10, 'Ялчин', 'Али', 'Мехметович');          -- Турецкая фамилия

-- Кафедра биологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(1, 'Сидоров', 'Иван', 'Александрович'),
(1, 'Петров', 'Мария', 'Сергеевна'),
(1, 'Тихонов', 'Сергей', 'Дмитриевич'),
(1, 'Григорьева', 'Ольга', 'Ивановна'),
(1, 'Дьяков', 'Алексей', 'Владимирович'),
(1, 'Ширяев', 'Николай', 'Михайлович'),
(1, 'Кузнецова', 'Екатерина', 'Станиславовна'),
(1, 'Федоров', 'Виктор', 'Романович');

-- Кафедра экологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(2, 'Ковалёв', 'Александр', 'Викторович'),
(2, 'Зайцева', 'Анна', 'Петровна'),
(2, 'Голубев', 'Денис', 'Игоревич'),
(2, 'Соловьёв', 'Елена', 'Викторовна'),
(2, 'Николаев', 'Станислав', 'Денисович'),
(2, 'Семенова', 'Ирина', 'Сергеевна');

-- Кафедра зоологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(3, 'Мартынов', 'Вадим', 'Петрович'),
(3, 'Шевченко', 'Анастасия', 'Дмитриевна'),
(3, 'Рябов', 'Максим', 'Александрович'),
(3, 'Евдокимова', 'Юлия', 'Сергеевна'),
(3, 'Еремин', 'Дмитрий', 'Валерьевич'),
(3, 'Артемова', 'Татьяна', 'Игоревна'),
(3, 'Котов', 'Игорь', 'Анатольевич');

-- Кафедра программирования
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(4, 'Иванов', 'Петр', 'Андреевич'),
(4, 'Ли', 'Вэй', 'Чжун'),                      -- Китайская фамилия
(4, 'Петров', 'Дмитрий', 'Сергеевич'),
(4, 'Мартынова', 'Светлана', 'Николаевна'),
(4, 'Коваль', 'Ярослав', 'Игоревич'),
(4, 'Мишина', 'Тамара', 'Вячеславовна'),
(4, 'Соловьёв', 'Георгий', 'Анатольевич');

-- Кафедра кибербезопасности
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(5, 'Суровцев', 'Анатолий', 'Петрович'),
(5, 'Гончарова', 'Людмила', 'Станиславовна'),
(5, 'Мюллер', 'Кристиан', 'Фридрихович'),   -- Немецкая фамилия
(5, 'Тимошенко', 'Алексей', 'Валерьевич'),
(5, 'Фролова', 'Светлана', 'Александровна');

-- Кафедра информационных технологий
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(6, 'Григорьев', 'Александр', 'Вячеславович'),
(6, 'Калинина', 'Надежда', 'Сергеевна'),
(6, 'Ширяев', 'Дмитрий', 'Александрович'),
(6, 'Львов', 'Станислав', 'Игоревич'),
(6, 'Никитина', 'Юлия', 'Анатольевна'),
(6, 'Громова', 'Елена', 'Владимировна'),
(6, 'Захаров', 'Артем', 'Николаевич'),
(6, 'Иванов', 'Максим', 'Дмитриевич');

-- Кафедра истории
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(7, 'Сидорова', 'Анна', 'Владимировна'),
(7, 'Тихомиров', 'Сергей', 'Александрович'),
(7, 'Мухина', 'Татьяна', 'Игоревна'),
(7, 'Штанько', 'Николай', 'Петрович'),
(7, 'Ковалев', 'Александр', 'Романович'),
(7, 'Сергеева', 'Дарья', 'Денисовна');

-- Кафедра культурологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(8, 'Козлов', 'Максим', 'Александрович'),
(8, 'Гуляев', 'Виктор', 'Викторович'),
(8, 'Алексеева', 'Ольга', 'Викторовна'),
(8, 'Галиева', 'Лилия', 'Альфировна'),
(8, 'Ковалёв', 'Мирослав', 'Олегович'),
(8, 'Шевчук', 'Светлана', 'Анатольевна');

-- Кафедра психологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(9, 'Семенов', 'Андрей', 'Викторович'),
(9, 'Золотарева', 'Лариса', 'Станиславовна'),
(9, 'Кулешова', 'Светлана', 'Александровна'),
(9, 'Якубов', 'Алексей', 'Дмитриевич'),
(9, 'Романов', 'Денис', 'Романович'),
(9, 'Соломонова', 'Галина', 'Степановна'),
(9, 'Стариков', 'Игорь', 'Николаевич');

-- Кафедра клинической психологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(10, 'Шубина', 'Алина', 'Игоревна'),
(10, 'Воронова', 'Анастасия', 'Сергеевна'),
(10, 'Якимов', 'Сергей', 'Анатольевич'),
(10, 'Горбачёв', 'Илья', 'Валерьевич'),
(10, 'Руденко', 'Евгений', 'Геннадьевич'),
(10, 'Лебедев', 'Станислав', 'Александрович');

-- Кафедра социальной психологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(11, 'Фомичев', 'Антон', 'Владимирович'),
(11, 'Якубова', 'Ксения', 'Романовна'),
(11, 'Варламова', 'Ольга', 'Сергеевна'),
(11, 'Головкин', 'Игорь', 'Алексеевич'),
(11, 'Кириллова', 'Татьяна', 'Дмитриевна'),
(11, 'Афанасьев', 'Дмитрий', 'Викторович');

-- Кафедра политологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(12, 'Светлов', 'Павел', 'Вячеславович'),
(12, 'Пушкина', 'Олеся', 'Степановна'),
(12, 'Смирнов', 'Станислав', 'Анатольевич'),
(12, 'Егоров', 'Дмитрий', 'Игоревич'),
(12, 'Семенов', 'Леонид', 'Петрович'),
(12, 'Федорова', 'Екатерина', 'Геннадьевна');

-- Кафедра социологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(13, 'Ларина', 'Анастасия', 'Викторовна'),
(13, 'Беляев', 'Владимир', 'Станиславович'),
(13, 'Харченко', 'Елена', 'Александровна'),
(13, 'Глазунов', 'Роман', 'Анатольевич'),
(13, 'Терехова', 'Нина', 'Валерьевна'),
(13, 'Жуков', 'Григорий', 'Алексеевич');

-- Кафедра социальной работы
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(14, 'Соловьев', 'Денис', 'Анатольевич'),
(14, 'Богданова', 'Евгения', 'Викторовна'),
(14, 'Маликов', 'Степан', 'Валерьевич'),
(14, 'Бакумов', 'Роман', 'Станиславович'),
(14, 'Васильева', 'Екатерина', 'Алексеевна'),
(14, 'Дмитриев', 'Георгий', 'Николаевич');

-- Кафедра филологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(15, 'Лебедева', 'Наталья', 'Ивановна'),
(15, 'Дорошенко', 'Алексей', 'Дмитриевич'),
(15, 'Крамаренко', 'Евгения', 'Владимировна'),
(15, 'Станиславская', 'Татьяна', 'Алексеевна'),
(15, 'Филатов', 'Станислав', 'Сергеевич'),
(15, 'Ямамото', 'Сатоси', 'Хирошиевич');  -- Японская фамилия

-- Кафедра лингвистики
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(16, 'Михайлов', 'Андрей', 'Викторович'),
(16, 'Тихонова', 'Наталья', 'Станиславовна'),
(16, 'Шубин', 'Станислав', 'Геннадьевич'),
(16, 'Дуров', 'Геннадий', 'Игоревич'),
(16, 'Солдатов', 'Анатолий', 'Петрович');

-- Кафедра перевода
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(17, 'Громов', 'Григорий', 'Петрович'),
(17, 'Трошина', 'Вера', 'Александровна'),
(17, 'Иванов', 'Сергей', 'Анатольевич'),
(17, 'Фролов', 'Денис', 'Игоревич'),
(17, 'Чуркин', 'Николай', 'Анатольевич');

-- Кафедра физики
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(18, 'Смирнов', 'Иван', 'Анатольевич'),
(18, 'Сазонов', 'Андрей', 'Станиславович'),
(18, 'Непомнящий', 'Виктор', 'Владимирович'),
(18, 'Терещенко', 'Светлана', 'Дмитриевна'),
(18, 'Зайцева', 'Мария', 'Игоревна'),
(18, 'Кириллова', 'Олеся', 'Денисовна'),
(18, 'Прокофьева', 'Татьяна', 'Алексеевна');

-- Кафедра космической физики
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(19, 'Лебедев', 'Николай', 'Сергеевич'),
(19, 'Степанова', 'Наталья', 'Анатольевна'),
(19, 'Денисов', 'Станислав', 'Игоревич'),
(19, 'Федоров', 'Владимир', 'Петрович'),
(19, 'Александров', 'Михаил', 'Дмитриевич');

-- Кафедра квантовой физики
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(20, 'Васильев', 'Кирилл', 'Алексеевич'),
(20, 'Мельников', 'Павел', 'Дмитриевич'),
(20, 'Федотов', 'Николай', 'Александрович'),
(20, 'Мурзин', 'Сергей', 'Петрович'),
(20, 'Григорьев', 'Олег', 'Станиславович'),
(20, 'Афанасьев', 'Тимур', 'Викторович');

-- Кафедра журналистики
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(21, 'Королёв', 'Денис', 'Игоревич'),
(21, 'Сидорова', 'Екатерина', 'Александровна'),
(21, 'Тепляков', 'Станислав', 'Сергеевич'),
(21, 'Шумкова', 'Татьяна', 'Николаевна'),
(21, 'Демидова', 'Дарья', 'Алексеевна');

-- Кафедра коммуникаций
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(22, 'Голубев', 'Антон', 'Валерьевич'),
(22, 'Воробьев', 'Григорий', 'Алексеевич'),
(22, 'Гришина', 'Алина', 'Александровна'),
(22, 'Митрофанова', 'Елизавета', 'Викторовна'),
(22, 'Захарова', 'Анастасия', 'Станиславовна');

-- Кафедра общего образования
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(23, 'Селезнёв', 'Владимир', 'Петрович'),
(23, 'Калинин', 'Николай', 'Иванович'),
(23, 'Лисовский', 'Дмитрий', 'Сергеевич'),
(23, 'Громова', 'Елена', 'Александровна'),
(23, 'Тихомиров', 'Станислав', 'Денисович'),
(23, 'Семенова', 'Анна', 'Александровна'),
(23, 'Морозов', 'Игорь', 'Владимирович');

-- Кафедра кросс-дисциплинарных исследований
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(24, 'Дьячков', 'Анатолий', 'Николаевич'),
(24, 'Кузьмина', 'Мария', 'Александровна'),
(24, 'Савченко', 'Денис', 'Станиславович'),
(24, 'Никитина', 'Евгения', 'Геннадьевна'),
(24, 'Терехов', 'Игорь', 'Александрович'),
(24, 'Сидорова', 'Виктория', 'Игоревна');

-- Кафедра религиоведения
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(25, 'Ермакова', 'Светлана', 'Алексеевна'),
(25, 'Хомяков', 'Степан', 'Николаевич'),
(25, 'Губарева', 'Дарья', 'Викторовна'),
(25, 'Панфилова', 'Людмила', 'Геннадьевна'),
(25, 'Кочетков', 'Анатолий', 'Дмитриевич'),
(25, 'Шевченко', 'Оксана', 'Игоревна');

-- Кафедра культурологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(26, 'Бояркин', 'Андрей', 'Викторович'),
(26, 'Смирнова', 'Ксения', 'Владимировна'),
(26, 'Волков', 'Илья', 'Петрович'),
(26, 'Алексеева', 'Марина', 'Дмитриевна'),
(26, 'Шереметев', 'Георгий', 'Анатольевич'),
(26, 'Зотов', 'Лев', 'Сергеевич');

-- Кафедра философии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(27, 'Кириллов', 'Станислав', 'Романович'),
(27, 'Калинина', 'Елизавета', 'Станиславовна'),
(27, 'Сидоров', 'Евгений', 'Валерьевич'),
(27, 'Степанова', 'Надежда', 'Викторовна'),
(27, 'Петров', 'Григорий', 'Михайлович'),
(27, 'Лебедева', 'Анастасия', 'Дмитриевна');

-- Кафедра социальной работы
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(28, 'Логинов', 'Роман', 'Алексеевич'),
(28, 'Афанасьева', 'Татьяна', 'Ивановна'),
(28, 'Сапожников', 'Денис', 'Николаевич'),
(28, 'Фролова', 'Галина', 'Сергеевна'),
(28, 'Яковлев', 'Павел', 'Станиславович'),
(28, 'Климова', 'Светлана', 'Алексеевна');

-- Кафедра социальных наук
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(29, 'Виноградова', 'Инна', 'Дмитриевна'),
(29, 'Доронин', 'Максим', 'Анатольевич'),
(29, 'Захарова', 'Олеся', 'Станиславовна'),
(29, 'Кутузова', 'Лариса', 'Петровна'),
(29, 'Коваль', 'Олег', 'Игоревич'),
(29, 'Воронцова', 'Наталья', 'Викторовна');

-- Кафедра истории искусств
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(30, 'Сухов', 'Геннадий', 'Александрович'),
(30, 'Гребнев', 'Станислав', 'Николаевич'),
(30, 'Панков', 'Дмитрий', 'Сергеевич'),
(30, 'Левин', 'Алексей', 'Романович'),
(30, 'Титова', 'Татьяна', 'Ивановна'),
(30, 'Ефремова', 'Алиса', 'Денисовна');

-- Кафедра педагогики
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(31, 'Мартынов', 'Станислав', 'Игоревич'),
(31, 'Фёдоров', 'Николай', 'Владимирович'),
(31, 'Шатохин', 'Игорь', 'Александрович'),
(31, 'Киселёв', 'Денис', 'Игоревич'),
(31, 'Бакшеев', 'Сергей', 'Игоревич'),
(31, 'Борисова', 'Анна', 'Вячеславовна');

-- Кафедра экологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(32, 'Морозова', 'Светлана', 'Геннадьевна'),
(32, 'Денисенко', 'Анна', 'Игоревна'),
(32, 'Тетерина', 'Кристина', 'Станиславовна'),
(32, 'Скворцов', 'Анатолий', 'Викторович'),
(32, 'Воробьёв', 'Сергей', 'Михайлович'),
(32, 'Демиденко', 'Светлана', 'Алексеевна');

-- Кафедра ботаники
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(33, 'Сидоренко', 'Николай', 'Дмитриевич'),
(33, 'Говорова', 'Елена', 'Сергеевна'),
(33, 'Лукьянов', 'Станислав', 'Анатольевич'),
(33, 'Петрова', 'Татьяна', 'Алексеевна'),
(33, 'Тимофеев', 'Дмитрий', 'Станиславович'),
(33, 'Федосеева', 'Людмила', 'Игоревна');


INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 1, 'Громов', 'Алексей', 'Алексеевич', 3, '+79577922319', 'алексей.громов@example.com', '1999-08-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 1, 'Белов', 'Николай', 'Николаевич', 4, '+79872069631', 'николай.белов@example.com', '2003-04-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 1, 'Васильев', 'Дмитрий', 'Дмитриевич', 3, '+79881835648', 'дмитрий.васильев@mail.ru', '2003-12-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 1, 'Кузнецов', 'Антон', 'Антонович', 4, '+79623531787', 'антон.кузнецов@gmail.com', '2003-06-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 1, 'Лебедев', 'Александр', 'Александрович', 3, '+79507929488', 'александр.лебедев@mail.ru', '2000-12-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 1, 'Захаров', 'Станислав', 'Станиславович', 3, '+79896971324', 'станислав.захаров@yandex.ru', '2004-11-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 1, 'Шевченко', 'Николай', 'Николаевич', 3, '+79206246659', 'николай.шевченко@yandex.ru', '2005-04-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 1, 'Петров', 'Денис', 'Денисович', 4, '+79762334454', 'денис.петров@gmail.com', '2000-12-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 1, 'Сидорова', 'Татьяна', 'Викторовна', 4, '+79789393508', 'татьяна.сидорова@gmail.com', '2005-01-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 1, 'Смирнов', 'Дмитрий', 'Дмитриевич', 3, '+79939906701', 'дмитрий.смирнов@gmail.com', '2004-11-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 1, 'Лебедев', 'Егор', 'Егорович', 3, '+79809686119', 'егор.лебедев@mail.ru', '2002-09-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 1, 'Тихомиров', 'Станислав', 'Станиславович', 4, '+79376169953', 'станислав.тихомиров@yandex.ru', '2004-02-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 1, 'Баранов', 'Денис', 'Денисович', 4, '+79708358743', 'денис.баранов@yandex.ru', '2005-05-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 1, 'Климов', 'Алексей', 'Алексеевич', 3, '+79035883169', 'алексей.климов@gmail.com', '2003-01-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 1, 'Васильева', 'Ольга', 'Сергеевна', 3, '+79357878321', 'ольга.васильева@yandex.ru', '2001-05-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 1, 'Астапенко', 'Тимофей', 'Тимофеевич', 3, '+79474793050', 'тимофей.астапенко@example.com', '2001-04-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 1, 'Ярославцева', 'Анастасия', 'Ивановна', 3, '+79619711912', 'анастасия.ярославцева@gmail.com', '1999-02-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 1, 'Капустин', 'Денис', 'Денисович', 3, '+79628383650', 'денис.капустин@example.com', '2004-11-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 1, 'Галкин', 'Михаил', 'Михайлович', 3, '+79496112148', 'михаил.галкин@gmail.com', '1999-02-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 1, 'Петрова', 'Екатерина', 'Дмитриевна', 4, '+79862804595', 'екатерина.петрова@yandex.ru', '2000-09-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 1, 'Михайлов', 'Александр', 'Александрович', 4, '+79815548776', 'александр.михайлов@example.com', '2003-01-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 1, 'Суворов', 'Даниил', 'Даниилович', 4, '+79915795022', 'даниил.суворов@gmail.com', '2000-08-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 1, 'Григорьева', 'Полина', 'Станиславовна', 4, '+79344620646', 'полина.григорьева@gmail.com', '2003-11-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 1, 'Ларин', 'Роман', 'Романович', 4, '+79246238377', 'роман.ларин@gmail.com', '2005-06-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 1, 'Кошелева', 'Татьяна', 'Сергеевна', 4, '+79605046492', 'татьяна.кошелева@gmail.com', '2000-11-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 2, 'Смирнов', 'Андрей', 'Алексеевич', 1, '+79794834750', 'андрей.смирнов@gmail.com', '1999-01-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 2, 'Петров', 'Евгений', 'Алексеевич', 1, '+79324519726', 'евгений.петров@mail.ru', '2003-07-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 2, 'Кузнецова', 'Мария', 'Игоревна', 1, '+79629604530', 'мария.кузнецова@example.com', '1999-05-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 2, 'Тихомиров', 'Станислав', 'Станиславович', 1, '+79288497556', 'станислав.тихомиров@yandex.ru', '2004-11-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 2, 'Громова', 'Анастасия', 'Владимировна', 1, '+79338694006', 'анастасия.громова@gmail.com', '2000-06-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 2, 'Шмидт', 'Татьяна', 'Григорьевна', 1, '+79637968678', 'татьяна.шмидт@example.com', '2003-03-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 2, 'Орлов', 'Игорь', 'Михайлович', 1, '+79326437143', 'игорь.орлов@mail.ru', '2004-11-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 2, 'Дубровин', 'Владимир', 'Сергеевич', 1, '+79254724156', 'владимир.дубровин@gmail.com', '2001-09-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 2, 'Зайцев', 'Алексей', 'Валерьевич', 1, '+79046325345', 'алексей.зайцев@yandex.ru', '2001-04-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 2, 'Ковальчук', 'Анна', 'Станиславовна', 1, '+79255618320', 'анна.ковальчук@example.com', '2004-12-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 2, 'Романов', 'Денис', 'Сергеевич', 1, '+79981304506', 'денис.романов@mail.ru', '2002-09-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 2, 'Ларин', 'Егор', 'Николаевич', 1, '+79217591779', 'егор.ларин@example.com', '2003-10-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 2, 'Сидорова', 'Виктория', 'Александровна', 2, '+79959051380', 'виктория.сидорова@mail.ru', '2000-11-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 2, 'Петров', 'Дмитрий', 'Владимирович', 2, '+79625252008', 'дмитрий.петров@mail.ru', '2000-09-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 2, 'Александров', 'Константин', 'Станиславович', 2, '+79233102568', 'константин.александров@gmail.com', '2002-05-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 2, 'Федорова', 'Елизавета', 'Анатольевна', 2, '+79155108048', 'елизавета.федорова@example.com', '2002-12-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 2, 'Зайцева', 'Светлана', 'Григорьевна', 2, '+79493904426', 'светлана.зайцева@yandex.ru', '2002-12-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 2, 'Герасимов', 'Роман', 'Иванович', 2, '+79366128655', 'роман.герасимов@gmail.com', '2000-03-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 2, 'Ковалев', 'Денис', 'Петрович', 2, '+79832846456', 'денис.ковалев@example.com', '2004-05-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 2, 'Савельев', 'Артем', 'Николаевич', 2, '+79931714917', 'артем.савельев@example.com', '2004-03-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 2, 'Беляев', 'Илья', 'Михайлович', 2, '+79642054289', 'илья.беляев@example.com', '2003-12-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 2, 'Лебедева', 'Алина', 'Викторовна', 2, '+79754637039', 'алина.лебедева@gmail.com', '2005-10-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 2, 'Никитина', 'Дарья', 'Ивановна', 2, '+79535694403', 'дарья.никитина@gmail.com', '1999-08-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 2, 'Шевченко', 'Оксана', 'Анатольевна', 2, '+79578251028', 'оксана.шевченко@mail.ru', '2001-12-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 3, 'Тимошенко', 'Екатерина', 'Сергеевна', 3, '+79788319710', 'екатерина.тимошенко@yandex.ru', '2001-05-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 3, 'Чекунов', 'Степан', 'Иванович', 3, '+79139044039', 'степан.чекунов@gmail.com', '2005-12-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 3, 'Благовещенский', 'Григорий', 'Сергеевич', 3, '+79128070563', 'григорий.благовещенский@example.com', '2004-03-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 3, 'Давыдова', 'Марина', 'Олеговна', 3, '+79546965061', 'марина.давыдова@yandex.ru', '2000-05-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 3, 'Борисова', 'Татьяна', 'Петровна', 3, '+79017471940', 'татьяна.борисова@gmail.com', '2003-04-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 3, 'Сергеев', 'Анатолий', 'Николаевич', 3, '+79585915059', 'анатолий.сергеев@yandex.ru', '2005-08-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 3, 'Ермаков', 'Артем', 'Александрович', 3, '+79046902383', 'артем.ермаков@yandex.ru', '2001-07-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 3, 'Каштанова', 'Вероника', 'Романовна', 3, '+79715845744', 'вероника.каштанова@yandex.ru', '2003-07-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 3, 'Шульгин', 'Никита', 'Иванович', 3, '+79141165295', 'никита.шульгин@yandex.ru', '2000-01-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 3, 'Костина', 'Юлия', 'Денисовна', 3, '+79702549332', 'юлия.костина@gmail.com', '2002-07-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 3, 'Рябов', 'Петр', 'Григорьевич', 3, '+79191954174', 'петр.рябов@yandex.ru', '2002-06-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 3, 'Глушкова', 'Светлана', 'Станиславовна', 3, '+79123748351', 'светлана.глушкова@yandex.ru', '2005-11-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 3, 'Широков', 'Александр', 'Михайлович', 3, '+79139232366', 'александр.широков@example.com', '2004-12-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 3, 'Платонов', 'Василий', 'Сергеевич', 3, '+79678316475', 'василий.платонов@mail.ru', '2004-09-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 3, 'Калинин', 'Виктор', 'Петрович', 4, '+79431308965', 'виктор.калинин@gmail.com', '1999-08-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 3, 'Гончарова', 'Евгения', 'Алексеевна', 4, '+79573703428', 'евгения.гончарова@gmail.com', '2004-10-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 3, 'Ищенко', 'Семен', 'Игоревич', 4, '+79693480547', 'семен.ищенко@example.com', '2003-02-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 3, 'Зимина', 'Екатерина', 'Николаевна', 4, '+79525841160', 'екатерина.зимина@yandex.ru', '2004-01-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 3, 'Ковалев', 'Алексей', 'Сергеевич', 4, '+79051010645', 'алексей.ковалев@mail.ru', '2002-01-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 3, 'Лавров', 'Анатолий', 'Дмитриевич', 4, '+79007358646', 'анатолий.лавров@example.com', '2003-11-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 3, 'Куликова', 'Лилия', 'Николаевна', 4, '+79328393070', 'лилия.куликова@example.com', '2000-12-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 3, 'Павлов', 'Станислав', 'Иванович', 4, '+79523700552', 'станислав.павлов@example.com', '2003-09-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 3, 'Лепешков', 'Дмитрий', 'Сергеевич', 4, '+79698168075', 'дмитрий.лепешков@gmail.com', '2001-07-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 3, 'Соболев', 'Андрей', 'Николаевич', 4, '+79925786759', 'андрей.соболев@example.com', '2005-05-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 3, 'Забелин', 'Петр', 'Станиславович', 4, '+79928136060', 'петр.забелин@yandex.ru', '2002-09-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 3, 'Лебедев', 'Георгий', 'Александрович', 4, '+79825262288', 'георгий.лебедев@example.com', '2000-05-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 3, 'Мельников', 'Роман', 'Денисович', 4, '+79486203059', 'роман.мельников@gmail.com', '2002-06-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 3, 'Чистякова', 'Оксана', 'Петровна', 4, '+79266137259', 'оксана.чистякова@mail.ru', '2002-12-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 4, 'Станиславова', 'Варвара', 'Анатольевна', 3, '+79358291032', 'варвара.станиславова@yandex.ru', '2004-05-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 4, 'Лобанова', 'Наталья', 'Сергеевна', 3, '+79137754674', 'наталья.лобанова@yandex.ru', '2001-01-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 4, 'Богданов', 'Артем', 'Вячеславович', 3, '+79664276374', 'артем.богданов@mail.ru', '1999-07-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 4, 'Гаврилова', 'Олеся', 'Дмитриевна', 3, '+79415491035', 'олеся.гаврилова@mail.ru', '1999-11-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 4, 'Печенкин', 'Роман', 'Александрович', 3, '+79306245081', 'роман.печенкин@mail.ru', '2002-11-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 4, 'Тихомиров', 'Игорь', 'Станиславович', 3, '+79926202017', 'игорь.тихомиров@example.com', '2002-03-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 4, 'Кудрявцев', 'Василий', 'Анатольевич', 3, '+79091947016', 'василий.кудрявцев@yandex.ru', '2001-04-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 4, 'Куприянов', 'Дмитрий', 'Геннадиевич', 3, '+79555607214', 'дмитрий.куприянов@gmail.com', '2001-07-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 4, 'Шевченко', 'Татьяна', 'Валерьевна', 3, '+79535406909', 'татьяна.шевченко@gmail.com', '2003-10-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 4, 'Петухов', 'Станислав', 'Иванович', 3, '+79589391605', 'станислав.петухов@yandex.ru', '2002-07-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 4, 'Медведева', 'Елизавета', 'Денисовна', 3, '+79646720076', 'елизавета.медведева@mail.ru', '2004-07-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 4, 'Соболев', 'Максим', 'Викторович', 3, '+79104738576', 'максим.соболев@example.com', '2005-10-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 4, 'Ларина', 'Анастасия', 'Валерьевна', 4, '+79803980374', 'анастасия.ларина@yandex.ru', '2001-03-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 4, 'Кудрявцева', 'Светлана', 'Сергеевна', 4, '+79165394951', 'светлана.кудрявцева@gmail.com', '2003-03-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 4, 'Синяков', 'Вячеслав', 'Станиславович', 4, '+79496805808', 'вячеслав.синяков@mail.ru', '2004-02-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 4, 'Зимин', 'Денис', 'Александрович', 4, '+79988159956', 'денис.зимин@mail.ru', '1999-10-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 4, 'Соколова', 'Ирина', 'Николаевна', 4, '+79513736036', 'ирина.соколова@yandex.ru', '2004-09-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 4, 'Анохина', 'Людмила', 'Григорьевна', 4, '+79641332140', 'людмила.анохина@mail.ru', '2005-02-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 4, 'Шубина', 'Маргарита', 'Игоревна', 4, '+79523025583', 'маргарита.шубина@yandex.ru', '2005-10-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 4, 'Зайцева', 'Татьяна', 'Алексеевна', 4, '+79013140546', 'татьяна.зайцева@gmail.com', '2005-11-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 4, 'Громов', 'Степан', 'Дмитриевич', 4, '+79835105664', 'степан.громов@mail.ru', '2004-12-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 4, 'Тихонов', 'Андрей', 'Иванович', 4, '+79898013133', 'андрей.тихонов@gmail.com', '2004-06-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 4, 'Маслов', 'Олег', 'Анатольевич', 4, '+79056238725', 'олег.маслов@mail.ru', '2004-05-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 4, 'Герасимова', 'Евгения', 'Денисовна', 4, '+79631768866', 'евгения.герасимова@yandex.ru', '2004-12-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 5, 'Иванов', 'Александр', 'Сергеевич', 1, '+79811747806', 'александр.иванов@gmail.com', '2003-11-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 5, 'Петрова', 'Мария', 'Ивановна', 1, '+79839498757', 'мария.петрова@example.com', '1999-07-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 5, 'Сидоров', 'Дмитрий', 'Станиславович', 1, '+79539686851', 'дмитрий.сидоров@gmail.com', '2000-11-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 5, 'Смирнова', 'Елена', 'Николаевна', 1, '+79438073744', 'елена.смирнова@example.com', '2000-05-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 5, 'Ковалев', 'Антон', 'Геннадиевич', 1, '+79588826414', 'антон.ковалев@example.com', '2005-04-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 5, 'Александрова', 'Татьяна', 'Петровна', 1, '+79159925541', 'татьяна.александрова@yandex.ru', '2004-08-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 5, 'Григорьев', 'Роман', 'Олегович', 1, '+79722099445', 'роман.григорьев@yandex.ru', '2002-05-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 5, 'Федоров', 'Игорь', 'Дмитриевич', 1, '+79385385142', 'игорь.федоров@yandex.ru', '1999-12-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 5, 'Шевченко', 'Оксана', 'Сергеевна', 1, '+79518901114', 'оксана.шевченко@mail.ru', '2000-02-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 5, 'Кириллова', 'Светлана', 'Викторовна', 1, '+79753551004', 'светлана.кириллова@gmail.com', '2005-02-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 5, 'Морозов', 'Денис', 'Николаевич', 1, '+79372899102', 'денис.морозов@yandex.ru', '2005-09-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 5, 'Савельев', 'Константин', 'Алексеевич', 1, '+79182682985', 'константин.савельев@example.com', '2003-02-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 5, 'Волкова', 'Нина', 'Валентиновна', 2, '+79755900588', 'нина.волкова@mail.ru', '2004-10-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 5, 'Тихомиров', 'Артем', 'Александрович', 2, '+79781062212', 'артем.тихомиров@yandex.ru', '2002-11-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 5, 'Данилова', 'Елизавета', 'Владимировна', 2, '+79081610486', 'елизавета.данилова@gmail.com', '2001-09-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 5, 'Солдатова', 'Людмила', 'Григорьевна', 2, '+79506532932', 'людмила.солдатова@example.com', '2003-11-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 5, 'Коваль', 'Тимофей', 'Степанович', 2, '+79174229770', 'тимофей.коваль@gmail.com', '1999-05-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 5, 'Малахов', 'Петр', 'Игоревич', 2, '+79084198487', 'петр.малахов@gmail.com', '2003-02-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 5, 'Горбунова', 'Анна', 'Николаевна', 2, '+79985518611', 'анна.горбунова@mail.ru', '2000-07-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 5, 'Сидоренко', 'Данил', 'Петрович', 2, '+79536552829', 'данил.сидоренко@gmail.com', '2000-07-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 5, 'Бурмистрова', 'Ольга', 'Ивановна', 2, '+79111187193', 'ольга.бурмистрова@yandex.ru', '2002-02-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (2, 5, 'Рябова', 'Ксения', 'Алексеевна', 2, '+79166195813', 'ксения.рябова@example.com', '2004-01-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (3, 5, 'Шульгин', 'Семен', 'Анатольевич', 2, '+79864914528', 'семен.шульгин@example.com', '2003-10-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (1, 5, 'Белов', 'Ярослав', 'Михайлович', 2, '+79753791510', 'ярослав.белов@example.com', '2001-08-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 6, 'Солдатова', 'Людмила', 'Григорьевна', 3, '+79522923603', 'людмила.солдатова@example.com', '2000-02-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 6, 'Лобанова', 'Светлана', 'Петровна', 3, '+79698127403', 'светлана.лобанова@mail.ru', '2002-06-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 6, 'Семёнов', 'Григорий', 'Анатольевич', 3, '+79267595673', 'григорий.семёнов@mail.ru', '2002-03-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 6, 'Андреева', 'Ксения', 'Денисовна', 3, '+79979847338', 'ксения.андреева@mail.ru', '2003-07-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 6, 'Сафонова', 'Антонина', 'Николаевна', 3, '+79143737992', 'антонина.сафонова@yandex.ru', '2002-03-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 6, 'Тихомирова', 'Елена', 'Сергеевна', 3, '+79936458107', 'елена.тихомирова@gmail.com', '2002-12-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 6, 'Калашников', 'Илья', 'Станиславович', 3, '+79769070236', 'илья.калашников@example.com', '2004-12-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 6, 'Синяков', 'Степан', 'Игоревич', 3, '+79156949293', 'степан.синяков@gmail.com', '1999-10-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 6, 'Егорова', 'Татьяна', 'Михайловна', 3, '+79968905626', 'татьяна.егорова@example.com', '2000-08-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 6, 'Мартынов', 'Петр', 'Станиславович', 3, '+79378008192', 'петр.мартынов@mail.ru', '1999-03-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 6, 'Федосеев', 'Игорь', 'Геннадиевич', 4, '+79868215444', 'игорь.федосеев@yandex.ru', '1999-04-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 6, 'Кудрявцева', 'Елизавета', 'Денисовна', 4, '+79959754944', 'елизавета.кудрявцева@gmail.com', '2000-12-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 6, 'Степанова', 'София', 'Петровна', 4, '+79716261528', 'софия.степанова@example.com', '2001-05-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 6, 'Снегирева', 'Анна', 'Викторовна', 4, '+79839929050', 'анна.снегирева@yandex.ru', '2002-12-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 6, 'Ковалев', 'Игорь', 'Станиславович', 4, '+79556062648', 'игорь.ковалев@gmail.com', '2003-10-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 6, 'Третьякова', 'Ольга', 'Сергеевна', 4, '+79208899649', 'ольга.третьякова@example.com', '2001-06-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 6, 'Касаткин', 'Дмитрий', 'Александрович', 4, '+79935296557', 'дмитрий.касаткин@yandex.ru', '2005-01-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 6, 'Лебедев', 'Анатолий', 'Михайлович', 4, '+79234949369', 'анатолий.лебедев@yandex.ru', '2003-12-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 6, 'Мальцева', 'Светлана', 'Станиславовна', 4, '+79843370308', 'светлана.мальцева@gmail.com', '1999-02-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 6, 'Королева', 'Тамара', 'Григорьевна', 4, '+79643940977', 'тамара.королева@yandex.ru', '2000-04-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 7, 'Иванова', 'Кристина', 'Сергеевна', 1, '+79308521261', 'кристина.иванова@yandex.ru', '2005-12-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 7, 'Ким', 'Анна', 'Дмитриевна', 1, '+79149086496', 'анна.ким@yandex.ru', '2002-08-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 7, 'Петрова', 'Елена', 'Станиславовна', 1, '+79799674744', 'елена.петрова@mail.ru', '2004-12-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 7, 'Федосова', 'Людмила', 'Викторовна', 1, '+79957957977', 'людмила.федосова@gmail.com', '2005-08-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 7, 'Сидорова', 'Ксения', 'Валентиновна', 1, '+79348771290', 'ксения.сидорова@example.com', '2005-05-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 7, 'Григорьева', 'Татьяна', 'Николаевна', 1, '+79939353227', 'татьяна.григорьева@mail.ru', '1999-11-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 7, 'Тихонов', 'Анатолий', 'Геннадиевич', 1, '+79907599959', 'анатолий.тихонов@gmail.com', '2004-01-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 7, 'Лебедев', 'Виктор', 'Станиславович', 1, '+79756211485', 'виктор.лебедев@yandex.ru', '2002-09-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 7, 'Панова', 'Наталья', 'Станиславовна', 1, '+79096961747', 'наталья.панова@example.com', '2002-05-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 7, 'Рябова', 'Евгения', 'Александровна', 1, '+79876794045', 'евгения.рябова@gmail.com', '2000-12-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 7, 'Михайлов', 'Денис', 'Владимирович', 2, '+79304814846', 'денис.михайлов@gmail.com', '2005-11-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 7, 'Зайцева', 'Тамара', 'Игоревна', 2, '+79896746247', 'тамара.зайцева@mail.ru', '2000-04-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 7, 'Смирнов', 'Анатолий', 'Дмитриевич', 2, '+79663769203', 'анатолий.смирнов@yandex.ru', '2001-07-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 7, 'Романов', 'Станислав', 'Дмитриевич', 2, '+79836543666', 'станислав.романов@example.com', '2001-06-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 7, 'Косарев', 'Сергей', 'Петрович', 2, '+79615696879', 'сергей.косарев@gmail.com', '2002-11-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 7, 'Евдокимов', 'Александр', 'Анатольевич', 2, '+79133250407', 'александр.евдокимов@mail.ru', '2005-06-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 7, 'Шаповалов', 'Виктор', 'Михайлович', 2, '+79094711386', 'виктор.шаповалов@yandex.ru', '2000-06-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 7, 'Третьяков', 'Роман', 'Денисович', 2, '+79114148984', 'роман.третьяков@example.com', '2003-04-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 7, 'Королева', 'Светлана', 'Александровна', 2, '+79259537869', 'светлана.королева@example.com', '1999-07-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 7, 'Тихомирова', 'Ксения', 'Павловна', 2, '+79313977263', 'ксения.тихомирова@mail.ru', '2004-10-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 8, 'Кузнецова', 'Марина', 'Денисовна', 3, '+79656622549', 'марина.кузнецова@mail.ru', '1999-05-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 8, 'Тихомирова', 'Ксения', 'Дмитриевна', 3, '+79775044115', 'ксения.тихомирова@gmail.com', '2004-05-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 8, 'Шевченко', 'Ирина', 'Вячеславовна', 3, '+79909808731', 'ирина.шевченко@gmail.com', '2002-12-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 8, 'Гуляев', 'Сергей', 'Александрович', 3, '+79787144342', 'сергей.гуляев@yandex.ru', '2005-12-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 8, 'Королева', 'Юлия', 'Станиславовна', 3, '+79579784495', 'юлия.королева@mail.ru', '2005-02-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 8, 'Лебедева', 'Елена', 'Николаевна', 3, '+79585476684', 'елена.лебедева@mail.ru', '2005-11-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 8, 'Тихонов', 'Роман', 'Алексеевич', 3, '+79053528537', 'роман.тихонов@example.com', '2001-04-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 8, 'Герасимова', 'Людмила', 'Сергеевна', 3, '+79265123141', 'людмила.герасимова@gmail.com', '2003-01-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 8, 'Киселева', 'Евгения', 'Игоревна', 3, '+79434096542', 'евгения.киселева@example.com', '2004-01-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 8, 'Доронина', 'Татьяна', 'Александровна', 3, '+79163648653', 'татьяна.доронина@example.com', '2001-07-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 8, 'Соколов', 'Владимир', 'Иванович', 4, '+79674981506', 'владимир.соколов@yandex.ru', '2004-11-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 8, 'Коновалова', 'Анна', 'Сергеевна', 4, '+79653137746', 'анна.коновалова@example.com', '2000-03-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 8, 'Сидоренко', 'Анастасия', 'Дмитриевна', 4, '+79264824568', 'анастасия.сидоренко@example.com', '2000-07-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 8, 'Ефимова', 'Елена', 'Игоревна', 4, '+79498542552', 'елена.ефимова@mail.ru', '1999-08-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 8, 'Павлова', 'Наталья', 'Геннадиевна', 4, '+79863002731', 'наталья.павлова@mail.ru', '2001-05-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 8, 'Кривошапка', 'Илья', 'Дмитриевич', 4, '+79448276090', 'илья.кривошапка@gmail.com', '2004-03-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 8, 'Давыдов', 'Степан', 'Викторович', 4, '+79718489386', 'степан.давыдов@example.com', '2005-05-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 8, 'Глухов', 'Алексей', 'Станиславович', 4, '+79196726527', 'алексей.глухов@example.com', '2000-08-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 8, 'Михайлова', 'Анна', 'Сергеевна', 4, '+79111645546', 'анна.михайлова@gmail.com', '2000-06-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 8, 'Сафонова', 'Ольга', 'Викторовна', 4, '+79072135602', 'ольга.сафонова@mail.ru', '2003-09-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 9, 'Кузнецов', 'Станислав', 'Александрович', 3, '+79803065394', 'станислав.кузнецов@gmail.com', '2005-12-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 9, 'Тихомирова', 'Елена', 'Станиславовна', 3, '+79567132371', 'елена.тихомирова@example.com', '2001-03-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 9, 'Шевченко', 'Григорий', 'Петрович', 3, '+79991497351', 'григорий.шевченко@yandex.ru', '1999-04-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 9, 'Гуляев', 'Сергей', 'Александрович', 3, '+79473381452', 'сергей.гуляев@mail.ru', '2005-10-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 9, 'Королева', 'Юлия', 'Станиславовна', 3, '+79209803677', 'юлия.королева@gmail.com', '2002-05-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 9, 'Лебедева', 'Наталья', 'Николаевна', 3, '+79213547084', 'наталья.лебедева@mail.ru', '1999-01-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 9, 'Тихонов', 'Роман', 'Алексеевич', 3, '+79174010146', 'роман.тихонов@example.com', '1999-10-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 9, 'Герасимова', 'Людмила', 'Сергеевна', 3, '+79079585730', 'людмила.герасимова@mail.ru', '2002-08-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 9, 'Киселева', 'Евгения', 'Игоревна', 3, '+79074158587', 'евгения.киселева@example.com', '2000-07-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 9, 'Доронина', 'Татьяна', 'Александровна', 3, '+79294584327', 'татьяна.доронина@example.com', '1999-02-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 9, 'Соколов', 'Владимир', 'Иванович', 4, '+79575167318', 'владимир.соколов@gmail.com', '2001-12-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 9, 'Коновалова', 'Анна', 'Сергеевна', 4, '+79602263613', 'анна.коновалова@gmail.com', '2000-03-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 9, 'Сидоренко', 'Анастасия', 'Дмитриевна', 4, '+79349846147', 'анастасия.сидоренко@gmail.com', '2003-08-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 9, 'Ефимова', 'Елена', 'Игоревна', 4, '+79487326672', 'елена.ефимова@yandex.ru', '2001-11-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 9, 'Павлова', 'Наталья', 'Геннадиевна', 4, '+79543048730', 'наталья.павлова@yandex.ru', '2000-06-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 9, 'Кривошапка', 'Илья', 'Дмитриевич', 4, '+79936975008', 'илья.кривошапка@yandex.ru', '2005-12-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 9, 'Давыдов', 'Степан', 'Викторович', 4, '+79053624088', 'степан.давыдов@gmail.com', '2003-12-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (6, 9, 'Глухов', 'Алексей', 'Станиславович', 4, '+79675804628', 'алексей.глухов@gmail.com', '2003-08-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (5, 9, 'Михайлова', 'Анна', 'Сергеевна', 4, '+79606139195', 'анна.михайлова@gmail.com', '2003-04-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (4, 9, 'Сафонова', 'Ольга', 'Викторовна', 4, '+79445833595', 'ольга.сафонова@mail.ru', '2005-10-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 10, 'Павлов', 'Александр', 'Сергеевич', 3, '+79227512216', 'александр.павлов@yandex.ru', '2003-04-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 10, 'Доронина', 'Марина', 'Игоревна', 3, '+79573902562', 'марина.доронина@example.com', '2000-03-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 10, 'Анисимов', 'Артем', 'Владимирович', 3, '+79004429794', 'артем.анисимов@mail.ru', '2004-03-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 10, 'Левина', 'Светлана', 'Дмитриевна', 3, '+79374778489', 'светлана.левина@yandex.ru', '2002-01-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 10, 'Миронов', 'Олег', 'Николаевич', 3, '+79476558892', 'олег.миронов@yandex.ru', '2000-02-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 10, 'Николаев', 'Дмитрий', 'Геннадиевич', 3, '+79274698463', 'дмитрий.николаев@gmail.com', '2002-07-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 10, 'Семенова', 'Анна', 'Александровна', 3, '+79298545518', 'анна.семенова@example.com', '2000-10-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 10, 'Фомин', 'Иван', 'Анатольевич', 3, '+79984620452', 'иван.фомин@gmail.com', '2005-03-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 10, 'Тимофеева', 'Елизавета', 'Станиславовна', 3, '+79236111451', 'елизавета.тимофеева@mail.ru', '2001-11-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 10, 'Евдокимова', 'Анастасия', 'Сергеевна', 4, '+79224947746', 'анастасия.евдокимова@example.com', '2005-02-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 10, 'Ковалев', 'Григорий', 'Станиславович', 4, '+79619287379', 'григорий.ковалев@example.com', '2005-08-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 10, 'Глушкова', 'Татьяна', 'Ивановна', 4, '+79655300796', 'татьяна.глушкова@example.com', '2000-12-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 10, 'Костина', 'Светлана', 'Анатольевна', 4, '+79753300680', 'светлана.костина@yandex.ru', '1999-07-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 10, 'Рыбаков', 'Станислав', 'Владимирович', 4, '+79288678228', 'станислав.рыбаков@mail.ru', '1999-07-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 10, 'Курилова', 'Светлана', 'Викторовна', 4, '+79079926865', 'светлана.курилова@gmail.com', '2000-09-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 10, 'Боровиков', 'Сергей', 'Дмитриевич', 4, '+79114151190', 'сергей.боровиков@yandex.ru', '1999-04-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 10, 'Миронова', 'Анна', 'Владимировна', 4, '+79034381376', 'анна.миронова@gmail.com', '2005-03-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 10, 'Костюков', 'Алексей', 'Иванович', 4, '+79692639526', 'алексей.костюков@yandex.ru', '2004-06-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 10, 'Сосновский', 'Кирилл', 'Станиславович', 4, '+79386176657', 'кирилл.сосновский@mail.ru', '2005-07-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 11, 'Соболева', 'Наталья', 'Ивановна', 1, '+79557651949', 'наталья.соболева@gmail.com', '2001-09-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 11, 'Васильева', 'Лариса', 'Сергеевна', 1, '+79105564426', 'лариса.васильева@mail.ru', '2004-12-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 11, 'Гребенщиков', 'Станислав', 'Дмитриевич', 1, '+79369515428', 'станислав.гребенщиков@mail.ru', '2004-09-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 11, 'Харитонов', 'Евгений', 'Станиславович', 1, '+79325539068', 'евгений.харитонов@yandex.ru', '2000-01-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 11, 'Федотов', 'Дмитрий', 'Сергеевич', 1, '+79233427215', 'дмитрий.федотов@yandex.ru', '2004-05-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 11, 'Степанова', 'Ольга', 'Николаевна', 1, '+79888954072', 'ольга.степанова@yandex.ru', '2005-11-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 11, 'Ширяев', 'Кирилл', 'Викторович', 1, '+79341422761', 'кирилл.ширяев@yandex.ru', '2003-05-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 11, 'Морозова', 'Нина', 'Анатольевна', 1, '+79687872757', 'нина.морозова@mail.ru', '2003-07-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 11, 'Лобанов', 'Григорий', 'Станиславович', 1, '+79568617824', 'григорий.лобанов@yandex.ru', '2002-12-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 11, 'Соломатина', 'Елена', 'Игоревна', 2, '+79346007620', 'елена.соломатина@yandex.ru', '1999-04-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 11, 'Воробьева', 'Светлана', 'Анатольевна', 2, '+79838636985', 'светлана.воробьева@gmail.com', '2002-08-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 11, 'Григорьева', 'Анна', 'Николаевна', 2, '+79623070224', 'анна.григорьева@yandex.ru', '1999-09-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 11, 'Исаев', 'Роман', 'Станиславович', 2, '+79387584838', 'роман.исаев@mail.ru', '2000-04-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 11, 'Симонов', 'Павел', 'Александрович', 2, '+79188307435', 'павел.симонов@gmail.com', '2005-04-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 11, 'Васильев', 'Станислав', 'Геннадиевич', 2, '+79584971548', 'станислав.васильев@yandex.ru', '1999-04-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 11, 'Волкова', 'Ирина', 'Станиславовна', 2, '+79343050193', 'ирина.волкова@example.com', '2004-12-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 11, 'Калинин', 'Дмитрий', 'Иванович', 2, '+79204299730', 'дмитрий.калинин@mail.ru', '2004-10-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 11, 'Баранов', 'Олег', 'Сергеевич', 2, '+79597780963', 'олег.баранов@gmail.com', '2001-02-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 11, 'Долгова', 'Татьяна', 'Петровна', 2, '+79725994588', 'татьяна.долгова@yandex.ru', '2000-05-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 12, 'Никифоров', 'Андрей', 'Станиславович', 3, '+79146762820', 'андрей.никифоров@mail.ru', '1999-05-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 12, 'Левин', 'Константин', 'Дмитриевич', 3, '+79682185546', 'константин.левин@example.com', '2002-07-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 12, 'Анисимов', 'Роман', 'Игоревич', 3, '+79152029689', 'роман.анисимов@mail.ru', '2001-10-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 12, 'Семенов', 'Александр', 'Александрович', 3, '+79057061631', 'александр.семенов@gmail.com', '2005-04-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 12, 'Сидорова', 'Татьяна', 'Сергеевна', 3, '+79244992434', 'татьяна.сидорова@gmail.com', '2001-09-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 12, 'Ковалева', 'Анастасия', 'Дмитриевна', 3, '+79053078302', 'анастасия.ковалева@mail.ru', '2001-03-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 12, 'Баранов', 'Дмитрий', 'Александрович', 3, '+79745863264', 'дмитрий.баранов@mail.ru', '2002-12-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 12, 'Григорьев', 'Максим', 'Станиславович', 3, '+79035948850', 'максим.григорьев@example.com', '2001-02-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 12, 'Лебедев', 'Станислав', 'Петрович', 4, '+79124745579', 'станислав.лебедев@mail.ru', '2003-02-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 12, 'Федорова', 'Ольга', 'Николаевна', 4, '+79322937927', 'ольга.федорова@gmail.com', '2004-10-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 12, 'Гордеева', 'Елена', 'Анатольевна', 4, '+79796353486', 'елена.гордеева@gmail.com', '1999-12-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 12, 'Долгушев', 'Александр', 'Геннадиевич', 4, '+79354547131', 'александр.долгушев@mail.ru', '2005-01-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 12, 'Гаврилов', 'Андрей', 'Александрович', 4, '+79421248866', 'андрей.гаврилов@example.com', '2004-12-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 12, 'Боровиков', 'Сергей', 'Дмитриевич', 4, '+79481262409', 'сергей.боровиков@yandex.ru', '2002-04-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 12, 'Кузнецова', 'Варвара', 'Станиславовна', 4, '+79443603193', 'варвара.кузнецова@yandex.ru', '2003-06-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 12, 'Костина', 'Светлана', 'Геннадиевна', 4, '+79519082326', 'светлана.костина@example.com', '2004-10-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 12, 'Савельева', 'Екатерина', 'Дмитриевна', 4, '+79535501512', 'екатерина.савельева@gmail.com', '1999-04-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 12, 'Зайцева', 'Ольга', 'Станиславовна', 4, '+79101272325', 'ольга.зайцева@example.com', '2003-07-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 13, 'Григорьева', 'Ирина', 'Анатольевна', 3, '+79177799188', 'ирина.григорьева@gmail.com', '2003-10-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 13, 'Павлов', 'Валентин', 'Дмитриевич', 3, '+79206350945', 'валентин.павлов@mail.ru', '2004-05-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 13, 'Сидорова', 'Екатерина', 'Станиславовна', 3, '+79059017581', 'екатерина.сидорова@yandex.ru', '2003-10-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 13, 'Кузнецова', 'Валерия', 'Дмитриевна', 3, '+79302686317', 'валерия.кузнецова@yandex.ru', '2004-07-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 13, 'Анисимов', 'Виктор', 'Игоревич', 3, '+79739792916', 'виктор.анисимов@yandex.ru', '1999-12-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 13, 'Светов', 'Анатолий', 'Дмитриевич', 3, '+79894306069', 'анатолий.светов@gmail.com', '2000-10-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 13, 'Гусев', 'Кирилл', 'Сергеевич', 3, '+79815049414', 'кирилл.гусев@mail.ru', '2000-10-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 13, 'Морозова', 'Надежда', 'Алексеевна', 3, '+79784761421', 'надежда.морозова@gmail.com', '1999-11-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 13, 'Федотов', 'Дмитрий', 'Станиславович', 4, '+79312191249', 'дмитрий.федотов@mail.ru', '2000-07-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 13, 'Ларина', 'Светлана', 'Викторовна', 4, '+79468238901', 'светлана.ларина@example.com', '2004-05-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 13, 'Мартынов', 'Степан', 'Александрович', 4, '+79912295310', 'степан.мартынов@example.com', '2003-06-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 13, 'Шарапов', 'Александр', 'Викторович', 4, '+79707470485', 'александр.шарапов@mail.ru', '2003-11-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 13, 'Калашников', 'Владимир', 'Александрович', 4, '+79516280593', 'владимир.калашников@mail.ru', '2001-09-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 13, 'Трофимова', 'Елена', 'Дмитриевна', 4, '+79916022897', 'елена.трофимова@yandex.ru', '2003-04-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 13, 'Шаров', 'Сергей', 'Геннадиевич', 4, '+79447353704', 'сергей.шаров@mail.ru', '2005-07-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 13, 'Васильев', 'Роман', 'Петрович', 4, '+79628462880', 'роман.васильев@mail.ru', '2001-05-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 13, 'Зайцева', 'Мария', 'Станиславовна', 4, '+79227484371', 'мария.зайцева@mail.ru', '1999-02-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (9, 13, 'Левин', 'Александр', 'Анатольевич', 4, '+79685972970', 'александр.левин@yandex.ru', '2002-12-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 14, 'Смирнов', 'Алексей', 'Дмитриевич', 1, '+79401925347', 'алексей.смирнов@mail.ru', '2000-03-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 14, 'Иванова', 'Елена', 'Александровна', 1, '+79759327614', 'елена.иванова@yandex.ru', '2001-10-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 14, 'Федоров', 'Станислав', 'Александрович', 1, '+79886153315', 'станислав.федоров@gmail.com', '2001-02-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 14, 'Морозов', 'Дмитрий', 'Сергеевич', 1, '+79197933874', 'дмитрий.морозов@gmail.com', '1999-06-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 14, 'Кириллова', 'Ольга', 'Александровна', 1, '+79642877622', 'ольга.кириллова@example.com', '2002-07-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 14, 'Петров', 'Владислав', 'Анатольевич', 1, '+79581609370', 'владислав.петров@mail.ru', '2005-12-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 14, 'Кузнецов', 'Егор', 'Дмитриевич', 1, '+79006823814', 'егор.кузнецов@yandex.ru', '2003-02-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 14, 'Лавров', 'Григорий', 'Станиславович', 1, '+79655271357', 'григорий.лавров@example.com', '2005-10-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 14, 'Давыдов', 'Артем', 'Алексеевич', 1, '+79825818162', 'артем.давыдов@gmail.com', '1999-07-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 14, 'Сергеев', 'Илья', 'Николаевич', 2, '+79421083273', 'илья.сергеев@gmail.com', '2002-05-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 14, 'Фролова', 'Анастасия', 'Станиславовна', 2, '+79491441942', 'анастасия.фролова@gmail.com', '1999-03-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 14, 'Громова', 'Алена', 'Алексеевна', 2, '+79544076377', 'алена.громова@yandex.ru', '2005-08-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 14, 'Анисимова', 'Ксения', 'Анатольевна', 2, '+79327732285', 'ксения.анисимова@gmail.com', '2004-08-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 14, 'Морозов', 'Олег', 'Вячеславович', 2, '+79405657567', 'олег.морозов@gmail.com', '2004-03-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 14, 'Никитина', 'Марина', 'Сергеевна', 2, '+79339812365', 'марина.никитина@gmail.com', '2002-01-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 14, 'Терентьев', 'Александр', 'Николаевич', 2, '+79229437081', 'александр.терентьев@yandex.ru', '2001-11-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (7, 14, 'Ларин', 'Егор', 'Алексеевич', 2, '+79455738306', 'егор.ларин@gmail.com', '2005-06-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (8, 14, 'Долгова', 'Екатерина', 'Станиславовна', 2, '+79414314970', 'екатерина.долгова@yandex.ru', '2004-01-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 15, 'Давыдов', 'Анатолий', 'Станиславович', 3, '+79805902084', 'анатолий.давыдов@mail.ru', '2004-11-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 15, 'Морозов', 'Сергей', 'Алексеевич', 3, '+79119962866', 'сергей.морозов@yandex.ru', '1999-08-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 15, 'Ларина', 'Наталья', 'Игоревна', 3, '+79852969922', 'наталья.ларина@mail.ru', '1999-03-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 15, 'Зайцева', 'Екатерина', 'Александровна', 3, '+79292535085', 'екатерина.зайцева@example.com', '2002-12-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 15, 'Фролов', 'Дмитрий', 'Вячеславович', 3, '+79059168220', 'дмитрий.фролов@yandex.ru', '2002-11-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 15, 'Голуб', 'Ольга', 'Сергеевна', 3, '+79111543407', 'ольга.голуб@yandex.ru', '2005-12-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 15, 'Рябченко', 'Оксана', 'Николаевна', 3, '+79455755253', 'оксана.рябченко@mail.ru', '2003-08-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 15, 'Кравченко', 'Станислав', 'Игоревич', 3, '+79335676705', 'станислав.кравченко@yandex.ru', '2002-06-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 15, 'Тищенко', 'Алена', 'Александровна', 3, '+79335904186', 'алена.тищенко@gmail.com', '2004-12-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 15, 'Мельников', 'Максим', 'Игоревич', 3, '+79103404958', 'максим.мельников@gmail.com', '2001-10-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 15, 'Власенко', 'Егор', 'Сергеевич', 3, '+79133148265', 'егор.власенко@example.com', '2003-09-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 15, 'Семёнов', 'Екатерина', 'Денисовна', 3, '+79153959308', 'екатерина.семёнов@yandex.ru', '2005-06-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 15, 'Иванов', 'Павел', 'Дмитриевич', 4, '+79469857463', 'павел.иванов@mail.ru', '2005-09-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 15, 'Петрова', 'Татьяна', 'Игоревна', 4, '+79841759653', 'татьяна.петрова@gmail.com', '2002-07-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (12, 15, 'Маслов', 'Степан', 'Сергеевич', 4, '+79632357620', 'степан.маслов@gmail.com', '2001-05-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 15, 'Смирнова', 'Анна', 'Викторовна', 4, '+79058573061', 'анна.смирнова@gmail.com', '1999-08-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 15, 'Громов', 'Евгений', 'Александрович', 4, '+79432104251', 'евгений.громов@gmail.com', '2003-11-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (12, 15, 'Костюк', 'Денис', 'Александрович', 4, '+79651861179', 'денис.костюк@example.com', '2003-01-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 15, 'Богдан', 'Мария', 'Петровна', 4, '+79182182527', 'мария.богдан@gmail.com', '2001-08-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 15, 'Харченко', 'Алексей', 'Игоревич', 4, '+79867218992', 'алексей.харченко@mail.ru', '2001-12-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (12, 15, 'Романов', 'Николай', 'Алексеевич', 4, '+79199881262', 'николай.романов@example.com', '2002-04-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 15, 'Кучер', 'Мария', 'Сергеевна', 4, '+79989763897', 'мария.кучер@gmail.com', '2002-02-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 15, 'Савицкий', 'Иван', 'Викторович', 4, '+79927203558', 'иван.савицкий@yandex.ru', '2003-05-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 15, 'Ковалев', 'Анастасия', 'Николаевна', 4, '+79439387198', 'анастасия.ковалев@mail.ru', '2000-10-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 16, 'Панченко', 'Елена', 'Олеговна', 1, '+79472364186', 'елена.панченко@example.com', '2001-05-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 16, 'Захарченко', 'Тимур', 'Романович', 1, '+79509931205', 'тимур.захарченко@mail.ru', '2003-11-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (12, 16, 'Тимуров', 'Тамара', 'Сергеевна', 1, '+79894371390', 'тамара.тимуров@mail.ru', '2005-02-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 16, 'Гурьянов', 'Никита', 'Васильевич', 1, '+79198091173', 'никита.гурьянов@mail.ru', '2002-08-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 16, 'Симоненко', 'Станислав', 'Александрович', 1, '+79044285733', 'станислав.симоненко@yandex.ru', '2004-06-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (12, 16, 'Купцов', 'Роман', 'Алексеевич', 1, '+79542606483', 'роман.купцов@yandex.ru', '2005-07-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 16, 'Гуляева', 'Виктория', 'Дмитриевна', 1, '+79438822407', 'виктория.гуляева@gmail.com', '2001-05-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 16, 'Ситникова', 'Светлана', 'Игоревна', 1, '+79558664950', 'светлана.ситникова@example.com', '2002-03-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 16, 'Рашидова', 'Гульнара', 'Игоревна', 1, '+79381538681', 'гульнара.рашидова@yandex.ru', '2001-04-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 16, 'Лебедев', 'Сергей', 'Петрович', 1, '+79582044148', 'сергей.лебедев@yandex.ru', '1999-03-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 16, 'Терентьев', 'Евгений', 'Алексеевич', 2, '+79622421031', 'евгений.терентьев@example.com', '2000-09-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 16, 'Соболев', 'Николай', 'Иванович', 2, '+79184365016', 'николай.соболев@example.com', '2001-06-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (12, 16, 'Кулагин', 'Леонид', 'Геннадиевич', 2, '+79875857146', 'леонид.кулагин@yandex.ru', '2003-02-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 16, 'Агафонов', 'Роман', 'Олегович', 2, '+79939455467', 'роман.агафонов@gmail.com', '2004-07-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 16, 'Шевченко', 'Ольга', 'Сергеевна', 2, '+79502146246', 'ольга.шевченко@gmail.com', '2002-07-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (12, 16, 'Никитин', 'Анатолий', 'Алексеевич', 2, '+79412212593', 'анатолий.никитин@gmail.com', '2002-11-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 16, 'Кириллов', 'Даниил', 'Петрович', 2, '+79905005988', 'даниил.кириллов@yandex.ru', '2005-04-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 16, 'Соколов', 'Григорий', 'Викторович', 2, '+79948245392', 'григорий.соколов@mail.ru', '2001-11-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 17, 'Петров', 'Павел', 'Денисович', 3, '+79685519032', 'павел.петров@mail.ru', '2000-04-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 17, 'Семенова', 'Евгения', 'Дмитриевна', 3, '+79671837639', 'евгения.семенова@mail.ru', '2003-07-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 17, 'Рыков', 'Алексей', 'Вячеславович', 3, '+79962760588', 'алексей.рыков@gmail.com', '2002-12-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 17, 'Василенко', 'Анна', 'Николаевна', 3, '+79031557260', 'анна.василенко@gmail.com', '2001-12-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (12, 17, 'Левченко', 'Марина', 'Станиславовна', 3, '+79353719703', 'марина.левченко@mail.ru', '2002-09-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 17, 'Головко', 'Александр', 'Валерьевич', 3, '+79188367451', 'александр.головко@example.com', '2002-01-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 17, 'Лебедев', 'Игорь', 'Станиславович', 3, '+79977261816', 'игорь.лебедев@mail.ru', '2001-12-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (12, 17, 'Ковалев', 'Светлана', 'Анатольевна', 3, '+79594973893', 'светлана.ковалев@gmail.com', '2002-06-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 17, 'Коваленко', 'Денис', 'Александрович', 3, '+79447438680', 'денис.коваленко@gmail.com', '2000-02-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 17, 'Ширяев', 'Роман', 'Игоревич', 3, '+79888293262', 'роман.ширяев@yandex.ru', '2000-09-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 17, 'Кочетов', 'Валерий', 'Станиславович', 4, '+79728923853', 'валерий.кочетов@example.com', '2000-09-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 17, 'Савельева', 'Елена', 'Дмитриевна', 4, '+79226144660', 'елена.савельева@mail.ru', '2002-08-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (12, 17, 'Федорова', 'Ирина', 'Николаевна', 4, '+79115067352', 'ирина.федорова@example.com', '2005-05-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 17, 'Фролов', 'Евгений', 'Игоревич', 4, '+79226519404', 'евгений.фролов@mail.ru', '2003-08-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 17, 'Тимошенко', 'Анастасия', 'Валерьевна', 4, '+79041915977', 'анастасия.тимошенко@example.com', '1999-04-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (12, 17, 'Борисов', 'Станислав', 'Дмитриевич', 4, '+79654285800', 'станислав.борисов@example.com', '2000-09-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (10, 17, 'Глухов', 'Дмитрий', 'Александрович', 4, '+79535998022', 'дмитрий.глухов@yandex.ru', '2005-03-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (11, 17, 'Алексеева', 'Наталья', 'Сергеевна', 4, '+79934048535', 'наталья.алексеева@example.com', '2004-05-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 18, 'Джабраилов', 'Тагир', 'Валерьевич', 3, '+79638153531', 'тагир.джабраилов@example.com', '1999-07-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 18, 'Магомедов', 'Али', 'Альбертович', 3, '+79579268969', 'али.магомедов@gmail.com', '2001-01-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 18, 'Султанов', 'Данияр', 'Николаевич', 3, '+79084324372', 'данияр.султанов@gmail.com', '1999-11-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 18, 'Хакимов', 'Рамазан', 'Сергиевич', 3, '+79902783671', 'рамазан.хакимов@mail.ru', '2004-08-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 18, 'Салехов', 'Лев', 'Денисович', 3, '+79041832855', 'лев.салехов@mail.ru', '2005-11-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 18, 'Гаджиев', 'Муса', 'Давидович', 3, '+79389585206', 'муса.гаджиев@mail.ru', '2003-02-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 18, 'Касумов', 'Азамат', 'Русланович', 3, '+79742544234', 'азамат.касумов@mail.ru', '2003-03-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 18, 'Пшеница', 'Евгений', 'Олегович', 3, '+79212415200', 'евгений.пшеница@gmail.com', '2000-01-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 18, 'Поляков', 'Антон', 'Валерьевич', 3, '+79211869634', 'антон.поляков@yandex.ru', '1999-03-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 18, 'Семёнов', 'Данила', 'Николаевич', 3, '+79443149391', 'данила.семёнов@mail.ru', '2001-11-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 18, 'Туркмен', 'Илья', 'Владиславович', 3, '+79859738633', 'илья.туркмен@example.com', '1999-09-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 18, 'Князев', 'Степан', 'Вячеславович', 3, '+79978888081', 'степан.князев@mail.ru', '1999-11-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 18, 'Гарунов', 'Тимур', 'Станиславович', 3, '+79733151685', 'тимур.гарунов@yandex.ru', '2003-03-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 18, 'Каракулов', 'Игорь', 'Денисович', 3, '+79511055611', 'игорь.каракулов@gmail.com', '2003-10-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 18, 'Гатауллин', 'Эльдар', 'Дмитриевич', 3, '+79651340866', 'эльдар.гатауллин@example.com', '2002-09-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 18, 'Мирзабеков', 'Умид', 'Шерзодович', 3, '+79574090997', 'умид.мирзабеков@gmail.com', '2003-04-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 18, 'Нагимов', 'Гаджи', 'Борисович', 4, '+79138591364', 'гаджи.нагимов@yandex.ru', '1999-11-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 18, 'Латыпов', 'Дмитрий', 'Сергеевич', 4, '+79124009657', 'дмитрий.латыпов@gmail.com', '1999-04-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 18, 'Песков', 'Станислав', 'Евгеньевич', 4, '+79318877877', 'станислав.песков@yandex.ru', '2005-11-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 18, 'Кобулов', 'Нуридин', 'Михайлович', 4, '+79678866831', 'нуридин.кобулов@yandex.ru', '1999-08-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 18, 'Мунаев', 'Мидхат', 'Набирович', 4, '+79919953161', 'мидхат.мунаев@yandex.ru', '2003-09-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 18, 'Шевченко', 'Светлана', 'Васильевна', 4, '+79891347294', 'светлана.шевченко@gmail.com', '2001-02-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 18, 'Сагарбеков', 'Асылбек', 'Оразбаевич', 4, '+79708082577', 'асылбек.сагарбеков@example.com', '2004-01-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 18, 'Рахманов', 'Рустам', 'Салатович', 4, '+79321400779', 'рустам.рахманов@yandex.ru', '1999-02-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 18, 'Умиров', 'Алишер', 'Гаджиевич', 4, '+79608310924', 'алишер.умиров@gmail.com', '2000-12-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 18, 'Лебедев', 'Олег', 'Иванович', 4, '+79308311671', 'олег.лебедев@mail.ru', '1999-05-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 18, 'Караев', 'Марат', 'Сергеевич', 4, '+79267761477', 'марат.караев@gmail.com', '2003-11-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 18, 'Шарипов', 'Дамир', 'Камильевич', 4, '+79543701316', 'дамир.шарипов@gmail.com', '2000-11-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 18, 'Татевосов', 'Андрей', 'Юрьевич', 4, '+79705495059', 'андрей.татевосов@gmail.com', '2000-04-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 18, 'Черкесов', 'Егор', 'Станиславович', 4, '+79064821346', 'егор.черкесов@mail.ru', '2005-12-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 18, 'Трещёв', 'Анатолий', 'Владимирович', 4, '+79809257992', 'анатолий.трещёв@mail.ru', '2004-04-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 19, 'Петров', 'Станислав', 'Петрович', 3, '+79587189738', 'станислав.петров@yandex.ru', '2004-05-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 19, 'Титов', 'Игорь', 'Владимирович', 3, '+79289281730', 'игорь.титов@example.com', '2003-01-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 19, 'Дмитриев', 'Алексей', 'Юрьевич', 3, '+79699381402', 'алексей.дмитриев@yandex.ru', '2004-11-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 19, 'Смирнов', 'Иван', 'Денисович', 3, '+79892640104', 'иван.смирнов@yandex.ru', '2001-11-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 19, 'Панов', 'Анатолий', 'Дмитриевич', 3, '+79537358672', 'анатолий.панов@yandex.ru', '2002-01-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 19, 'Баранов', 'Игорь', 'Валерьевич', 3, '+79999317544', 'игорь.баранов@yandex.ru', '1999-11-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 19, 'Сидоров', 'Максим', 'Алексеевич', 3, '+79853611800', 'максим.сидоров@example.com', '2003-01-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 19, 'Федоров', 'Андрей', 'Станиславович', 3, '+79239458257', 'андрей.федоров@gmail.com', '2003-01-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 19, 'Сергеев', 'Дмитрий', 'Станиславович', 3, '+79619743081', 'дмитрий.сергеев@gmail.com', '2001-07-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 19, 'Сычёв', 'Григорий', 'Денисович', 3, '+79573538536', 'григорий.сычёв@example.com', '2003-08-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 19, 'Нестеров', 'Александр', 'Владимирович', 3, '+79596851761', 'александр.нестеров@mail.ru', '2005-04-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 19, 'Лебедев', 'Станислав', 'Олегович', 3, '+79699181164', 'станислав.лебедев@mail.ru', '2003-08-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 19, 'Сорокин', 'Тимофей', 'Андреевич', 3, '+79564086334', 'тимофей.сорокин@example.com', '2005-08-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 19, 'Андреев', 'Даниил', 'Валерьевич', 3, '+79154892374', 'даниил.андреев@yandex.ru', '2004-05-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 19, 'Крылов', 'Денис', 'Сергеевич', 3, '+79426805396', 'денис.крылов@yandex.ru', '2003-08-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 19, 'Григорьев', 'Илья', 'Николаевич', 3, '+79022544996', 'илья.григорьев@example.com', '2005-07-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 19, 'Голубев', 'Алексей', 'Владимирович', 4, '+79278273075', 'алексей.голубев@yandex.ru', '2003-05-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 19, 'Громов', 'Илья', 'Юрьевич', 4, '+79008644298', 'илья.громов@yandex.ru', '2005-03-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 19, 'Токарев', 'Станислав', 'Петрович', 4, '+79525533041', 'станислав.токарев@mail.ru', '2003-10-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 19, 'Хлебников', 'Виктор', 'Анатольевич', 4, '+79325627452', 'виктор.хлебников@example.com', '2001-03-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 19, 'Медведев', 'Евгений', 'Дмитриевич', 4, '+79372900835', 'евгений.медведев@yandex.ru', '2005-01-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 19, 'Сергеев', 'Василий', 'Петрович', 4, '+79761807972', 'василий.сергеев@yandex.ru', '2000-01-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 19, 'Пушкин', 'Семен', 'Станиславович', 4, '+79984987101', 'семен.пушкин@example.com', '2003-02-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 19, 'Тимофеев', 'Дмитрий', 'Алексеевич', 4, '+79218542637', 'дмитрий.тимофеев@gmail.com', '2001-09-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 19, 'Евдокимов', 'Анатолий', 'Валерьевич', 4, '+79706742667', 'анатолий.евдокимов@yandex.ru', '2004-11-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 19, 'Соколов', 'Александр', 'Анатольевич', 4, '+79461594542', 'александр.соколов@yandex.ru', '2002-06-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 19, 'Кузнецов', 'Виктор', 'Петрович', 4, '+79142494368', 'виктор.кузнецов@example.com', '1999-05-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 19, 'Станкевич', 'Станислав', 'Алексеевич', 4, '+79203986281', 'станислав.станкевич@gmail.com', '2003-01-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 19, 'Шевченко', 'Дмитрий', 'Юрьевич', 4, '+79586757812', 'дмитрий.шевченко@example.com', '2003-12-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 19, 'Аверин', 'Никита', 'Дмитриевич', 4, '+79324740529', 'никита.аверин@gmail.com', '2005-01-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 19, 'Смирнов', 'Егор', 'Алексеевич', 4, '+79906213957', 'егор.смирнов@gmail.com', '2003-10-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 19, 'Зайцев', 'Владимир', 'Алексеевич', 4, '+79459078882', 'владимир.зайцев@mail.ru', '2004-10-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 20, 'Сунь', 'Ли', 'Цзинь', 1, '+79089459229', 'ли.сунь@mail.ru', '2005-12-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 20, 'Ли', 'Гао', 'Чжун', 1, '+79323662043', 'гао.ли@example.com', '2004-08-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 20, 'Ху', 'Ван', 'Цзюнь', 1, '+79349512381', 'ван.ху@gmail.com', '2002-11-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 20, 'Чжан', 'Сяо', 'Ли', 1, '+79001877004', 'сяо.чжан@example.com', '2001-04-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 20, 'Линь', 'Чжун', 'Синь', 1, '+79458413779', 'чжун.линь@yandex.ru', '2001-05-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 20, 'Цинь', 'Ли', 'Го', 1, '+79194995341', 'ли.цинь@mail.ru', '2002-02-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 20, 'Кан', 'Чжун', 'Чжун', 1, '+79105394554', 'чжун.кан@gmail.com', '2000-11-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 20, 'Сяо', 'Цзинь', 'Го', 1, '+79157872961', 'цзинь.сяо@mail.ru', '1999-09-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 20, 'Пан', 'Мэй', 'Фанг', 1, '+79067763796', 'мэй.пан@mail.ru', '2005-03-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 20, 'Ли', 'Чэнь', 'И', 1, '+79133180147', 'чэнь.ли@example.com', '2003-11-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 20, 'Цао', 'Ши', 'Чжун', 1, '+79268699796', 'ши.цао@example.com', '2002-05-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 20, 'Сяо', 'Ван', 'Чжэн', 1, '+79496206261', 'ван.сяо@example.com', '2005-04-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 20, 'Сун', 'Чжун', 'Ли', 1, '+79284879042', 'чжун.сун@mail.ru', '2000-12-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 20, 'Ли', 'Чжэнь', 'Фан', 1, '+79432515297', 'чжэнь.ли@mail.ru', '2003-01-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 20, 'Линь', 'Гао', 'Лун', 1, '+79851297208', 'гао.линь@example.com', '2005-05-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 20, 'Чжоу', 'Хай', 'Мэй', 1, '+79824909243', 'хай.чжоу@example.com', '2002-03-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 20, 'Гаджиев', 'Давид', 'Шерзодович', 2, '+79496975375', 'давид.гаджиев@gmail.com', '2002-01-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 20, 'Ахмедов', 'Аслан', 'Ильярович', 2, '+79009102259', 'аслан.ахмедов@yandex.ru', '2005-05-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 20, 'Магомедов', 'Эмиль', 'Элбрусевич', 2, '+79434702181', 'эмиль.магомедов@mail.ru', '2002-02-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 20, 'Ибрагимов', 'Тимур', 'Аскерович', 2, '+79282400402', 'тимур.ибрагимов@mail.ru', '2004-03-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 20, 'Гумаров', 'Станислав', 'Забирович', 2, '+79006978827', 'станислав.гумаров@mail.ru', '2005-03-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 20, 'Султанов', 'Магомед', 'Саидович', 2, '+79193219920', 'магомед.султанов@mail.ru', '2000-03-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 20, 'Гаджиев', 'Сослан', 'Шарикович', 2, '+79983229569', 'сослан.гаджиев@gmail.com', '2002-10-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 20, 'Сериков', 'Данияр', 'Альбертович', 2, '+79767343306', 'данияр.сериков@mail.ru', '2000-06-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 20, 'Курбанов', 'Салават', 'Тахирович', 2, '+79362009309', 'салават.курбанов@gmail.com', '2004-04-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 20, 'Шарипов', 'Алексей', 'Евгеньевич', 2, '+79181476910', 'алексей.шарипов@yandex.ru', '2000-03-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 20, 'Шевченко', 'Григорий', 'Романович', 2, '+79735647450', 'григорий.шевченко@mail.ru', '2002-01-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 20, 'Петров', 'Игорь', 'Викторович', 2, '+79186825652', 'игорь.петров@gmail.com', '2002-05-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 20, 'Соловьев', 'Иван', 'Валерьевич', 2, '+79952437854', 'иван.соловьев@yandex.ru', '2001-08-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (14, 20, 'Каракулов', 'Санжар', 'Алиевич', 2, '+79086945176', 'санжар.каракулов@example.com', '2004-06-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (15, 20, 'Пашков', 'Александр', 'Степанович', 2, '+79056509927', 'александр.пашков@example.com', '2005-08-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (13, 20, 'Сазонов', 'Дмитрий', 'Анатольевич', 2, '+79618288881', 'дмитрий.сазонов@yandex.ru', '2005-01-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 21, 'Тимофеева', 'Екатерина', 'Алексеевна', 3, '+79985228765', 'екатерина.тимофеева@yandex.ru', '2001-08-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 21, 'Семенов', 'Максим', 'Павлович', 3, '+79471067753', 'максим.семенов@mail.ru', '2003-06-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (18, 21, 'Кириллова', 'Ольга', 'Сергеевна', 3, '+79859908081', 'ольга.кириллова@yandex.ru', '2000-04-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 21, 'Лисичкин', 'Петр', 'Анатольевич', 3, '+79523131190', 'петр.лисичкин@mail.ru', '2000-01-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 21, 'Мельников', 'Игорь', 'Романович', 3, '+79111909047', 'игорь.мельников@gmail.com', '2005-06-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (18, 21, 'Волкова', 'Ксения', 'Станиславовна', 3, '+79397055780', 'ксения.волкова@gmail.com', '2002-05-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 21, 'Никитина', 'Вера', 'Степановна', 4, '+79155249236', 'вера.никитина@example.com', '2000-09-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 21, 'Фролов', 'Станислав', 'Викторович', 4, '+79869533726', 'станислав.фролов@gmail.com', '2002-10-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 21, 'Миронова', 'Галина', 'Юрьевна', 4, '+79432292374', 'галина.миронова@yandex.ru', '2002-11-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (18, 21, 'Исаев', 'Егор', 'Сергеевич', 4, '+79439114517', 'егор.исаев@mail.ru', '2001-05-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 21, 'Борисова', 'Маргарита', 'Олеговна', 4, '+79661485319', 'маргарита.борисова@yandex.ru', '2005-06-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 21, 'Семёнова', 'Татьяна', 'Анатольевна', 4, '+79798798447', 'татьяна.семёнова@mail.ru', '2003-06-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (18, 21, 'Тихонов', 'Денис', 'Михайлович', 4, '+79758771944', 'денис.тихонов@mail.ru', '2004-06-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 21, 'Васильева', 'Людмила', 'Сергеевна', 4, '+79366558852', 'людмила.васильева@example.com', '2000-04-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (18, 21, 'Шевченко', 'Андрей', 'Станиславович', 4, '+79732119120', 'андрей.шевченко@yandex.ru', '2004-02-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 21, 'Лапина', 'Виктория', 'Николаевна', 4, '+79678560356', 'виктория.лапина@example.com', '2001-07-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (18, 21, 'Горбунова', 'Анна', 'Дмитриевна', 4, '+79128824433', 'анна.горбунова@gmail.com', '2001-02-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 21, 'Федотов', 'Ярослав', 'Александрович', 4, '+79276052166', 'ярослав.федотов@yandex.ru', '1999-06-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (18, 21, 'Шестакова', 'Евдокия', 'Владимировна', 4, '+79708709025', 'евдокия.шестакова@yandex.ru', '2001-10-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 21, 'Дмитриев', 'Иван', 'Александрович', 4, '+79562988750', 'иван.дмитриев@mail.ru', '1999-06-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 21, 'Благовещенский', 'Илья', 'Юрьевич', 4, '+79678175721', 'илья.благовещенский@gmail.com', '1999-11-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 21, 'Гришина', 'Дарья', 'Павловна', 4, '+79949881701', 'дарья.гришина@yandex.ru', '2001-06-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (18, 21, 'Рябков', 'Максим', 'Викторович', 4, '+79516981888', 'максим.рябков@mail.ru', '2004-11-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 21, 'Смирнова', 'Светлана', 'Петровна', 4, '+79543686861', 'светлана.смирнова@mail.ru', '2000-03-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (18, 21, 'Тихомиров', 'Роман', 'Станиславович', 4, '+79096366678', 'роман.тихомиров@mail.ru', '2003-08-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (18, 21, 'Крючков', 'Никита', 'Сергеевич', 4, '+79553914292', 'никита.крючков@example.com', '1999-01-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 21, 'Григорьева', 'Екатерина', 'Валерьевна', 4, '+79817538071', 'екатерина.григорьева@example.com', '1999-01-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (18, 21, 'Фокин', 'Дмитрий', 'Григорьевич', 4, '+79504110531', 'дмитрий.фокин@gmail.com', '2001-03-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 21, 'Сизова', 'Алиса', 'Ивановна', 4, '+79477479476', 'алиса.сизова@mail.ru', '2001-12-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 22, 'Смирнов', 'Алексей', 'Игоревич', 1, '+79296391219', 'алексей.смирнов@example.com', '2004-05-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 22, 'Кузнецов', 'Дмитрий', 'Владимирович', 1, '+79948938893', 'дмитрий.кузнецов@example.com', '2004-10-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 22, 'Петров', 'Иван', 'Сергеевич', 1, '+79615477251', 'иван.петров@mail.ru', '2005-07-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 22, 'Лебедев', 'Виктор', 'Петрович', 1, '+79623876329', 'виктор.лебедев@gmail.com', '2000-03-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 22, 'Попов', 'Станислав', 'Дмитриевич', 1, '+79392279918', 'станислав.попов@example.com', '2002-04-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 22, 'Морозов', 'Андрей', 'Иванович', 1, '+79738337589', 'андрей.морозов@mail.ru', '2000-09-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 22, 'Васильев', 'Николай', 'Александрович', 1, '+79322353801', 'николай.васильев@example.com', '2003-10-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 22, 'Зайцев', 'Денис', 'Игоревич', 1, '+79593822975', 'денис.зайцев@example.com', '2000-05-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 22, 'Голубев', 'Роман', 'Анатольевич', 1, '+79266304123', 'роман.голубев@mail.ru', '1999-12-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 22, 'Тимофеев', 'Сергей', 'Алексеевич', 1, '+79605401450', 'сергей.тимофеев@yandex.ru', '2000-01-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 22, 'Карасева', 'Елена', 'Дмитриевна', 1, '+79767950583', 'елена.карасева@yandex.ru', '2005-11-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 22, 'Мельников', 'Станислав', 'Валерьевич', 1, '+79581051391', 'станислав.мельников@mail.ru', '2003-04-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 22, 'Алексеев', 'Никита', 'Юрьевич', 1, '+79289645422', 'никита.алексеев@gmail.com', '2003-07-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 22, 'Романов', 'Станислав', 'Александрович', 1, '+79966593122', 'станислав.романов@mail.ru', '2001-11-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 22, 'Худяков', 'Александр', 'Игоревич', 1, '+79309691028', 'александр.худяков@gmail.com', '2003-02-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 22, 'Иванов', 'Григорий', 'Романович', 1, '+79988762757', 'григорий.иванов@yandex.ru', '2000-09-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 22, 'Шевченко', 'Олег', 'Игоревич', 2, '+79497606456', 'олег.шевченко@example.com', '2002-01-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 22, 'Морозов', 'Виктор', 'Петрович', 2, '+79146689405', 'виктор.морозов@yandex.ru', '2005-05-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 22, 'Лукьянов', 'Андрей', 'Юрьевич', 2, '+79627026347', 'андрей.лукьянов@mail.ru', '2000-06-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 22, 'Соловьев', 'Алексей', 'Сергеевич', 2, '+79594560593', 'алексей.соловьев@example.com', '1999-09-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 22, 'Панкратов', 'Станислав', 'Дмитриевич', 2, '+79392153124', 'станислав.панкратов@gmail.com', '2001-11-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 22, 'Коваленко', 'Оксана', 'Анатольевна', 2, '+79346030847', 'оксана.коваленко@mail.ru', '2005-04-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 22, 'Баранов', 'Игорь', 'Александрович', 2, '+79807818869', 'игорь.баранов@yandex.ru', '2002-10-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 22, 'Козлов', 'Сергей', 'Александрович', 2, '+79884252394', 'сергей.козлов@mail.ru', '2000-12-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 22, 'Сидоров', 'Андрей', 'Дмитриевич', 2, '+79559790124', 'андрей.сидоров@example.com', '1999-07-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 22, 'Трошин', 'Роман', 'Викторович', 2, '+79797698740', 'роман.трошин@gmail.com', '1999-05-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 22, 'Гришин', 'Владимир', 'Сергеевич', 2, '+79481955887', 'владимир.гришин@example.com', '2002-04-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 22, 'Белов', 'Виктор', 'Романович', 2, '+79439493444', 'виктор.белов@gmail.com', '2004-02-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 23, 'Соколов', 'Анна', 'Александровна', 3, '+79273427964', 'анна.соколов@yandex.ru', '2003-09-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 23, 'Митрофанов', 'Владимир', 'Анатольевич', 3, '+79683164532', 'владимир.митрофанов@example.com', '2002-09-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 23, 'Лебедев', 'Анатолий', 'Игоревич', 3, '+79241801782', 'анатолий.лебедев@yandex.ru', '2002-09-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 23, 'Заречная', 'Виктория', 'Павловна', 3, '+79559939909', 'виктория.заречная@example.com', '2003-02-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 23, 'Мельников', 'Олег', 'Игоревич', 3, '+79998905129', 'олег.мельников@yandex.ru', '2001-02-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 23, 'Голубев', 'Петр', 'Станиславович', 3, '+79965673346', 'петр.голубев@example.com', '1999-07-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 23, 'Лазарев', 'Степан', 'Анатольевич', 3, '+79279425070', 'степан.лазарев@yandex.ru', '2003-08-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 23, 'Королев', 'Александр', 'Сергеевич', 3, '+79702515868', 'александр.королев@mail.ru', '2005-06-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 23, 'Чумаков', 'Алексей', 'Николаевич', 3, '+79618056353', 'алексей.чумаков@example.com', '2000-09-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 23, 'Кравцов', 'Игорь', 'Анатольевич', 3, '+79642236732', 'игорь.кравцов@yandex.ru', '2000-10-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 23, 'Копылов', 'Дмитрий', 'Анатольевич', 3, '+79988099355', 'дмитрий.копылов@gmail.com', '2002-10-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 23, 'Грибов', 'Станислав', 'Сергеевич', 3, '+79316813012', 'станислав.грибов@example.com', '2002-11-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 23, 'Кудрявцев', 'Павел', 'Станиславович', 3, '+79874291329', 'павел.кудрявцев@example.com', '1999-03-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 23, 'Молотов', 'Виктор', 'Игоревич', 3, '+79967655283', 'виктор.молотов@gmail.com', '2004-01-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 23, 'Полищук', 'Оксана', 'Вячеславовна', 4, '+79412658011', 'оксана.полищук@example.com', '2001-11-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 23, 'Хроменко', 'Игорь', 'Алексеевич', 4, '+79081289112', 'игорь.хроменко@yandex.ru', '2005-04-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 23, 'Савченко', 'Анастасия', 'Олеговна', 4, '+79513636666', 'анастасия.савченко@mail.ru', '1999-03-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 23, 'Сурков', 'Александр', 'Алексеевич', 4, '+79822181617', 'александр.сурков@mail.ru', '2001-11-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 23, 'Бондар', 'Николай', 'Петрович', 4, '+79786419924', 'николай.бондар@example.com', '2002-09-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 23, 'Ляшенко', 'Дмитрий', 'Геннадьевич', 4, '+79673829766', 'дмитрий.ляшенко@yandex.ru', '2000-06-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 23, 'Петренко', 'Анатолий', 'Викторович', 4, '+79142039258', 'анатолий.петренко@mail.ru', '2001-04-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 23, 'Филонов', 'Максим', 'Дмитриевич', 4, '+79913319577', 'максим.филонов@yandex.ru', '2004-11-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (18, 23, 'Басов', 'Кирилл', 'Олегович', 4, '+79051149363', 'кирилл.басов@yandex.ru', '2001-08-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 23, 'Костенко', 'Светлана', 'Дмитриевна', 4, '+79172923986', 'светлана.костенко@gmail.com', '2005-07-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 23, 'Бондаренко', 'Екатерина', 'Петровна', 4, '+79898137197', 'екатерина.бондаренко@example.com', '2003-07-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 23, 'Ласкин', 'Валерий', 'Станиславович', 4, '+79066447011', 'валерий.ласкин@mail.ru', '2002-11-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 23, 'Данилов', 'Сергей', 'Игоревич', 4, '+79945180072', 'сергей.данилов@mail.ru', '2002-06-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 23, 'Терещенко', 'Ирина', 'Станиславовна', 4, '+79195133676', 'ирина.терещенко@mail.ru', '1999-02-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 23, 'Ребров', 'Александр', 'Игоревич', 4, '+79325674450', 'александр.ребров@gmail.com', '2002-05-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 24, 'Бурков', 'Александр', 'Игоревич', 3, '+79212699545', 'александр.бурков@gmail.com', '2002-10-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 24, 'Савенко', 'Евгений', 'Викторович', 3, '+79481016923', 'евгений.савенко@gmail.com', '2003-10-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 24, 'Степанов', 'Денис', 'Владимирович', 3, '+79512915384', 'денис.степанов@example.com', '2002-09-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 24, 'Червоненко', 'Сергей', 'Станиславович', 3, '+79078588423', 'сергей.червоненко@mail.ru', '2000-02-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 24, 'Рубцов', 'Никита', 'Дмитриевич', 3, '+79678677024', 'никита.рубцов@example.com', '2000-03-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (18, 24, 'Лемешко', 'Павел', 'Владимирович', 3, '+79568069914', 'павел.лемешко@example.com', '2000-02-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 24, 'Гасанов', 'Олег', 'Станиславович', 3, '+79662080645', 'олег.гасанов@yandex.ru', '2005-11-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 24, 'Коваленко', 'Дмитрий', 'Сергеевич', 3, '+79431223673', 'дмитрий.коваленко@yandex.ru', '1999-06-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 24, 'Яровой', 'Виктор', 'Александрович', 3, '+79198009731', 'виктор.яровой@gmail.com', '2005-12-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 24, 'Семёнов', 'Станислав', 'Анатольевич', 3, '+79378033882', 'станислав.семёнов@yandex.ru', '2002-07-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 24, 'Бондаренко', 'Михаил', 'Игоревич', 3, '+79316125145', 'михаил.бондаренко@gmail.com', '2004-02-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 24, 'Головко', 'Татьяна', 'Олеговна', 3, '+79517477583', 'татьяна.головко@gmail.com', '2005-05-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 24, 'Шевченко', 'Оксана', 'Дмитриевна', 3, '+79099487564', 'оксана.шевченко@gmail.com', '2004-10-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 24, 'Смирнов', 'Иван', 'Сергеевич', 3, '+79851551882', 'иван.смирнов@gmail.com', '1999-06-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (18, 24, 'Ковальчук', 'Анна', 'Николаевна', 3, '+79913195874', 'анна.ковальчук@mail.ru', '1999-06-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 24, 'Мельников', 'Дмитрий', 'Олегович', 3, '+79197747648', 'дмитрий.мельников@example.com', '2000-10-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 24, 'Тимошенко', 'Александр', 'Дмитриевич', 4, '+79798367036', 'александр.тимошенко@yandex.ru', '2002-06-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 24, 'Шевченко', 'Николай', 'Петрович', 4, '+79431179289', 'николай.шевченко@mail.ru', '2000-10-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 24, 'Голубев', 'Анатолий', 'Викторович', 4, '+79203411092', 'анатолий.голубев@gmail.com', '2005-11-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 24, 'Панасенко', 'Денис', 'Вячеславович', 4, '+79638439382', 'денис.панасенко@example.com', '2001-04-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (18, 24, 'Червоненко', 'Светлана', 'Игоревна', 4, '+79776990511', 'светлана.червоненко@mail.ru', '2004-02-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 24, 'Ребров', 'Кирилл', 'Александрович', 4, '+79927339451', 'кирилл.ребров@gmail.com', '2001-06-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 24, 'Тихонов', 'Андрей', 'Дмитриевич', 4, '+79893279040', 'андрей.тихонов@mail.ru', '2003-07-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 24, 'Тищенко', 'Иван', 'Владимирович', 4, '+79975022835', 'иван.тищенко@example.com', '2001-07-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 24, 'Сенкевич', 'Ольга', 'Романовна', 4, '+79848668072', 'ольга.сенкевич@example.com', '2002-03-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (18, 24, 'Середа', 'Татьяна', 'Валерьевна', 4, '+79044647592', 'татьяна.середа@gmail.com', '2001-07-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 24, 'Митрофанов', 'Степан', 'Станиславович', 4, '+79145948044', 'степан.митрофанов@yandex.ru', '2005-02-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 24, 'Дубровский', 'Станислав', 'Викторович', 4, '+79442187205', 'станислав.дубровский@example.com', '1999-12-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (18, 24, 'Гончар', 'Анатолий', 'Павлович', 4, '+79454120559', 'анатолий.гончар@yandex.ru', '2002-09-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (16, 24, 'Грушевский', 'Евгений', 'Игоревич', 4, '+79913646091', 'евгений.грушевский@yandex.ru', '2003-07-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (17, 24, 'Яровая', 'Ольга', 'Павловна', 4, '+79677790845', 'ольга.яровая@gmail.com', '2003-03-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (18, 24, 'Костюк', 'Александр', 'Викторович', 4, '+79953868781', 'александр.костюк@example.com', '2001-08-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 25, 'Митрофанов', 'Александр', 'Игоревич', 3, '+79132558488', 'александр.митрофанов@example.com', '2001-04-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 25, 'Семенова', 'Мария', 'Олеговна', 3, '+79304455765', 'мария.семенова@gmail.com', '2002-05-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 25, 'Герасимова', 'Олеся', 'Дмитриевна', 3, '+79077277892', 'олеся.герасимова@example.com', '2002-12-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 25, 'Афанасьев', 'Рамеш', 'Станиславович', 3, '+79853497741', 'рамеш.афанасьев@yandex.ru', '2005-04-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 25, 'Лебедева', 'Ольга', 'Викторовна', 3, '+79532491325', 'ольга.лебедева@yandex.ru', '2002-12-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 25, 'Фомичева', 'Ксения', 'Анатольевна', 3, '+79078619066', 'ксения.фомичева@gmail.com', '1999-05-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 25, 'Гончарова', 'Ксения', 'Игоревна', 3, '+79207989541', 'ксения.гончарова@gmail.com', '1999-04-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 25, 'Шабанова', 'Евгения', 'Николаевна', 3, '+79815926608', 'евгения.шабанова@example.com', '2003-04-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 25, 'Соболева', 'Татьяна', 'Александровна', 3, '+79301466680', 'татьяна.соболева@yandex.ru', '2004-01-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 25, 'Тимошенко', 'Станислав', 'Олегович', 3, '+79231345564', 'станислав.тимошенко@mail.ru', '2003-07-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 25, 'Бакуменко', 'Владислава', 'Анатольевна', 3, '+79233022844', 'владислава.бакуменко@example.com', '2003-05-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 25, 'Левченко', 'Светлана', 'Дмитриевна', 3, '+79083285974', 'светлана.левченко@gmail.com', '2005-08-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 25, 'Шевченко', 'Николай', 'Олегович', 3, '+79119575144', 'николай.шевченко@example.com', '1999-04-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 25, 'Копылова', 'Анастасия', 'Сергеевна', 3, '+79468503823', 'анастасия.копылова@mail.ru', '2002-07-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 25, 'Ажадов', 'Раджеш', 'Иванович', 3, '+79168861794', 'раджеш.ажадов@gmail.com', '1999-08-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 25, 'Молотова', 'Анна', 'Станиславовна', 3, '+79488584440', 'анна.молотова@example.com', '2000-07-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 25, 'Дорохова', 'Николай', 'Сергеевич', 4, '+79747387369', 'николай.дорохова@gmail.com', '2003-05-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 25, 'Бурлакова', 'Андрея', 'Олеговна', 4, '+79243974147', 'андрея.бурлакова@gmail.com', '2000-09-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 25, 'Петрова', 'Ирина', 'Сергеевна', 4, '+79803204610', 'ирина.петрова@example.com', '2005-05-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 25, 'Литвинов', 'Александр', 'Игоревич', 4, '+79827909192', 'александр.литвинов@example.com', '2005-03-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 25, 'Круглова', 'Мария', 'Александровна', 4, '+79994466812', 'мария.круглова@gmail.com', '1999-07-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 25, 'Бондаренко', 'Игорь', 'Анатольевич', 4, '+79486818924', 'игорь.бондаренко@gmail.com', '2002-01-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 25, 'Ярмоленко', 'Анна', 'Дмитриевна', 4, '+79509540789', 'анна.ярмоленко@gmail.com', '2000-07-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 25, 'Агаджанов', 'Рави', 'Петрович', 4, '+79425538987', 'рави.агаджанов@gmail.com', '2004-01-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 25, 'Александрова', 'Станислава', 'Викторовна', 4, '+79325046800', 'станислава.александрова@yandex.ru', '1999-01-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 25, 'Малышева', 'Евгения', 'Станиславовна', 4, '+79746785174', 'евгения.малышева@example.com', '2004-02-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 25, 'Шевченко', 'Екатерина', 'Геннадьевна', 4, '+79635331266', 'екатерина.шевченко@example.com', '2003-12-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 25, 'Семенова', 'Иван', 'Дмитриевич', 4, '+79745456305', 'иван.семенова@gmail.com', '2000-09-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 25, 'Костюк', 'Татьяна', 'Игоревна', 4, '+79978074367', 'татьяна.костюк@gmail.com', '2005-09-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 25, 'Сенкевич', 'Максим', 'Александрович', 4, '+79792788198', 'максим.сенкевич@example.com', '1999-02-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 25, 'Тихомиров', 'Лев', 'Алексеевич', 4, '+79134356478', 'лев.тихомиров@gmail.com', '2005-12-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 25, 'Чекмарева', 'Ольга', 'Геннадьевна', 4, '+79555876408', 'ольга.чекмарева@yandex.ru', '2003-03-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 26, 'Логинова', 'Светлана', 'Викторовна', 1, '+79553391941', 'светлана.логинова@mail.ru', '2002-09-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 26, 'Касаткина', 'Александра', 'Павловна', 1, '+79018921084', 'александра.касаткина@example.com', '1999-06-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 26, 'Заварзина', 'Евгения', 'Игоревна', 1, '+79468241303', 'евгения.заварзина@mail.ru', '2005-06-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 26, 'Ачалкова', 'Рамеша', 'Станиславович', 1, '+79307687881', 'рамеша.ачалкова@example.com', '2002-06-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 26, 'Топоркова', 'Мария', 'Анатольевна', 1, '+79815768600', 'мария.топоркова@example.com', '2001-05-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 26, 'Миронова', 'Татьяна', 'Сергеевна', 1, '+79843337827', 'татьяна.миронова@mail.ru', '1999-04-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 26, 'Гладкий', 'Тимур', 'Алексеевич', 1, '+79664258287', 'тимур.гладкий@example.com', '2003-04-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 26, 'Савельева', 'Наталья', 'Олеговна', 1, '+79972613235', 'наталья.савельева@mail.ru', '2000-01-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 26, 'Баранов', 'Владислав', 'Александрович', 1, '+79636594016', 'владислав.баранов@yandex.ru', '2002-04-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 26, 'Ларина', 'Даниела', 'Раджеславовна', 1, '+79933326438', 'даниела.ларина@yandex.ru', '2005-12-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 26, 'Крыжановская', 'Оксана', 'Викторовна', 1, '+79469299069', 'оксана.крыжановская@gmail.com', '2004-05-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 26, 'Снежная', 'Евгения', 'Петровна', 1, '+79068239236', 'евгения.снежная@gmail.com', '2005-11-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 26, 'Гришакова', 'Елена', 'Станиславовна', 1, '+79982320210', 'елена.гришакова@example.com', '2001-08-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 26, 'Смирнова', 'Светлана', 'Геннадьевна', 1, '+79819680267', 'светлана.смирнова@mail.ru', '2000-06-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 26, 'Кравченко', 'Алина', 'Станиславовна', 1, '+79904820939', 'алина.кравченко@mail.ru', '2001-09-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 26, 'Клюева', 'Марина', 'Станиславовна', 2, '+79492986256', 'марина.клюева@gmail.com', '2002-10-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 26, 'Панова', 'Алена', 'Дмитриевна', 2, '+79482350045', 'алена.панова@yandex.ru', '2001-10-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 26, 'Кириченко', 'Оксана', 'Анатольевна', 2, '+79803387884', 'оксана.кириченко@example.com', '1999-05-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 26, 'Фомина', 'Наталья', 'Алексеевна', 2, '+79522126669', 'наталья.фомина@mail.ru', '2003-06-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 26, 'Заяц', 'Александр', 'Викторович', 2, '+79219586487', 'александр.заяц@example.com', '2002-12-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 26, 'Лукина', 'Татьяна', 'Павловна', 2, '+79549229382', 'татьяна.лукина@example.com', '2001-01-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 26, 'Соловьева', 'Лилия', 'Николаевна', 2, '+79254482456', 'лилия.соловьева@yandex.ru', '2000-10-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 26, 'Лобанова', 'Светлана', 'Александровна', 2, '+79569863408', 'светлана.лобанова@yandex.ru', '1999-07-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 26, 'Романова', 'Дмитрий', 'Станиславович', 2, '+79696798754', 'дмитрий.романова@mail.ru', '2000-07-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 26, 'Завьялова', 'Анастасия', 'Игоревна', 2, '+79345812883', 'анастасия.завьялова@yandex.ru', '2004-03-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 27, 'Михайлова', 'Иванна', 'Станиславовна', 3, '+79269432674', 'иванна.михайлова@yandex.ru', '2004-12-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 27, 'Тарасова', 'Светлана', 'Викторовна', 3, '+79511446705', 'светлана.тарасова@example.com', '1999-03-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 27, 'Кузьмина', 'Оксана', 'Дмитриевна', 3, '+79194599570', 'оксана.кузьмина@mail.ru', '2001-02-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 27, 'Трофимова', 'Ольга', 'Анатольевна', 3, '+79099985001', 'ольга.трофимова@gmail.com', '2000-07-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 27, 'Павленко', 'Татьяна', 'Игоревна', 3, '+79497396818', 'татьяна.павленко@gmail.com', '2002-03-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 27, 'Степаненко', 'Ирина', 'Владимировна', 3, '+79744966443', 'ирина.степаненко@yandex.ru', '2001-07-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 27, 'Носкова', 'Кирилла', 'Петровна', 3, '+79802168170', 'кирилла.носкова@example.com', '2005-03-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 27, 'Калинина', 'Мария', 'Станиславовна', 3, '+79098923151', 'мария.калинина@mail.ru', '2000-06-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 27, 'Афанасьева', 'Раджеш', 'Викторовна', 3, '+79646456244', 'раджеш.афанасьева@example.com', '1999-09-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 27, 'Никонорова', 'Лариса', 'Петровна', 3, '+79306317266', 'лариса.никонорова@yandex.ru', '2003-02-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 27, 'Еременко', 'Анна', 'Александровна', 3, '+79991786862', 'анна.еременко@yandex.ru', '2000-02-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 27, 'Кизилова', 'Дмитрий', 'Анатольевич', 3, '+79338937919', 'дмитрий.кизилова@mail.ru', '1999-11-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 27, 'Сосновская', 'Тимура', 'Геннадьевна', 3, '+79811427268', 'тимура.сосновская@mail.ru', '2004-03-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 27, 'Панасенко', 'Станислава', 'Олеговна', 3, '+79273925049', 'станислава.панасенко@gmail.com', '1999-04-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 27, 'Федорова', 'Евгения', 'Дмитриевна', 3, '+79962334050', 'евгения.федорова@yandex.ru', '2001-12-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 27, 'Громова', 'Анна', 'Александровна', 4, '+79165727382', 'анна.громова@example.com', '2001-11-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 27, 'Глухова', 'Никита', 'Павлович', 4, '+79275152816', 'никита.глухова@example.com', '2004-08-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 27, 'Кубракова', 'Дмитрия', 'Олеговна', 4, '+79747475401', 'дмитрия.кубракова@yandex.ru', '1999-01-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 27, 'Лихачева', 'Евгения', 'Станиславовна', 4, '+79633478435', 'евгения.лихачева@example.com', '2000-10-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 27, 'Мартынова', 'Анна', 'Геннадьевна', 4, '+79715719167', 'анна.мартынова@example.com', '2005-03-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 27, 'Ульянова', 'Александр', 'Викторович', 4, '+79911725198', 'александр.ульянова@example.com', '2001-11-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 27, 'Чередник', 'Мария', 'Алексеевна', 4, '+79183388210', 'мария.чередник@gmail.com', '2004-02-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 27, 'Пудовкин', 'Сергей', 'Дмитриевич', 4, '+79667487829', 'сергей.пудовкин@yandex.ru', '2004-03-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 27, 'Сергеевна', 'Даша', 'Станиславовна', 4, '+79897591462', 'даша.сергеевна@yandex.ru', '2002-10-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 27, 'Чепыга', 'Станислав', 'Павлович', 4, '+79901870559', 'станислав.чепыга@mail.ru', '2001-01-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (19, 27, 'Зубарева', 'Анастасия', 'Игоревна', 4, '+79273006532', 'анастасия.зубарева@example.com', '1999-05-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 27, 'Дятлов', 'Алексей', 'Петрович', 4, '+79412517273', 'алексей.дятлов@yandex.ru', '2005-06-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 27, 'Чудова', 'Светлана', 'Александровна', 4, '+79001842956', 'светлана.чудова@gmail.com', '1999-03-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 27, 'Ведерникова', 'Лариса', 'Николаевна', 4, '+79084842906', 'лариса.ведерникова@gmail.com', '1999-07-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (21, 27, 'Борисова', 'Елена', 'Станиславовна', 4, '+79113646500', 'елена.борисова@yandex.ru', '2001-10-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (20, 27, 'Захарова', 'Ксения', 'Анатольевна', 4, '+79805196840', 'ксения.захарова@example.com', '2003-05-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 28, 'Малышева', 'Лилия', 'Станиславовна', 3, '+79867598705', 'лилия.малышева@yandex.ru', '2003-06-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 28, 'Миронов', 'Георгий', 'Станиславович', 3, '+79408449282', 'георгий.миронов@gmail.com', '2004-04-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (23, 28, 'Гайдаенко', 'Анжела', 'Анатольевна', 3, '+79531345866', 'анжела.гайдаенко@gmail.com', '2001-05-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 28, 'Султанов', 'Арсен', 'Рустамович', 3, '+79695427832', 'арсен.султанов@example.com', '1999-03-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (23, 28, 'Яковлева', 'Евгения', 'Сергеевна', 3, '+79128470026', 'евгения.яковлева@mail.ru', '2002-09-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (23, 28, 'Долгушина', 'Татьяна', 'Викторовна', 3, '+79226342465', 'татьяна.долгушина@mail.ru', '2003-09-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 28, 'Павлов', 'Роман', 'Олегович', 3, '+79325004523', 'роман.павлов@example.com', '1999-06-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 28, 'Давыдова', 'Ксения', 'Игоревна', 3, '+79057745191', 'ксения.давыдова@gmail.com', '2001-01-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 28, 'Смирнов', 'Алексей', 'Дмитриевич', 4, '+79165975918', 'алексей.смирнов@example.com', '1999-09-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 28, 'Курбанов', 'Лейла', 'Анаровна', 4, '+79804948732', 'лейла.курбанов@example.com', '2001-07-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (23, 28, 'Калинин', 'Денис', 'Александрович', 4, '+79371132309', 'денис.калинин@mail.ru', '1999-03-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (24, 28, 'Степанова', 'Надежда', 'Викторовна', 4, '+79755370380', 'надежда.степанова@yandex.ru', '2000-10-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (23, 28, 'Жуков', 'Тимур', 'Агасиевич', 4, '+79034859193', 'тимур.жуков@example.com', '2002-10-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (23, 28, 'Лимонова', 'Софья', 'Анатольевна', 4, '+79255676659', 'софья.лимонова@mail.ru', '1999-06-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 28, 'Левчук', 'Сергей', 'Дмитриевич', 4, '+79613153733', 'сергей.левчук@mail.ru', '2005-07-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (23, 28, 'Садыкова', 'Ася', 'Тимуровна', 4, '+79835563257', 'ася.садыкова@example.com', '2005-06-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 29, 'Калинина', 'Евгения', 'Александровна', 1, '+79539719308', 'евгения.калинина@yandex.ru', '1999-12-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (23, 29, 'Мамедова', 'Нигяр', 'Сулеймановна', 1, '+79384264832', 'нигяр.мамедова@yandex.ru', '2000-07-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 29, 'Савченко', 'Алексей', 'Олегович', 1, '+79163220084', 'алексей.савченко@yandex.ru', '2004-10-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 29, 'Батырова', 'Нурия', 'Мажитовна', 1, '+79879317594', 'нурия.батырова@example.com', '2005-04-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (23, 29, 'Дудкина', 'Татьяна', 'Игоревна', 1, '+79842835522', 'татьяна.дудкина@yandex.ru', '2003-10-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 29, 'Насипова', 'Далия', 'Хабировна', 1, '+79431558325', 'далия.насипова@yandex.ru', '2001-09-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 29, 'Гончарова', 'Светлана', 'Петровна', 1, '+79252986090', 'светлана.гончарова@gmail.com', '2004-04-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 29, 'Пупырева', 'Ксения', 'Валерьевна', 2, '+79549468982', 'ксения.пупырева@gmail.com', '2005-03-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (23, 29, 'Петров', 'Игорь', 'Станиславович', 2, '+79746669888', 'игорь.петров@gmail.com', '2001-06-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 29, 'Гервасьев', 'Алексей', 'Игоревич', 2, '+79796483633', 'алексей.гервасьев@example.com', '2003-03-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 29, 'Чалова', 'Анастасия', 'Романовна', 2, '+79715455823', 'анастасия.чалова@mail.ru', '2002-01-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (23, 29, 'Фролова', 'Дина', 'Сергеевна', 2, '+79742366373', 'дина.фролова@example.com', '2004-11-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (24, 29, 'Сахнов', 'Дмитрий', 'Олегович', 2, '+79374357600', 'дмитрий.сахнов@mail.ru', '2000-01-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 30, 'Небелицкая', 'Елена', 'Дмитриевна', 3, '+79197633809', 'елена.небелицкая@example.com', '2002-01-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (24, 30, 'Сабиров', 'Азамат', 'Геннадиевич', 3, '+79303823759', 'азамат.сабиров@gmail.com', '2005-07-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (24, 30, 'Аналов', 'Дмитрий', 'Сергеевич', 3, '+79162147721', 'дмитрий.аналов@example.com', '2005-03-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (23, 30, 'Иванова', 'Мария', 'Александровна', 3, '+79075089356', 'мария.иванова@gmail.com', '2001-01-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 30, 'Топорова', 'Вера', 'Игоревна', 3, '+79666510549', 'вера.топорова@gmail.com', '2003-06-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (23, 30, 'Бабичев', 'Артем', 'Дмитриевич', 3, '+79816535640', 'артем.бабичев@example.com', '2005-11-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 30, 'Зайцева', 'Анна', 'Александровна', 3, '+79658953432', 'анна.зайцева@example.com', '1999-04-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (23, 30, 'Кириллова', 'Анастасия', 'Романовна', 3, '+79328096089', 'анастасия.кириллова@example.com', '2000-06-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 30, 'Синельников', 'Станислав', 'Павлович', 4, '+79323484488', 'станислав.синельников@mail.ru', '2002-08-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (23, 30, 'Казанцева', 'Анастасия', 'Игоревна', 4, '+79686776380', 'анастасия.казанцева@example.com', '2005-08-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (24, 30, 'Устинов', 'Виктор', 'Михайлович', 4, '+79172783632', 'виктор.устинов@mail.ru', '2003-10-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (24, 30, 'Соболева', 'Ольга', 'Дмитриевна', 4, '+79223282441', 'ольга.соболева@mail.ru', '2004-04-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (24, 30, 'Мороз', 'Анастасия', 'Александровна', 4, '+79057344819', 'анастасия.мороз@mail.ru', '1999-04-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (22, 30, 'Григорьев', 'Марк', 'Иванович', 4, '+79477802968', 'марк.григорьев@gmail.com', '2005-12-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 31, 'Соколов', 'Дмитрий', 'Александрович', 3, '+79921319915', 'дмитрий.соколов@mail.ru', '1999-09-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 31, 'Доронина', 'Елизавета', 'Игоревна', 3, '+79124049680', 'елизавета.доронина@yandex.ru', '2005-01-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 31, 'Шевченко', 'Виктор', 'Николаевич', 3, '+79595862512', 'виктор.шевченко@mail.ru', '2000-06-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 31, 'Кузнецова', 'Полина', 'Вячеславовна', 3, '+79233919751', 'полина.кузнецова@mail.ru', '1999-02-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 31, 'Никитин', 'Максим', 'Станиславович', 3, '+79265380693', 'максим.никитин@example.com', '2001-11-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 31, 'Афанасьева', 'Елена', 'Михайловна', 3, '+79001945655', 'елена.афанасьева@example.com', '1999-05-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 31, 'Федорова', 'Анастасия', 'Дмитриевна', 4, '+79446421061', 'анастасия.федорова@example.com', '2000-08-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 31, 'Дьячкова', 'Татьяна', 'Викторовна', 4, '+79884393900', 'татьяна.дьячкова@yandex.ru', '2002-08-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 31, 'Горшкова', 'Ольга', 'Александровна', 4, '+79388905460', 'ольга.горшкова@mail.ru', '2004-05-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 31, 'Набиев', 'Руслан', 'Сергеевич', 4, '+79223255645', 'руслан.набиев@yandex.ru', '2000-07-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 32, 'Сахарова', 'Мария', 'Геннадиевна', 1, '+79488498161', 'мария.сахарова@gmail.com', '2003-08-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 32, 'Григорьев', 'Глеб', 'Александрович', 1, '+79316087061', 'глеб.григорьев@example.com', '2000-07-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 32, 'Мусаев', 'Рустам', 'Ашрафович', 1, '+79133295974', 'рустам.мусаев@gmail.com', '2005-04-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 32, 'Костина', 'Светлана', 'Анатольевна', 1, '+79839397421', 'светлана.костина@example.com', '2001-04-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 32, 'Тимурова', 'Фарида', 'Эльдаровна', 1, '+79256541455', 'фарида.тимурова@mail.ru', '2000-11-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 32, 'Калюжная', 'Анна', 'Александровна', 1, '+79833653860', 'анна.калюжная@mail.ru', '2002-10-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 32, 'Егоров', 'Денис', 'Игоревич', 2, '+79196257989', 'денис.егоров@example.com', '2004-01-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 32, 'Шпаков', 'Артем', 'Станиславович', 2, '+79118390240', 'артем.шпаков@mail.ru', '2002-04-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 32, 'Мухамедова', 'Алия', 'Султановна', 2, '+79848178912', 'алия.мухамедова@yandex.ru', '2004-09-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 32, 'Шишко', 'Роман', 'Михайлович', 2, '+79804582688', 'роман.шишко@example.com', '2004-02-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 32, 'Семенова', 'Екатерина', 'Викторовна', 2, '+79265209863', 'екатерина.семенова@gmail.com', '2002-07-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 33, 'Сарапулова', 'Аделина', 'Дамировна', 3, '+79081233192', 'аделина.сарапулова@example.com', '2004-03-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 33, 'Власов', 'Александр', 'Андреевич', 3, '+79096101213', 'александр.власов@mail.ru', '2003-07-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 33, 'Апальков', 'Дмитрий', 'Михайлович', 3, '+79258694740', 'дмитрий.апальков@yandex.ru', '2001-01-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 33, 'Шалимова', 'Кристина', 'Викторовна', 3, '+79246120109', 'кристина.шалимова@yandex.ru', '2004-08-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 33, 'Хусаинов', 'Рамиль', 'Шамилевич', 3, '+79293937558', 'рамиль.хусаинов@yandex.ru', '2004-02-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 33, 'Занизов', 'Денис', 'Сергеевич', 3, '+79648701296', 'денис.занизов@yandex.ru', '2002-04-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 33, 'Гордеев', 'Игорь', 'Станиславович', 4, '+79577349894', 'игорь.гордеев@example.com', '2003-05-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 33, 'Токарев', 'Антон', 'Алексеевич', 4, '+79075078405', 'антон.токарев@example.com', '2001-02-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 33, 'Шахов', 'Сергей', 'Дмитриевич', 4, '+79904852806', 'сергей.шахов@yandex.ru', '2002-06-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 33, 'Богданова', 'Вероника', 'Олеговна', 4, '+79059924666', 'вероника.богданова@gmail.com', '2001-09-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 31, 'Сычев', 'Анатолий', 'Сергеевич', 3, '+79309983181', 'анатолий.сычев@example.com', '1999-01-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 31, 'Лосев', 'Олег', 'Дмитриевич', 3, '+79398315172', 'олег.лосев@yandex.ru', '2002-09-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 31, 'Рябова', 'Полина', 'Вячеславовна', 3, '+79857423376', 'полина.рябова@mail.ru', '2004-06-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 31, 'Широков', 'Федор', 'Иванович', 3, '+79718611740', 'федор.широков@yandex.ru', '2000-02-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 31, 'Соловьев', 'Дмитрий', 'Александрович', 3, '+79608739566', 'дмитрий.соловьев@example.com', '2005-02-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 31, 'Трошина', 'Валентина', 'Сергеевна', 3, '+79534545424', 'валентина.трошина@example.com', '2000-04-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 31, 'Гончарова', 'Дарья', 'Денисовна', 3, '+79851382577', 'дарья.гончарова@example.com', '2001-05-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 31, 'Микрюков', 'Данила', 'Денисович', 3, '+79991934975', 'данила.микрюков@gmail.com', '2005-02-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 31, 'Дубровин', 'Станислав', 'Иванович', 4, '+79066065475', 'станислав.дубровин@example.com', '2001-08-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 31, 'Трифонов', 'Евгений', 'Александрович', 4, '+79788650551', 'евгений.трифонов@yandex.ru', '2003-12-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 31, 'Долгих', 'Александр', 'Сергеевич', 4, '+79293090764', 'александр.долгих@example.com', '2004-05-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 31, 'Лещенко', 'Надежда', 'Владимировна', 4, '+79635654955', 'надежда.лещенко@yandex.ru', '2000-03-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 31, 'Соколовская', 'Маргарита', 'Федоровна', 4, '+79366265268', 'маргарита.соколовская@gmail.com', '2001-10-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 31, 'Тихонов', 'Илья', 'Андреевич', 4, '+79148735732', 'илья.тихонов@mail.ru', '1999-09-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 32, 'Ковальчук', 'Светлана', 'Игоревна', 1, '+79568342176', 'светлана.ковальчук@mail.ru', '2001-09-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 32, 'Тарасенко', 'Роман', 'Николаевич', 1, '+79663049695', 'роман.тарасенко@mail.ru', '2000-05-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 32, 'Садчиков', 'Денис', 'Станиславович', 1, '+79371784954', 'денис.садчиков@yandex.ru', '2005-12-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 32, 'Ярошенко', 'Тамара', 'Анатольевна', 1, '+79128096065', 'тамара.ярошенко@gmail.com', '2004-05-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 32, 'Завьялов', 'Никита', 'Сергеевич', 1, '+79079164424', 'никита.завьялов@mail.ru', '2004-03-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 32, 'Семена', 'Ирина', 'Станиславовна', 1, '+79159074547', 'ирина.семена@example.com', '2001-07-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 32, 'Боровик', 'Мария', 'Дмитриевна', 1, '+79167333878', 'мария.боровик@mail.ru', '2004-12-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 32, 'Костромская', 'Надежда', 'Валентиновна', 1, '+79666640143', 'надежда.костромская@mail.ru', '1999-05-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 32, 'Беляев', 'Михаил', 'Олегович', 2, '+79212901545', 'михаил.беляев@yandex.ru', '2003-01-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 32, 'Лавров', 'Кирилл', 'Игоревич', 2, '+79739516583', 'кирилл.лавров@example.com', '2001-02-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 32, 'Горбунов', 'Станислав', 'Игоревич', 2, '+79166417013', 'станислав.горбунов@yandex.ru', '1999-05-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 32, 'Остапенко', 'Елена', 'Павловна', 2, '+79298189619', 'елена.остапенко@example.com', '2002-01-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 32, 'Ефимова', 'Татьяна', 'Алексеевна', 2, '+79235433190', 'татьяна.ефимова@mail.ru', '2004-09-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 32, 'Савельев', 'Владислав', 'Юрьевич', 2, '+79171633539', 'владислав.савельев@example.com', '2005-06-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 33, 'Петров', 'Игорь', 'Викторович', 3, '+79281245018', 'игорь.петров@gmail.com', '1999-09-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 33, 'Ширшов', 'Денис', 'Александрович', 3, '+79957294841', 'денис.ширшов@gmail.com', '2004-03-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 33, 'Тимченко', 'Анастасия', 'Андреевна', 3, '+79158844096', 'анастасия.тимченко@gmail.com', '2003-04-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 33, 'Лукин', 'Станислав', 'Сергеевич', 3, '+79741743218', 'станислав.лукин@mail.ru', '2001-09-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 33, 'Гвоздев', 'Алексей', 'Игоревич', 3, '+79335243475', 'алексей.гвоздев@mail.ru', '2003-02-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 33, 'Кошечкин', 'Валерий', 'Анатольевич', 3, '+79023248090', 'валерий.кошечкин@mail.ru', '2005-05-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 33, 'Мальцев', 'Анатолий', 'Николаевич', 4, '+79132668867', 'анатолий.мальцев@yandex.ru', '2002-05-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 33, 'Сухов', 'Игорь', 'Денисович', 4, '+79901074452', 'игорь.сухов@example.com', '2004-01-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 33, 'Карапетян', 'Евгений', 'Артемович', 4, '+79597327569', 'евгений.карапетян@example.com', '2002-05-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (26, 33, 'Кудряшов', 'Дмитрий', 'Станиславович', 4, '+79922491024', 'дмитрий.кудряшов@mail.ru', '2003-07-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (25, 33, 'Ларин', 'Марк', 'Сергеевич', 4, '+79554614586', 'марк.ларин@gmail.com', '2000-06-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 34, 'Гвоздева', 'Виктория', 'Анатольевна', 3, '+79402729206', 'виктория.гвоздева@gmail.com', '1999-03-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 34, 'Левченко', 'Елизавета', 'Денисовна', 3, '+79669298803', 'елизавета.левченко@yandex.ru', '2002-01-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 34, 'Прокопенко', 'Дмитрий', 'Сергеевич', 3, '+79454842431', 'дмитрий.прокопенко@mail.ru', '2001-10-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 34, 'Шевченко', 'Анастасия', 'Викторовна', 3, '+79633697751', 'анастасия.шевченко@yandex.ru', '2001-11-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 34, 'Тимошенко', 'Артем', 'Игоревич', 3, '+79102645558', 'артем.тимошенко@mail.ru', '1999-11-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 34, 'Чередниченко', 'Анатолий', 'Романович', 3, '+79244283083', 'анатолий.чередниченко@yandex.ru', '2004-03-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 34, 'Диденко', 'Григорий', 'Станиславович', 3, '+79523466540', 'григорий.диденко@yandex.ru', '2001-09-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 34, 'Ломов', 'Александр', 'Валерьевич', 3, '+79564768267', 'александр.ломов@example.com', '2004-04-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 34, 'Гончарова', 'Мария', 'Викторовна', 4, '+79508556693', 'мария.гончарова@mail.ru', '2003-08-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 34, 'Сергеева', 'Татьяна', 'Станиславовна', 4, '+79873462957', 'татьяна.сергеева@gmail.com', '2005-10-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 34, 'Шаповалов', 'Степан', 'Александрович', 4, '+79072143020', 'степан.шаповалов@gmail.com', '2004-07-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 34, 'Ткаченко', 'Сергей', 'Владимирович', 4, '+79744901342', 'сергей.ткаченко@gmail.com', '2004-10-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 34, 'Симонова', 'Ирина', 'Петровна', 4, '+79252479518', 'ирина.симонова@mail.ru', '2003-07-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 34, 'Фролова', 'Ксения', 'Дмитриевна', 4, '+79667133240', 'ксения.фролова@gmail.com', '1999-02-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 35, 'Серебряков', 'Евгений', 'Игоревич', 1, '+79384655994', 'евгений.серебряков@yandex.ru', '2002-01-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 35, 'Ермакова', 'Людмила', 'Александровна', 1, '+79327481975', 'людмила.ермакова@example.com', '2003-03-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 35, 'Бурков', 'Станислав', 'Дмитриевич', 1, '+79212602084', 'станислав.бурков@yandex.ru', '2000-06-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 35, 'Тимофеев', 'Данила', 'Иванович', 1, '+79681852359', 'данила.тимофеев@gmail.com', '2000-10-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 35, 'Мирошниченко', 'Анна', 'Сергеевна', 1, '+79487171591', 'анна.мирошниченко@mail.ru', '1999-04-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 35, 'Светлов', 'Николай', 'Алексеевич', 1, '+79706309586', 'николай.светлов@yandex.ru', '2001-01-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 35, 'Токарева', 'Татьяна', 'Ивановна', 1, '+79373608220', 'татьяна.токарева@mail.ru', '2003-06-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 35, 'Денисенко', 'Федор', 'Станиславович', 1, '+79223123293', 'федор.денисенко@example.com', '2004-07-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 35, 'Федоров', 'Илья', 'Павлович', 2, '+79087121475', 'илья.федоров@mail.ru', '1999-05-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 35, 'Костина', 'Надежда', 'Вячеславовна', 2, '+79823855889', 'надежда.костина@gmail.com', '2004-04-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 35, 'Горбатенко', 'Сергей', 'Анатольевич', 2, '+79149019019', 'сергей.горбатенко@yandex.ru', '2004-09-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 35, 'Зубкова', 'Елизавета', 'Олеговна', 2, '+79118731532', 'елизавета.зубкова@yandex.ru', '1999-10-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 35, 'Гришин', 'Дмитрий', 'Александрович', 2, '+79422895200', 'дмитрий.гришин@mail.ru', '2005-05-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 35, 'Тарасова', 'Юлия', 'Викторовна', 2, '+79189518741', 'юлия.тарасова@mail.ru', '2004-05-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 36, 'Степаненко', 'Денис', 'Олегович', 3, '+79295755040', 'денис.степаненко@mail.ru', '1999-09-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 36, 'Никифоров', 'Алексей', 'Николаевич', 3, '+79815473045', 'алексей.никифоров@example.com', '2004-11-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 36, 'Слепцов', 'Игорь', 'Михайлович', 3, '+79663118881', 'игорь.слепцов@example.com', '2004-08-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 36, 'Беляева', 'Юлия', 'Станиславовна', 3, '+79155499594', 'юлия.беляева@yandex.ru', '2004-01-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 36, 'Сидорова', 'Анна', 'Анатольевна', 3, '+79057151012', 'анна.сидорова@gmail.com', '2002-07-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 36, 'Гончарова', 'Татьяна', 'Дмитриевна', 3, '+79157980314', 'татьяна.гончарова@example.com', '2004-03-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 36, 'Бекешев', 'Игорь', 'Алексеевич', 4, '+79238762648', 'игорь.бекешев@example.com', '2002-04-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 36, 'Денисов', 'Максим', 'Анатольевич', 4, '+79048079764', 'максим.денисов@yandex.ru', '1999-10-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 36, 'Агафонов', 'Дмитрий', 'Сергеевич', 4, '+79756429673', 'дмитрий.агафонов@gmail.com', '2004-06-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 36, 'Иванова', 'Светлана', 'Петровна', 4, '+79708398163', 'светлана.иванова@example.com', '2004-04-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 36, 'Коваленко', 'Евгений', 'Александрович', 4, '+79593100597', 'евгений.коваленко@yandex.ru', '2003-02-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 36, 'Лейко', 'Наталья', 'Дмитриевна', 4, '+79751067933', 'наталья.лейко@gmail.com', '1999-11-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 34, 'Петрова', 'Анна', 'Сергеевна', 3, '+79329422728', 'анна.петрова@gmail.com', '2001-05-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 34, 'Бурмистров', 'Андрей', 'Иванович', 3, '+79156798431', 'андрей.бурмистров@yandex.ru', '2000-08-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 34, 'Круглова', 'Марина', 'Алексеевна', 3, '+79643363215', 'марина.круглова@example.com', '2004-08-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 34, 'Молостов', 'Олег', 'Викторович', 3, '+79847863211', 'олег.молостов@example.com', '2004-01-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 34, 'Сысоева', 'Светлана', 'Дмитриевна', 3, '+79009266700', 'светлана.сысоева@example.com', '1999-10-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 34, 'Лавров', 'Виктор', 'Иванович', 4, '+79111035897', 'виктор.лавров@mail.ru', '2005-09-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 34, 'Алексеев', 'Роман', 'Геннадьевич', 4, '+79677922040', 'роман.алексеев@gmail.com', '2001-07-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 34, 'Костина', 'Елена', 'Станиславовна', 4, '+79659703821', 'елена.костина@yandex.ru', '2000-02-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 34, 'Куприяненко', 'Денис', 'Игоревич', 4, '+79455434330', 'денис.куприяненко@mail.ru', '2004-08-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 35, 'Чечет', 'Анна', 'Николаевна', 1, '+79148240743', 'анна.чечет@gmail.com', '2001-09-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 35, 'Бузулукова', 'Елена', 'Анатольевна', 1, '+79111702463', 'елена.бузулукова@yandex.ru', '2002-04-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 35, 'Мельников', 'Дмитрий', 'Романович', 1, '+79409570247', 'дмитрий.мельников@yandex.ru', '1999-08-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 35, 'Покровская', 'Татьяна', 'Игоревна', 1, '+79556493706', 'татьяна.покровская@gmail.com', '2005-06-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 35, 'Серегин', 'Василий', 'Геннадиевич', 1, '+79216985405', 'василий.серегин@gmail.com', '2000-10-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 35, 'Лейбман', 'Семен', 'Александрович', 2, '+79157736129', 'семен.лейбман@example.com', '2004-06-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 35, 'Лаптев', 'Олег', 'Игоревич', 2, '+79231474228', 'олег.лаптев@gmail.com', '2000-03-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 35, 'Шпак', 'Виктор', 'Станиславович', 2, '+79639920290', 'виктор.шпак@yandex.ru', '2005-12-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 35, 'Светов', 'Игорь', 'Анатольевич', 2, '+79037973762', 'игорь.светов@example.com', '1999-04-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 36, 'Бороздова', 'Светлана', 'Петровна', 3, '+79882930339', 'светлана.бороздова@gmail.com', '2002-01-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 36, 'Назаренко', 'Артем', 'Сергеевич', 3, '+79642832172', 'артем.назаренко@mail.ru', '2003-07-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 36, 'Смирнов', 'Павел', 'Алексеевич', 3, '+79479417559', 'павел.смирнов@gmail.com', '2003-06-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 36, 'Петрусенко', 'Елизавета', 'Николаевна', 3, '+79295856216', 'елизавета.петрусенко@yandex.ru', '2001-07-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 36, 'Михайлова', 'Мария', 'Алексеевна', 3, '+79742021454', 'мария.михайлова@example.com', '2001-04-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 36, 'Трофимова', 'Елена', 'Станиславовна', 4, '+79497533995', 'елена.трофимова@yandex.ru', '2002-05-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 36, 'Захаров', 'Александр', 'Викторович', 4, '+79224729181', 'александр.захаров@mail.ru', '2000-09-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 36, 'Кутузов', 'Григорий', 'Дмитриевич', 4, '+79025468434', 'григорий.кутузов@yandex.ru', '2005-08-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 36, 'Щербань', 'Оксана', 'Викторовна', 4, '+79754340817', 'оксана.щербань@mail.ru', '1999-02-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 34, 'Дубровин', 'Евгений', 'Анатольевич', 3, '+79273561832', 'евгений.дубровин@example.com', '1999-09-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 34, 'Тимошенко', 'Светлана', 'Петровна', 3, '+79972168485', 'светлана.тимошенко@example.com', '2004-05-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 34, 'Левитин', 'Семен', 'Владимирович', 3, '+79076728941', 'семен.левитин@mail.ru', '2004-11-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 34, 'Кондратенко', 'Лилия', 'Игоревна', 3, '+79539642248', 'лилия.кондратенко@yandex.ru', '2003-09-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 34, 'Голубев', 'Константин', 'Викторович', 3, '+79411877090', 'константин.голубев@example.com', '2004-02-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 34, 'Дьякова', 'Юлия', 'Сергеевна', 4, '+79969051928', 'юлия.дьякова@yandex.ru', '2002-09-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 34, 'Грачев', 'Илья', 'Станиславович', 4, '+79666872992', 'илья.грачев@yandex.ru', '2002-01-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 34, 'Васильев', 'Олег', 'Владимирович', 4, '+79763565520', 'олег.васильев@yandex.ru', '2001-06-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 34, 'Семченко', 'Ирина', 'Алексеевна', 4, '+79124604699', 'ирина.семченко@mail.ru', '2001-02-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 35, 'Агапова', 'Лилия', 'Александровна', 1, '+79389529607', 'лилия.агапова@gmail.com', '2005-05-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 35, 'Горбунов', 'Роман', 'Игоревич', 1, '+79738996364', 'роман.горбунов@mail.ru', '2005-06-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 35, 'Солдатова', 'Анна', 'Дмитриевна', 1, '+79367504795', 'анна.солдатова@example.com', '2001-06-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 35, 'Руденко', 'Артем', 'Сергеевич', 1, '+79029168518', 'артем.руденко@example.com', '2001-01-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 35, 'Харитонов', 'Вадим', 'Викторович', 1, '+79288463482', 'вадим.харитонов@yandex.ru', '2005-03-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 35, 'Забелин', 'Станислав', 'Олегович', 2, '+79132135395', 'станислав.забелин@yandex.ru', '2002-02-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 35, 'Туманова', 'Татьяна', 'Сергеевна', 2, '+79295555761', 'татьяна.туманова@mail.ru', '2003-08-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 35, 'Степанова', 'Екатерина', 'Александровна', 2, '+79539201415', 'екатерина.степанова@mail.ru', '2005-08-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 35, 'Копылова', 'Светлана', 'Викторовна', 2, '+79819527067', 'светлана.копылова@yandex.ru', '2000-04-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 36, 'Мусатов', 'Николай', 'Станиславович', 3, '+79786425678', 'николай.мусатов@example.com', '2000-03-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 36, 'Киселев', 'Станислав', 'Павлович', 3, '+79188397326', 'станислав.киселев@example.com', '1999-10-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 36, 'Кудрявцева', 'Юлия', 'Алексеевна', 3, '+79213661298', 'юлия.кудрявцева@gmail.com', '2001-04-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 36, 'Ларина', 'Ольга', 'Дмитриевна', 3, '+79742417128', 'ольга.ларина@gmail.com', '2003-11-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 36, 'Злобин', 'Андрей', 'Николаевич', 3, '+79914615421', 'андрей.злобин@mail.ru', '2001-02-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 36, 'Быков', 'Станислав', 'Александрович', 4, '+79407490059', 'станислав.быков@example.com', '2000-11-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 36, 'Коровин', 'Вадим', 'Олегович', 4, '+79619119906', 'вадим.коровин@mail.ru', '2005-09-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 36, 'Василиса', 'Екатерина', 'Викторовна', 4, '+79265085182', 'екатерина.василиса@gmail.com', '2003-03-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 36, 'Громов', 'Игорь', 'Анатольевич', 4, '+79463065579', 'игорь.громов@gmail.com', '2002-10-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 36, 'Ширшов', 'Анатолий', 'Владимирович', 3, '+79739318442', 'анатолий.ширшов@gmail.com', '1999-04-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 36, 'Карасева', 'Кристина', 'Дмитриевна', 3, '+79835614606', 'кристина.карасева@example.com', '2005-11-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 36, 'Терентьев', 'Станислав', 'Игоревич', 3, '+79107336205', 'станислав.терентьев@yandex.ru', '1999-06-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 36, 'Садовников', 'Алексей', 'Станиславович', 3, '+79239669907', 'алексей.садовников@example.com', '2003-10-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 36, 'Серова', 'Екатерина', 'Олеговна', 3, '+79555838927', 'екатерина.серова@mail.ru', '2003-10-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 36, 'Филиппов', 'Петр', 'Анатольевич', 4, '+79851161085', 'петр.филиппов@yandex.ru', '2005-07-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 36, 'Гвоздев', 'Максим', 'Игоревич', 4, '+79734463525', 'максим.гвоздев@mail.ru', '2000-11-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (28, 36, 'Кузнецова', 'Вероника', 'Николаевна', 4, '+79091174175', 'вероника.кузнецова@gmail.com', '2000-04-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (29, 36, 'Сергеев', 'Дмитрий', 'Александрович', 4, '+79954019628', 'дмитрий.сергеев@gmail.com', '2003-06-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (27, 36, 'Ларина', 'Юлия', 'Станиславовна', 4, '+79456219763', 'юлия.ларина@mail.ru', '2003-12-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Лебедев', 'Станислав', 'Николаевич', 3, '+79575156787', 'станислав.лебедев@gmail.com', '2003-05-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Левина', 'Вера', 'Петровна', 3, '+79055062677', 'вера.левина@example.com', '2005-11-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Григорьев', 'Игорь', 'Вячеславович', 3, '+79782466191', 'игорь.григорьев@example.com', '2005-05-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Лукин', 'Роман', 'Сергеевич', 3, '+79265588754', 'роман.лукин@gmail.com', '2005-08-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Хорошавина', 'Мария', 'Николаевна', 3, '+79261639175', 'мария.хорошавина@mail.ru', '2001-01-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Белоусов', 'Станислав', 'Александрович', 3, '+79925165551', 'станислав.белоусов@mail.ru', '2002-02-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Филиппова', 'Светлана', 'Олеговна', 3, '+79686911541', 'светлана.филиппова@example.com', '2000-12-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Тихомирова', 'Евгения', 'Игоревна', 3, '+79629546055', 'евгения.тихомирова@mail.ru', '2002-03-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Федосеева', 'Анастасия', 'Станиславовна', 3, '+79658415046', 'анастасия.федосеева@mail.ru', '2002-12-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Семенова', 'Ольга', 'Игоревна', 3, '+79072238838', 'ольга.семенова@yandex.ru', '2002-08-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Дмитриева', 'Евгения', 'Павловна', 3, '+79885679697', 'евгения.дмитриева@yandex.ru', '2002-05-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Яровой', 'Иван', 'Сергеевич', 3, '+79689716860', 'иван.яровой@example.com', '2005-10-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Насырова', 'Светлана', 'Александровна', 3, '+79915308014', 'светлана.насырова@example.com', '1999-04-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Коростелев', 'Павел', 'Игоревич', 3, '+79267696187', 'павел.коростелев@yandex.ru', '2005-05-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Заводов', 'Никита', 'Викторович', 3, '+79359575610', 'никита.заводов@gmail.com', '2001-05-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Сергеев', 'Олег', 'Владимирович', 3, '+79013133667', 'олег.сергеев@example.com', '2000-10-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Бережная', 'Ирина', 'Алексеевна', 3, '+79785330751', 'ирина.бережная@mail.ru', '2002-05-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Смирнов', 'Денис', 'Анатольевич', 3, '+79367478268', 'денис.смирнов@mail.ru', '2002-03-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Литвинова', 'Наталья', 'Игоревна', 3, '+79128762857', 'наталья.литвинова@example.com', '2001-09-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Старостина', 'Виктория', 'Сергеевна', 3, '+79552393350', 'виктория.старостина@yandex.ru', '2001-11-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Терехова', 'Татьяна', 'Юрьевна', 3, '+79815627877', 'татьяна.терехова@yandex.ru', '2000-08-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Беляева', 'Александра', 'Александровна', 3, '+79337359037', 'александра.беляева@yandex.ru', '1999-06-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Бабич', 'Николай', 'Станиславович', 3, '+79016454919', 'николай.бабич@example.com', '1999-03-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Трошина', 'Екатерина', 'Викторовна', 3, '+79571373786', 'екатерина.трошина@yandex.ru', '2001-10-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Панченко', 'Алексей', 'Сергеевич', 3, '+79756103775', 'алексей.панченко@example.com', '1999-05-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Михайлова', 'Дарья', 'Дмитриевна', 3, '+79405970140', 'дарья.михайлова@yandex.ru', '2004-05-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Громова', 'Татьяна', 'Игоревна', 4, '+79163537696', 'татьяна.громова@yandex.ru', '2004-01-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Герасимов', 'Роман', 'Александрович', 4, '+79707841972', 'роман.герасимов@mail.ru', '2002-06-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Власова', 'Евгения', 'Петровна', 4, '+79915501114', 'евгения.власова@mail.ru', '2002-01-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Соловьев', 'Константин', 'Станиславович', 4, '+79382497735', 'константин.соловьев@yandex.ru', '2000-03-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Дмитриева', 'Наталья', 'Юрьевна', 4, '+79496540698', 'наталья.дмитриева@example.com', '2005-10-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Киселев', 'Станислав', 'Алексеевич', 4, '+79824241069', 'станислав.киселев@example.com', '2004-11-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Сорокин', 'Илья', 'Андреевич', 4, '+79178940883', 'илья.сорокин@gmail.com', '2005-10-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Чистяков', 'Андрей', 'Сергеевич', 4, '+79798449971', 'андрей.чистяков@example.com', '2001-05-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Семенова', 'Анастасия', 'Дмитриевна', 4, '+79982176154', 'анастасия.семенова@mail.ru', '2002-08-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Лопатин', 'Виктор', 'Петрович', 4, '+79336190884', 'виктор.лопатин@mail.ru', '1999-01-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Галкин', 'Роман', 'Игоревич', 4, '+79043971267', 'роман.галкин@mail.ru', '2005-02-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Рябинин', 'Сергей', 'Денисович', 4, '+79456147809', 'сергей.рябинин@example.com', '2003-12-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Воробьева', 'Ксения', 'Сергеевна', 4, '+79825078212', 'ксения.воробьева@gmail.com', '2004-01-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Гоголь', 'Александр', 'Станиславович', 4, '+79855897784', 'александр.гоголь@gmail.com', '2005-04-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Медведева', 'Лидия', 'Игоревна', 4, '+79627535829', 'лидия.медведева@mail.ru', '2003-02-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Евдокимов', 'Владимир', 'Петрович', 4, '+79219711816', 'владимир.евдокимов@yandex.ru', '1999-01-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Князева', 'Ольга', 'Николаевна', 4, '+79902608835', 'ольга.князева@mail.ru', '2001-07-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Ким', 'Никита', 'Валерьевич', 4, '+79927250002', 'никита.ким@example.com', '1999-04-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Руденко', 'Григорий', 'Алексеевич', 4, '+79808359898', 'григорий.руденко@yandex.ru', '2001-01-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Климова', 'Евгения', 'Павловна', 4, '+79917335995', 'евгения.климова@gmail.com', '2004-04-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Жукова', 'Кристина', 'Олеговна', 4, '+79399810174', 'кристина.жукова@gmail.com', '2000-02-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Коковин', 'Станислав', 'Игоревич', 4, '+79279786471', 'станислав.коковин@yandex.ru', '2000-03-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Туркевич', 'Сергей', 'Александрович', 4, '+79715348655', 'сергей.туркевич@yandex.ru', '2003-05-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 37, 'Ясинов', 'Леонид', 'Валерьевич', 4, '+79901293640', 'леонид.ясинов@example.com', '2001-06-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 37, 'Суслова', 'Мирослава', 'Дмитриевна', 4, '+79302631333', 'мирослава.суслова@yandex.ru', '2005-07-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Николаев', 'Сергей', 'Вячеславович', 1, '+79081232709', 'сергей.николаев@example.com', '2001-07-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Сухов', 'Олег', 'Игоревич', 1, '+79326957883', 'олег.сухов@example.com', '2002-05-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Алексеев', 'Иван', 'Сергеевич', 1, '+79931537881', 'иван.алексеев@mail.ru', '2000-09-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Рябова', 'Евгения', 'Игоревна', 1, '+79738856818', 'евгения.рябова@gmail.com', '2005-11-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Тимошенко', 'Галина', 'Александровна', 1, '+79816052363', 'галина.тимошенко@yandex.ru', '2000-10-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Глушкова', 'Оксана', 'Николаевна', 1, '+79774686603', 'оксана.глушкова@example.com', '2004-03-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Савельев', 'Дмитрий', 'Андреевич', 1, '+79959899774', 'дмитрий.савельев@gmail.com', '2001-08-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Семенова', 'Светлана', 'Петровна', 1, '+79152761649', 'светлана.семенова@example.com', '1999-11-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Куликов', 'Никита', 'Александрович', 1, '+79511562574', 'никита.куликов@gmail.com', '2001-11-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Ларионов', 'Алексей', 'Станиславович', 1, '+79714723814', 'алексей.ларионов@gmail.com', '2004-08-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Трофимова', 'Маргарита', 'Сергеевна', 1, '+79035537314', 'маргарита.трофимова@gmail.com', '2002-12-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Филиппов', 'Кирилл', 'Владимирович', 1, '+79654551274', 'кирилл.филиппов@example.com', '2001-01-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Суворова', 'Людмила', 'Вячеславовна', 1, '+79379576338', 'людмила.суворова@example.com', '2003-05-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Масленникова', 'Евгения', 'Анатольевна', 1, '+79806845307', 'евгения.масленникова@gmail.com', '2005-09-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Карасев', 'Григорий', 'Петрович', 1, '+79691529640', 'григорий.карасев@gmail.com', '2003-03-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Баранова', 'Наталья', 'Станиславовна', 1, '+79892705735', 'наталья.баранова@gmail.com', '2002-11-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Ткаченко', 'Александр', 'Игоревич', 1, '+79996546846', 'александр.ткаченко@mail.ru', '1999-12-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Левченко', 'Татьяна', 'Олеговна', 1, '+79959579306', 'татьяна.левченко@gmail.com', '2001-04-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Лисицын', 'Степан', 'Андреевич', 1, '+79332666256', 'степан.лисицын@yandex.ru', '2002-06-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Кузнецова', 'Марина', 'Павловна', 1, '+79042874295', 'марина.кузнецова@example.com', '2004-04-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Светлов', 'Данил', 'Игоревич', 1, '+79788816581', 'данил.светлов@mail.ru', '2005-11-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Куликова', 'Анастасия', 'Дмитриевна', 1, '+79977939104', 'анастасия.куликова@yandex.ru', '2003-04-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Зинченко', 'Сергей', 'Николаевич', 1, '+79322057880', 'сергей.зинченко@gmail.com', '1999-01-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Миронова', 'Кристина', 'Сергеевна', 1, '+79014619995', 'кристина.миронова@yandex.ru', '2003-10-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Панфилова', 'Ксения', 'Алексеевна', 1, '+79074503853', 'ксения.панфилова@gmail.com', '2000-11-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Синицина', 'Алина', 'Александровна', 1, '+79794239231', 'алина.синицина@yandex.ru', '2003-08-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Лукьяненко', 'Олег', 'Петрович', 1, '+79272153125', 'олег.лукьяненко@mail.ru', '2003-12-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Громов', 'Владимир', 'Анатольевич', 2, '+79911118953', 'владимир.громов@mail.ru', '2005-03-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Мельников', 'Роман', 'Сергеевич', 2, '+79551709588', 'роман.мельников@example.com', '2001-01-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Шевченко', 'Анатолий', 'Николаевич', 2, '+79399194029', 'анатолий.шевченко@yandex.ru', '2001-03-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Терещенко', 'Геннадий', 'Петрович', 2, '+79309261298', 'геннадий.терещенко@yandex.ru', '2002-08-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Калинов', 'Степан', 'Олегович', 2, '+79192107631', 'степан.калинов@example.com', '2001-03-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Федоров', 'Максим', 'Александрович', 2, '+79571007648', 'максим.федоров@example.com', '2001-04-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Корнеев', 'Дмитрий', 'Викторович', 2, '+79442211229', 'дмитрий.корнеев@yandex.ru', '2002-04-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Фокин', 'Сергей', 'Олегович', 2, '+79207544095', 'сергей.фокин@gmail.com', '2003-08-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Савчук', 'Лилия', 'Дмитриевна', 2, '+79921353672', 'лилия.савчук@mail.ru', '2005-02-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Руденко', 'Евгений', 'Александрович', 2, '+79872648063', 'евгений.руденко@yandex.ru', '2005-04-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Трошина', 'Екатерина', 'Станиславовна', 2, '+79539337642', 'екатерина.трошина@mail.ru', '2002-07-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Костенко', 'Лариса', 'Вячеславовна', 2, '+79798778948', 'лариса.костенко@yandex.ru', '2001-10-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Петухов', 'Виктор', 'Сергеевич', 2, '+79067911819', 'виктор.петухов@gmail.com', '2004-02-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Зуев', 'Александр', 'Андреевич', 2, '+79045291637', 'александр.зуев@mail.ru', '2004-07-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Коваленко', 'Наталья', 'Викторовна', 2, '+79448729714', 'наталья.коваленко@example.com', '2003-02-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Митрофанова', 'Татьяна', 'Игоревна', 2, '+79314217785', 'татьяна.митрофанова@yandex.ru', '2004-08-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Малинин', 'Григорий', 'Денисович', 2, '+79043909136', 'григорий.малинин@yandex.ru', '1999-02-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Шубин', 'Денис', 'Станиславович', 2, '+79983464837', 'денис.шубин@gmail.com', '2003-11-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Пробиренко', 'Роман', 'Сергеевич', 2, '+79806879866', 'роман.пробиренко@mail.ru', '2000-12-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Зайцева', 'Кристина', 'Викторовна', 2, '+79396065570', 'кристина.зайцева@example.com', '2004-11-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Тимофеева', 'Лидия', 'Алексеевна', 2, '+79727437013', 'лидия.тимофеева@gmail.com', '2000-09-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Федосеев', 'Константин', 'Алексеевич', 2, '+79683462964', 'константин.федосеев@yandex.ru', '2004-09-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Соловьев', 'Анатолий', 'Петрович', 2, '+79073842962', 'анатолий.соловьев@mail.ru', '1999-08-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Громова', 'Евгения', 'Александровна', 2, '+79199738445', 'евгения.громова@gmail.com', '1999-03-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 38, 'Григорьев', 'Сергей', 'Станиславович', 2, '+79724255096', 'сергей.григорьев@yandex.ru', '1999-12-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 38, 'Баранова', 'Татьяна', 'Валентиновна', 2, '+79932056549', 'татьяна.баранова@mail.ru', '2004-09-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Бондарь', 'Станислав', 'Денисович', 3, '+79884057932', 'станислав.бондарь@mail.ru', '2004-11-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Тарасов', 'Роман', 'Олегович', 3, '+79686572320', 'роман.тарасов@example.com', '1999-09-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Смирнов', 'Игорь', 'Александрович', 3, '+79876047426', 'игорь.смирнов@example.com', '2000-10-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Григорьева', 'Екатерина', 'Викторовна', 3, '+79662298967', 'екатерина.григорьева@example.com', '2002-07-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Лапин', 'Валентин', 'Николаевич', 3, '+79986837753', 'валентин.лапин@gmail.com', '2002-09-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Кравченко', 'Анастасия', 'Станиславовна', 3, '+79534993032', 'анастасия.кравченко@mail.ru', '2005-07-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Афанасьев', 'Сергей', 'Олегович', 3, '+79308850556', 'сергей.афанасьев@example.com', '2002-04-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Шинкарев', 'Анатолий', 'Петрович', 3, '+79402229196', 'анатолий.шинкарев@example.com', '2000-08-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Королева', 'Ксения', 'Павловна', 3, '+79723030693', 'ксения.королева@gmail.com', '2002-04-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Лавров', 'Станислав', 'Вячеславович', 3, '+79128683932', 'станислав.лавров@gmail.com', '2005-04-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Евдокимов', 'Денис', 'Алексеевич', 3, '+79499301026', 'денис.евдокимов@yandex.ru', '2005-07-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Федосеев', 'Дмитрий', 'Александрович', 3, '+79838480368', 'дмитрий.федосеев@yandex.ru', '2001-05-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Скворцова', 'Татьяна', 'Алексеевна', 3, '+79505255332', 'татьяна.скворцова@example.com', '2001-01-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Смирнова', 'Анастасия', 'Игоревна', 3, '+79668344773', 'анастасия.смирнова@example.com', '2005-09-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Тимофеев', 'Григорий', 'Николаевич', 3, '+79817997824', 'григорий.тимофеев@gmail.com', '2000-06-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Козлов', 'Максим', 'Сергеевич', 3, '+79177992911', 'максим.козлов@mail.ru', '2000-01-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Панфилов', 'Степан', 'Олегович', 3, '+79491118471', 'степан.панфилов@gmail.com', '1999-09-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Филиппова', 'Елена', 'Викторовна', 3, '+79667567021', 'елена.филиппова@example.com', '2000-03-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Шубина', 'Анна', 'Игоревна', 3, '+79581304109', 'анна.шубина@example.com', '2005-01-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Дмитриев', 'Николай', 'Вячеславович', 3, '+79083743074', 'николай.дмитриев@example.com', '1999-12-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Соловьев', 'Николай', 'Александрович', 3, '+79208459243', 'николай.соловьев@example.com', '2004-06-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Власова', 'Кристина', 'Викторовна', 3, '+79994444913', 'кристина.власова@example.com', '1999-03-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Александров', 'Кирилл', 'Дмитриевич', 3, '+79423062086', 'кирилл.александров@yandex.ru', '2002-04-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Мельников', 'Вячеслав', 'Станиславович', 3, '+79897813250', 'вячеслав.мельников@example.com', '2000-03-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Гончарова', 'Анна', 'Игоревна', 3, '+79581581333', 'анна.гончарова@gmail.com', '2000-04-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Шмидт', 'Анатолий', 'Петрович', 3, '+79227888602', 'анатолий.шмидт@gmail.com', '2003-04-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Никифоров', 'Анатолий', 'Денисович', 3, '+79412077339', 'анатолий.никифоров@gmail.com', '1999-08-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Никитина', 'Юлия', 'Сергеевна', 3, '+79017180876', 'юлия.никитина@yandex.ru', '2005-02-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Горшков', 'Константин', 'Денисович', 3, '+79645801349', 'константин.горшков@gmail.com', '2003-07-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Федосеев', 'Дмитрий', 'Алексеевич', 3, '+79164974353', 'дмитрий.федосеев@yandex.ru', '1999-08-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Ковалев', 'Сергей', 'Алексеевич', 3, '+79087979822', 'сергей.ковалев@mail.ru', '2000-11-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Мельникова', 'Татьяна', 'Олеговна', 3, '+79878046678', 'татьяна.мельникова@yandex.ru', '2002-10-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Шаров', 'Алексей', 'Сергеевич', 3, '+79527626983', 'алексей.шаров@mail.ru', '2000-10-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Еремеев', 'Станислав', 'Викторович', 3, '+79291678017', 'станислав.еремеев@yandex.ru', '2000-02-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Заболотный', 'Владимир', 'Вячеславович', 3, '+79296833705', 'владимир.заболотный@gmail.com', '1999-04-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Носков', 'Виктор', 'Станиславович', 3, '+79941733965', 'виктор.носков@gmail.com', '1999-07-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Лебедев', 'Александр', 'Петрович', 4, '+79931511586', 'александр.лебедев@gmail.com', '2003-02-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Соловьева', 'Анастасия', 'Дмитриевна', 4, '+79346286005', 'анастасия.соловьева@example.com', '2000-02-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Федотов', 'Станислав', 'Анатольевич', 4, '+79976281901', 'станислав.федотов@yandex.ru', '2005-01-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Ковальчук', 'Анна', 'Сергеевна', 4, '+79908113962', 'анна.ковальчук@mail.ru', '2002-06-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Заболотный', 'Григорий', 'Иванович', 4, '+79302332586', 'григорий.заболотный@yandex.ru', '2001-05-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Голубев', 'Дмитрий', 'Валерьевич', 4, '+79987918675', 'дмитрий.голубев@gmail.com', '1999-03-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Морозова', 'Ольга', 'Станиславовна', 4, '+79638760233', 'ольга.морозова@gmail.com', '2005-11-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Иванов', 'Виктор', 'Станиславович', 4, '+79744142992', 'виктор.иванов@mail.ru', '2004-07-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Давыдов', 'Роман', 'Сергеевич', 4, '+79852354453', 'роман.давыдов@mail.ru', '2005-11-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Филиппова', 'Наталья', 'Александровна', 4, '+79212704221', 'наталья.филиппова@example.com', '2005-09-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Никитина', 'Светлана', 'Александровна', 4, '+79576197920', 'светлана.никитина@gmail.com', '2001-08-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Смирнов', 'Илья', 'Денисович', 4, '+79206018746', 'илья.смирнов@gmail.com', '2003-03-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Кузнецов', 'Григорий', 'Анатольевич', 4, '+79259435330', 'григорий.кузнецов@mail.ru', '2003-09-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Румянцева', 'Ксения', 'Геннадьевна', 4, '+79823552105', 'ксения.румянцева@example.com', '2003-01-22');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Павлов', 'Алексей', 'Викторович', 4, '+79394126550', 'алексей.павлов@mail.ru', '1999-04-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Костюченко', 'Лариса', 'Ивановна', 4, '+79003959585', 'лариса.костюченко@mail.ru', '2002-03-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Сидоров', 'Анатолий', 'Владимирович', 4, '+79383578421', 'анатолий.сидоров@gmail.com', '2002-12-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Шевченко', 'Евгений', 'Петрович', 4, '+79967448114', 'евгений.шевченко@example.com', '2003-01-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Скоробогатов', 'Александр', 'Николаевич', 4, '+79057934267', 'александр.скоробогатов@yandex.ru', '2003-10-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Терещенко', 'Светлана', 'Анатольевна', 4, '+79635123841', 'светлана.терещенко@example.com', '2002-04-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Трофимов', 'Дмитрий', 'Вячеславович', 4, '+79957560865', 'дмитрий.трофимов@gmail.com', '2002-03-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Ларина', 'Валерия', 'Станиславовна', 4, '+79491680414', 'валерия.ларина@yandex.ru', '2001-05-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Ковалев', 'Александр', 'Викторович', 4, '+79291806646', 'александр.ковалев@example.com', '2000-04-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Егоров', 'Кирилл', 'Александрович', 4, '+79931450881', 'кирилл.егоров@mail.ru', '2005-12-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Семенова', 'Анна', 'Сергеевна', 4, '+79931316482', 'анна.семенова@example.com', '2004-06-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Гончаров', 'Анатолий', 'Игоревич', 4, '+79571694435', 'анатолий.гончаров@mail.ru', '2004-10-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Мельникова', 'Лидия', 'Романовна', 4, '+79414328976', 'лидия.мельникова@gmail.com', '1999-07-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Зайцева', 'Екатерина', 'Петровна', 4, '+79174846275', 'екатерина.зайцева@yandex.ru', '2005-10-07');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Баранов', 'Игорь', 'Алексеевич', 4, '+79768304312', 'игорь.баранов@yandex.ru', '2002-06-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Степанова', 'Анастасия', 'Григорьевна', 4, '+79945994741', 'анастасия.степанова@example.com', '1999-04-28');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Панфилов', 'Роман', 'Станиславович', 4, '+79506747640', 'роман.панфилов@example.com', '2005-08-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Морозов', 'Вячеслав', 'Анатольевич', 4, '+79236446609', 'вячеслав.морозов@mail.ru', '2001-01-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Федосеев', 'Денис', 'Николаевич', 4, '+79913714948', 'денис.федосеев@yandex.ru', '1999-01-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Куликова', 'Марина', 'Анатольевна', 4, '+79385425946', 'марина.куликова@yandex.ru', '2000-07-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Александров', 'Илья', 'Станиславович', 4, '+79502566008', 'илья.александров@gmail.com', '2004-04-17');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (31, 39, 'Гусев', 'Геннадий', 'Денисович', 4, '+79771904330', 'геннадий.гусев@gmail.com', '2002-03-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (30, 39, 'Шмидт', 'Владислав', 'Дмитриевич', 4, '+79533782945', 'владислав.шмидт@example.com', '2003-09-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 40, 'Морозов', 'Денис', 'Анатольевич', 3, '+79133887169', 'денис.морозов@example.com', '2005-02-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 40, 'Смирнов', 'Виктор', 'Дмитриевич', 3, '+79328094209', 'виктор.смирнов@gmail.com', '2001-02-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 40, 'Петров', 'Иван', 'Викторович', 3, '+79589586362', 'иван.петров@example.com', '2000-11-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 40, 'Шевченко', 'Олег', 'Владимирович', 3, '+79141709415', 'олег.шевченко@mail.ru', '2000-09-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 40, 'Гусев', 'Роман', 'Александрович', 3, '+79895535628', 'роман.гусев@example.com', '2003-09-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 40, 'Соколова', 'Анастасия', 'Алексеевна', 3, '+79828973361', 'анастасия.соколова@mail.ru', '1999-08-14');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 40, 'Мельников', 'Станислав', 'Петрович', 3, '+79512546689', 'станислав.мельников@yandex.ru', '2000-05-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 40, 'Лапина', 'Елена', 'Дмитриевна', 3, '+79005577008', 'елена.лапина@gmail.com', '2001-12-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 40, 'Васильев', 'Дмитрий', 'Александрович', 3, '+79818936281', 'дмитрий.васильев@gmail.com', '1999-06-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 40, 'Ким', 'Евгений', 'Анатольевич', 3, '+79437119586', 'евгений.ким@example.com', '2001-11-11');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 40, 'Арутюнян', 'Лев', 'Сергеевич', 3, '+79127334256', 'лев.арутюнян@example.com', '2002-12-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 40, 'Сидорова', 'Екатерина', 'Сергеевна', 3, '+79229292159', 'екатерина.сидорова@mail.ru', '2004-10-20');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 40, 'Шарикова', 'Анастасия', 'Игоревна', 3, '+79166416128', 'анастасия.шарикова@example.com', '2001-04-29');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 40, 'Фролов', 'Никита', 'Сергеевич', 3, '+79493262853', 'никита.фролов@example.com', '2005-02-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 40, 'Родионова', 'Софья', 'Игоревна', 3, '+79848857744', 'софья.родионова@example.com', '2003-03-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 40, 'Харитонов', 'Игорь', 'Алексеевич', 3, '+79772453117', 'игорь.харитонов@yandex.ru', '2005-02-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 40, 'Нестеров', 'Александр', 'Викторович', 4, '+79281869159', 'александр.нестеров@yandex.ru', '1999-10-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 40, 'Григорьев', 'Дмитрий', 'Анатольевич', 4, '+79812267579', 'дмитрий.григорьев@gmail.com', '2003-03-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 40, 'Павлов', 'Игорь', 'Станиславович', 4, '+79477026773', 'игорь.павлов@yandex.ru', '2003-01-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 40, 'Сидорова', 'Татьяна', 'Геннадьевна', 4, '+79273535939', 'татьяна.сидорова@gmail.com', '2003-06-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 40, 'Дудкин', 'Станислав', 'Владимирович', 4, '+79994439496', 'станислав.дудкин@example.com', '2002-04-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 40, 'Ларина', 'Ксения', 'Сергеевна', 4, '+79201973665', 'ксения.ларина@example.com', '2005-11-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 40, 'Краев', 'Антон', 'Олегович', 4, '+79717236300', 'антон.краев@mail.ru', '2004-06-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 40, 'Евдокимова', 'Светлана', 'Юрьевна', 4, '+79135453496', 'светлана.евдокимова@example.com', '2004-02-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 40, 'Мальцева', 'Ирина', 'Валерьевна', 4, '+79692002426', 'ирина.мальцева@gmail.com', '2001-05-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 40, 'Тимофеев', 'Григорий', 'Николаевич', 4, '+79203995303', 'григорий.тимофеев@gmail.com', '2004-10-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 40, 'Куликов', 'Илья', 'Станиславович', 4, '+79565689956', 'илья.куликов@yandex.ru', '2005-10-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 40, 'Иванов', 'Павел', 'Александрович', 4, '+79094722314', 'павел.иванов@mail.ru', '2001-06-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 40, 'Тихонова', 'Анна', 'Дмитриевна', 4, '+79071107585', 'анна.тихонова@mail.ru', '2004-10-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 40, 'Кузьмина', 'Олеся', 'Игоревна', 4, '+79403857017', 'олеся.кузьмина@mail.ru', '1999-06-13');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 40, 'Ковалев', 'Дмитрий', 'Алексеевич', 4, '+79465681461', 'дмитрий.ковалев@gmail.com', '1999-05-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 40, 'Смирнов', 'Алексей', 'Владимирович', 4, '+79285063640', 'алексей.смирнов@yandex.ru', '2002-08-18');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 41, 'Семенова', 'Анна', 'Игоревна', 1, '+79669123825', 'анна.семенова@yandex.ru', '2001-03-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 41, 'Григорьев', 'Павел', 'Анатольевич', 1, '+79741014055', 'павел.григорьев@example.com', '1999-05-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 41, 'Мельникова', 'Екатерина', 'Станиславовна', 1, '+79289908092', 'екатерина.мельникова@yandex.ru', '2001-10-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 41, 'Кузнецов', 'Сергей', 'Александрович', 1, '+79211546395', 'сергей.кузнецов@mail.ru', '1999-04-24');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 41, 'Никитина', 'Светлана', 'Викторовна', 1, '+79934467907', 'светлана.никитина@yandex.ru', '1999-03-09');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 41, 'Тарасова', 'Мария', 'Дмитриевна', 1, '+79161629941', 'мария.тарасова@example.com', '2005-05-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 41, 'Лебедев', 'Алексей', 'Николаевич', 1, '+79606093050', 'алексей.лебедев@gmail.com', '2000-03-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 41, 'Соловьева', 'Варвара', 'Петровна', 1, '+79473908112', 'варвара.соловьева@yandex.ru', '2000-03-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 41, 'Васильев', 'Даниил', 'Максимович', 1, '+79224138627', 'даниил.васильев@yandex.ru', '2002-08-21');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 41, 'Тихонова', 'Ольга', 'Геннадьевна', 1, '+79516831576', 'ольга.тихонова@gmail.com', '1999-04-16');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 41, 'Зайцева', 'Ксения', 'Александровна', 1, '+79858011320', 'ксения.зайцева@yandex.ru', '2003-08-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 41, 'Денисов', 'Илья', 'Сергеевич', 1, '+79083558929', 'илья.денисов@example.com', '2001-05-05');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 41, 'Ковалев', 'Константин', 'Анатольевич', 1, '+79164914883', 'константин.ковалев@gmail.com', '2000-05-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 41, 'Смирнов', 'Артем', 'Дмитриевич', 1, '+79029608970', 'артем.смирнов@example.com', '2000-01-30');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 41, 'Федорова', 'Алина', 'Викторовна', 1, '+79477690771', 'алина.федорова@yandex.ru', '1999-05-19');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 41, 'Петрова', 'Елена', 'Олеговна', 1, '+79702891932', 'елена.петрова@mail.ru', '2002-06-01');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 41, 'Савельев', 'Дмитрий', 'Вячеславович', 2, '+79304861281', 'дмитрий.савельев@example.com', '2001-12-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 41, 'Калинина', 'Татьяна', 'Сергеевна', 2, '+79864663412', 'татьяна.калинина@example.com', '2005-10-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 41, 'Кириллова', 'Вероника', 'Ивановна', 2, '+79235407463', 'вероника.кириллова@example.com', '2002-09-27');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 41, 'Алексеев', 'Денис', 'Александрович', 2, '+79486726525', 'денис.алексеев@gmail.com', '1999-02-04');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 41, 'Громова', 'Полина', 'Николаевна', 2, '+79505846751', 'полина.громова@gmail.com', '1999-05-23');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 41, 'Левин', 'Вадим', 'Станиславович', 2, '+79449060803', 'вадим.левин@yandex.ru', '2001-06-08');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 41, 'Дорофеева', 'Анна', 'Игоревна', 2, '+79304752197', 'анна.дорофеева@yandex.ru', '2003-09-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 41, 'Савина', 'Людмила', 'Владимировна', 2, '+79796594595', 'людмила.савина@mail.ru', '2004-06-10');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 41, 'Филиппов', 'Станислав', 'Михайлович', 2, '+79159009695', 'станислав.филиппов@example.com', '2005-12-25');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 41, 'Рябкова', 'Кристина', 'Дмитриевна', 2, '+79819722898', 'кристина.рябкова@gmail.com', '2000-01-02');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 41, 'Степанов', 'Никита', 'Александрович', 2, '+79637418377', 'никита.степанов@gmail.com', '1999-06-06');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 41, 'Гусев', 'Арсений', 'Валерьевич', 2, '+79804515378', 'арсений.гусев@yandex.ru', '2005-11-26');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 41, 'Боброва', 'Анастасия', 'Романовна', 2, '+79124218774', 'анастасия.боброва@example.com', '2005-03-15');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 41, 'Косарева', 'Елизавета', 'Игоревна', 2, '+79129838578', 'елизавета.косарева@mail.ru', '2005-05-12');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (33, 41, 'Хохлов', 'Евгений', 'Вячеславович', 2, '+79131759901', 'евгений.хохлов@example.com', '2004-06-03');
INSERT INTO student (department_id, course_id, surname, name, patronymic, year, phone_number, email, birth_date) VALUES (32, 41, 'Тихонов', 'Александр', 'Алексеевич', 2, '+79148229006', 'александр.тихонов@example.com', '2003-12-21');

-- Добавление квалификационных работ с уникальными названиями для студентов с year = 3
WITH ranked_professors AS (
    SELECT 
        professor_id, 
        department_id, 
        ROW_NUMBER() OVER (PARTITION BY department_id ORDER BY professor_id) AS rn
    FROM professor
),
ranked_students AS (
    SELECT 
        student_card_id, 
        department_id, 
        ROW_NUMBER() OVER (PARTITION BY department_id ORDER BY student_card_id) AS rn
    FROM student
    WHERE year = 3
)
INSERT INTO qualification_work (student_card_id, supervisor_id, "name", work_type, work_status)
SELECT 
    s.student_card_id, 
    p.professor_id, 
    CONCAT('Квалификационная работа №', s.student_card_id), 
    'course', 
    'in progress'
FROM ranked_students s
JOIN ranked_professors p 
    ON s.department_id = p.department_id AND s.rn = p.rn;

-- Добавление квалификационных работ с уникальными названиями для студентов с year = 4
WITH ranked_professors AS (
    SELECT 
        professor_id, 
        department_id, 
        ROW_NUMBER() OVER (PARTITION BY department_id ORDER BY professor_id) AS rn
    FROM professor
),
ranked_students AS (
    SELECT 
        student_card_id, 
        department_id, 
        ROW_NUMBER() OVER (PARTITION BY department_id ORDER BY student_card_id) AS rn
    FROM student
    WHERE year = 4
)
INSERT INTO qualification_work (student_card_id, supervisor_id, "name", work_type, work_status)
SELECT 
    s.student_card_id, 
    p.professor_id, 
    CONCAT('Квалификационная работа №', s.student_card_id), 
    'diploma', 
    'in progress'
FROM ranked_students s
JOIN ranked_professors p 
    ON s.department_id = p.department_id AND s.rn = p.rn;

-- Добавление квалификационных работ с уникальными названиями для студентов из магистратуры, year = 1
WITH ranked_professors AS (
    SELECT 
        professor_id, 
        department_id, 
        ROW_NUMBER() OVER (PARTITION BY department_id ORDER BY professor_id) AS rn
    FROM professor
),
ranked_students AS (
    SELECT 
        s.student_card_id, 
        s.department_id, 
        ROW_NUMBER() OVER (PARTITION BY s.department_id ORDER BY s.student_card_id) AS rn
    FROM student s JOIN course c
	ON s.course_id = c.course_id
    WHERE c.education_level = 'master' AND s.year = 2
)
INSERT INTO qualification_work (student_card_id, supervisor_id, "name", work_type, work_status)
SELECT 
    s.student_card_id, 
    p.professor_id, 
    CONCAT('Квалификационная работа №', s.student_card_id), 
    'master', 
    'in progress'
FROM ranked_students s
JOIN ranked_professors p 
    ON s.department_id = p.department_id AND s.rn = p.rn;

-- Добавление квалификационных работ с уникальными названиями для студентов из аспирантуры, year = 3-4
WITH ranked_professors AS (
    SELECT 
        professor_id, 
        department_id, 
        ROW_NUMBER() OVER (PARTITION BY department_id ORDER BY professor_id) AS rn
    FROM professor
),
ranked_students AS (
    SELECT 
        s.student_card_id, 
        s.department_id, 
        ROW_NUMBER() OVER (PARTITION BY s.department_id ORDER BY s.student_card_id) AS rn
    FROM student s JOIN course c
	ON s.course_id = c.course_id
    WHERE c.education_level = 'postgraduate' AND s.year = 3 or s.year = 4
)
INSERT INTO qualification_work (student_card_id, supervisor_id, "name", work_type, work_status)
SELECT 
    s.student_card_id, 
    p.professor_id, 
    CONCAT('Квалификационная работа №', s.student_card_id), 
    'master', 
    'in progress'
FROM ranked_students s
JOIN ranked_professors p 
    ON s.department_id = p.department_id AND s.rn = p.rn;