INSERT INTO faculty("name")
VALUES ('Биологии и экологии'),
    ('Информатики и вычислительной техники'),
    ('Исторический'),
    ('Математический'),
    ('Психологии'),
    ('Социально-политических наук'),
    ('Факультет иностранных языков'),
    ('Физический'),
    ('Филологии и коммуникации'),
    ('Экономический'),
    ('Юридический'),
    ('Университетский колледж');

-- Добавляем направления для каждого факультета
INSERT INTO course (faculty_id, "name", education_level)
VALUES
-- Факультет биологии и экологии
(1, 'Биология', 'bachelor'),
(1, 'Экология', 'master'),
(1, 'Биофизика', 'postgraduate'),
(1, 'Микробиология', 'bachelor'),
(1, 'Биохимия', 'master'),

-- Факультет информатики и вычислительной техники
(2, 'Программирование', 'bachelor'),
(2, 'Информационные технологии', 'master'),
(2, 'Искусственный интеллект', 'postgraduate'),
(2, 'Кибербезопасность', 'bachelor'),

-- Исторический факультет
(3, 'История', 'bachelor'),
(3, 'Археология', 'master'),
(3, 'Антропология', 'postgraduate'),
(3, 'Культурология', 'bachelor'),
(3, 'История искусства', 'master'),

-- Математический факультет
(4, 'Математика', 'bachelor'),
(4, 'Прикладная математика', 'master'),
(4, 'Статистика', 'postgraduate'),

-- Факультет психологии
(5, 'Психология', 'bachelor'),
(5, 'Клиническая психология', 'master'),
(5, 'Социальная психология', 'postgraduate'),

-- Факультет социально-политических наук
(6, 'Политология', 'bachelor'),
(6, 'Социология', 'master'),
(6, 'Социальная работа', 'postgraduate'),
(6, 'Экономическая социология', 'bachelor'),

-- Факультет иностранных языков
(7, 'Филология', 'bachelor'),
(7, 'Перевод и переводоведение', 'master'),
(7, 'Лингвистика', 'postgraduate'),

-- Факультет физики
(8, 'Физика', 'bachelor'),
(8, 'Космическая физика', 'master'),
(8, 'Квантовая физика', 'postgraduate'),

-- Факультет филологии и коммуникации
(9, 'Филология', 'bachelor'),
(9, 'Журналистика', 'master'),
(9, 'Коммуникации', 'postgraduate'),

-- Экономический факультет
(10, 'Экономика', 'bachelor'),
(10, 'Финансы', 'master'),
(10, 'Бухгалтерский учет', 'postgraduate'),

-- Юридический факультет
(11, 'Правоведение', 'bachelor'),
(11, 'Уголовное право', 'master'),
(11, 'Гражданское право', 'postgraduate'),

-- Университетский колледж
(12, 'Общее образование', 'bachelor'),
(12, 'Кросс-дисциплинарные исследования', 'master');

UPDATE course
SET education_level = 'bachelor'
WHERE education_level = 'postgraduate';


-- Добавляем кафедры для каждого факультета
INSERT INTO department (faculty_id, "name")
VALUES
-- Факультет биологии и экологии
(1, 'Кафедра биологии'),
(1, 'Кафедра экологии'),
(1, 'Кафедра зоологии'),

-- Факультет информатики и вычислительной техники
(2, 'Кафедра программирования'),
(2, 'Кафедра кибербезопасности'),
(2, 'Кафедра информационных технологий'),

-- Исторический факультет
(3, 'Кафедра истории'),
(3, 'Кафедра археологии'),
(3, 'Кафедра культурологии'),

-- Математический факультет
(4, 'Кафедра математики'),
(4, 'Кафедра прикладной математики'),
(4, 'Кафедра статистики'),

-- Факультет психологии
(5, 'Кафедра психологии'),
(5, 'Кафедра клинической психологии'),
(5, 'Кафедра социальной психологии'),

-- Факультет социально-политических наук
(6, 'Кафедра политологии'),
(6, 'Кафедра социологии'),
(6, 'Кафедра социальной работы'),

-- Факультет иностранных языков
(7, 'Кафедра филологии'),
(7, 'Кафедра лингвистики'),
(7, 'Кафедра перевода'),

-- Факультет физики
(8, 'Кафедра физики'),
(8, 'Кафедра космической физики'),
(8, 'Кафедра квантовой физики'),

-- Факультет филологии и коммуникации
(9, 'Кафедра журналистики'),
(9, 'Кафедра коммуникаций'),

-- Экономический факультет
(10, 'Кафедра экономики'),
(10, 'Кафедра финансов'),
(10, 'Кафедра бухгалтерского учета'),

-- Юридический факультет
(11, 'Кафедра правоведения'),
(11, 'Кафедра уголовного права'),

-- Университетский колледж
(12, 'Кафедра общего образования'),
(12, 'Кафедра кросс-дисциплинарных исследований');

-- Добавляем преподавателей для каждой кафедры
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
-- Кафедра биологии
(1, 'Иванов', 'Иван', 'Иванович'),
(1, 'Петрова', 'Анна', 'Алексеевна'),
(1, 'Коваленко', 'Олег', 'Сергеевич'),

-- Кафедра экологии
(2, 'Сидоренко', 'Михаил', 'Андреевич'),
(2, 'Лебедева', 'Наталья', 'Дмитриевна'),
(2, 'Потапенко', 'Светлана', 'Васильевна'),

-- Кафедра зоологии
(3, 'Мартынов', 'Денис', 'Алексеевич'),
(3, 'Краковецкий', 'Дмитрий', 'Станиславович'),
(3, 'Беляев', 'Александр', 'Игоревич'),

-- Кафедра программирования
(4, 'Грищук', 'Артем', 'Викторович'),
(4, 'Смирнова', 'Елена', 'Николаевна'),
(4, 'Тарасюк', 'Анна', 'Владимировна'),

-- Кафедра кибербезопасности
(5, 'Иванова', 'Оксана', 'Петровна'),
(5, 'Кучеренко', 'Дмитрий', 'Юрьевич'),
(5, 'Савченко', 'Наталья', 'Сергеевна'),

-- Кафедра информационных технологий
(6, 'Баранов', 'Роман', 'Викторович'),
(6, 'Александров', 'Егор', 'Васильевич'),
(6, 'Логинов', 'Сергей', 'Анатольевич'),

-- Кафедра истории
(7, 'Громов', 'Владимир', 'Станиславович'),
(7, 'Лукашенко', 'Ирина', 'Владимировна'),
(7, 'Тихонов', 'Алексей', 'Петрович'),

-- Кафедра археологии
(8, 'Павлов', 'Максим', 'Олегович'),
(8, 'Мелехов', 'Дмитрий', 'Семенович'),

-- Кафедра культурологии
(9, 'Бекетов', 'Анатолий', 'Федорович'),

-- Кафедра математики (с греческим преподавателем)
(10, 'Пападопулос', 'Георгиос', 'Александрович'),
(10, 'Федоров', 'Николай', 'Иванович'),
(10, 'Миронов', 'Антон', 'Сергеевич'),

-- Кафедра прикладной математики
(11, 'Кузнецов', 'Денис', 'Викторович'),
(11, 'Михайлов', 'Игорь', 'Анатольевич'),

-- Кафедра статистики
(12, 'Нечаев', 'Алексей', 'Дмитриевич'),

-- Кафедра психологии
(13, 'Петров', 'Сергей', 'Васильевич'),
(13, 'Козлова', 'Анастасия', 'Петровна'),
(13, 'Гладкова', 'Ольга', 'Николаевна'),

-- Кафедра клинической психологии
(14, 'Соловьев', 'Антон', 'Станиславович'),
(14, 'Харченко', 'Елена', 'Анатольевна'),

-- Кафедра социальной психологии
(15, 'Горбачев', 'Виктор', 'Иванович'),

-- Кафедра политологии
(16, 'Сергеев', 'Максим', 'Дмитриевич'),
(16, 'Шевченко', 'Алексей', 'Игоревич'),
(16, 'Зайцев', 'Игорь', 'Станиславович'),

-- Кафедра социологии
(17, 'Мирошниченко', 'Ольга', 'Алексеевна'),
(17, 'Костенко', 'Светлана', 'Петровна'),

-- Кафедра социальной работы
(18, 'Дьяченко', 'Наталья', 'Станиславовна'),

-- Кафедра филологии
(19, 'Иваненко', 'Андрей', 'Валерьевич'),
(19, 'Котов', 'Денис', 'Олегович'),

-- Кафедра лингвистики
(20, 'Лисицын', 'Евгений', 'Михайлович'),
(20, 'Головко', 'Людмила', 'Владимировна'),

-- Кафедра перевода
(21, 'Шпак', 'Наталья', 'Юрьевна'),

-- Кафедра физики
(22, 'Григорьев', 'Дмитрий', 'Анатольевич'),
(22, 'Соломонов', 'Роман', 'Игоревич'),

-- Кафедра космической физики
(23, 'Ефимов', 'Александр', 'Станиславович'),
(23, 'Лаптев', 'Николай', 'Иванович'),

-- Кафедра квантовой физики
(24, 'Дубровский', 'Виктор', 'Валерьевич'),

-- Кафедра журналистики
(25, 'Снегирев', 'Алексей', 'Станиславович'),
(25, 'Васильева', 'Анна', 'Ивановна'),

-- Кафедра коммуникаций
(26, 'Зайцева', 'Наталья', 'Петровна'),

-- Кафедра экономики
(27, 'Киселев', 'Владимир', 'Дмитриевич'),
(27, 'Семенова', 'Татьяна', 'Николаевна'),

-- Кафедра финансов
(28, 'Федосов', 'Денис', 'Анатольевич'),
(28, 'Иванов', 'Олег', 'Игоревич'),

-- Кафедра бухгалтерского учета
(29, 'Гриценко', 'Людмила', 'Петровна'),

-- Кафедра правоведения
(30, 'Соболев', 'Сергей', 'Алексеевич'),
(30, 'Фомина', 'Елена', 'Викторовна'),

-- Кафедра уголовного права
(31, 'Якубович', 'Александр', 'Станиславович'),

-- Кафедра общего образования
(32, 'Петренко', 'Ирина', 'Николаевна'),
(32, 'Светличный', 'Анатолий', 'Петрович'),

-- Кафедра кросс-дисциплинарных исследований
(33, 'Романов', 'Дмитрий', 'Валерьевич');

UPDATE department
SET department_head_id = 
    CASE department_id
        WHEN 1 THEN (SELECT professor_id FROM professor WHERE department_id = 1 LIMIT 1)  -- Кафедра биологии
        WHEN 2 THEN (SELECT professor_id FROM professor WHERE department_id = 2 LIMIT 1)  -- Кафедра экологии
        WHEN 3 THEN (SELECT professor_id FROM professor WHERE department_id = 3 LIMIT 1)  -- Кафедра зоологии
        WHEN 4 THEN (SELECT professor_id FROM professor WHERE department_id = 4 LIMIT 1)  -- Кафедра программирования
        WHEN 5 THEN (SELECT professor_id FROM professor WHERE department_id = 5 LIMIT 1)  -- Кафедра кибербезопасности
        WHEN 6 THEN (SELECT professor_id FROM professor WHERE department_id = 6 LIMIT 1)  -- Кафедра информационных технологий
        WHEN 7 THEN (SELECT professor_id FROM professor WHERE department_id = 7 LIMIT 1)  -- Кафедра истории
        WHEN 8 THEN (SELECT professor_id FROM professor WHERE department_id = 8 LIMIT 1)  -- Кафедра археологии
        WHEN 9 THEN (SELECT professor_id FROM professor WHERE department_id = 9 LIMIT 1)  -- Кафедра культурологии
        WHEN 10 THEN (SELECT professor_id FROM professor WHERE department_id = 10 LIMIT 1) -- Кафедра математики
        WHEN 11 THEN (SELECT professor_id FROM professor WHERE department_id = 11 LIMIT 1) -- Кафедра прикладной математики
        WHEN 12 THEN (SELECT professor_id FROM professor WHERE department_id = 12 LIMIT 1) -- Кафедра статистики
        WHEN 13 THEN (SELECT professor_id FROM professor WHERE department_id = 13 LIMIT 1) -- Кафедра психологии
        WHEN 14 THEN (SELECT professor_id FROM professor WHERE department_id = 14 LIMIT 1) -- Кафедра клинической психологии
        WHEN 15 THEN (SELECT professor_id FROM professor WHERE department_id = 15 LIMIT 1) -- Кафедра социальной психологии
        WHEN 16 THEN (SELECT professor_id FROM professor WHERE department_id = 16 LIMIT 1) -- Кафедра политологии
        WHEN 17 THEN (SELECT professor_id FROM professor WHERE department_id = 17 LIMIT 1) -- Кафедра социологии
        WHEN 18 THEN (SELECT professor_id FROM professor WHERE department_id = 18 LIMIT 1) -- Кафедра социальной работы
        WHEN 19 THEN (SELECT professor_id FROM professor WHERE department_id = 19 LIMIT 1) -- Кафедра филологии
        WHEN 20 THEN (SELECT professor_id FROM professor WHERE department_id = 20 LIMIT 1) -- Кафедра лингвистики
        WHEN 21 THEN (SELECT professor_id FROM professor WHERE department_id = 21 LIMIT 1) -- Кафедра перевода
        WHEN 22 THEN (SELECT professor_id FROM professor WHERE department_id = 22 LIMIT 1) -- Кафедра физики
        WHEN 23 THEN (SELECT professor_id FROM professor WHERE department_id = 23 LIMIT 1) -- Кафедра космической физики
        WHEN 24 THEN (SELECT professor_id FROM professor WHERE department_id = 24 LIMIT 1) -- Кафедра квантовой физики
        WHEN 25 THEN (SELECT professor_id FROM professor WHERE department_id = 25 LIMIT 1) -- Кафедра журналистики
        WHEN 26 THEN (SELECT professor_id FROM professor WHERE department_id = 26 LIMIT 1) -- Кафедра коммуникаций
        WHEN 27 THEN (SELECT professor_id FROM professor WHERE department_id = 27 LIMIT 1) -- Кафедра экономики
        WHEN 28 THEN (SELECT professor_id FROM professor WHERE department_id = 28 LIMIT 1) -- Кафедра финансов
        WHEN 29 THEN (SELECT professor_id FROM professor WHERE department_id = 29 LIMIT 1) -- Кафедра бухгалтерского учета
        WHEN 30 THEN (SELECT professor_id FROM professor WHERE department_id = 30 LIMIT 1) -- Кафедра правоведения
        WHEN 31 THEN (SELECT professor_id FROM professor WHERE department_id = 31 LIMIT 1) -- Кафедра уголовного права
        WHEN 32 THEN (SELECT professor_id FROM professor WHERE department_id = 32 LIMIT 1) -- Кафедра общего образования
        WHEN 33 THEN (SELECT professor_id FROM professor WHERE department_id = 33 LIMIT 1) -- Кафедра кросс-дисциплинарных исследований
    END;

-- Добавляем преподавателей на кафедры с равномерным распределением от 1 до 4
-- Примерные данные. Вы можете изменить фамилии и имена на свои.
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
-- Кафедра биологии
(1, 'Иванов', 'Иван', 'Иванович'),  -- 1 преподаватель
(1, 'Петров', 'Сергей', 'Петрович'),

-- Кафедра экологии
(2, 'Сидоров', 'Алексей', 'Алексеевич'),  -- 3 преподавателя
(2, 'Семенова', 'Татьяна', 'Ивановна'),
(2, 'Коваленко', 'Олег', 'Сергеевич'),

-- Кафедра зоологии
(3, 'Лебедев', 'Николай', 'Николаевич'),  -- 1 преподаватель

-- Кафедра программирования
(4, 'Грищук', 'Артем', 'Викторович'),  -- 2 преподавателя
(4, 'Смирнова', 'Елена', 'Николаевна'),

-- Кафедра кибербезопасности
(5, 'Тарасюк', 'Анна', 'Владимировна'),  -- 3 преподавателя
(5, 'Иванова', 'Оксана', 'Петровна'),
(5, 'Шевченко', 'Александр', 'Дмитриевич'),

-- Кафедра информационных технологий
(6, 'Баранов', 'Роман', 'Викторович'),  -- 4 преподавателя
(6, 'Александров', 'Егор', 'Васильевич'),
(6, 'Логинов', 'Сергей', 'Анатольевич'),
(6, 'Нечаев', 'Владимир', 'Иванович'),

-- Кафедра истории
(7, 'Громов', 'Владимир', 'Станиславович'),  -- 2 преподавателя
(7, 'Лукашенко', 'Ирина', 'Владимировна'),

-- Кафедра археологии
(8, 'Павлов', 'Максим', 'Олегович'),  -- 1 преподаватель

-- Кафедра культурологии
(9, 'Бекетов', 'Анатолий', 'Федорович'),  -- 3 преподавателя
(9, 'Костенко', 'Светлана', 'Петровна'),
(9, 'Кравченко', 'Наталья', 'Ивановна'),

-- Кафедра математики (с греческим преподавателем)
(10, 'Пападопулос', 'Георгиос', 'Александрович'),  -- 4 преподавателя
(10, 'Федоров', 'Николай', 'Иванович'),
(10, 'Миронов', 'Антон', 'Сергеевич'),
(10, 'Михайлов', 'Петр', 'Анатольевич'),

-- Кафедра прикладной математики
(11, 'Кузнецов', 'Денис', 'Викторович'),  -- 3 преподавателя
(11, 'Михайлов', 'Игорь', 'Анатольевич'),
(11, 'Сидоренко', 'Светлана', 'Дмитриевна'),

-- Кафедра статистики
(12, 'Нечаев', 'Алексей', 'Дмитриевич'),  -- 1 преподаватель

-- Кафедра психологии
(13, 'Петров', 'Сергей', 'Васильевич'),  -- 4 преподавателя
(13, 'Козлова', 'Анастасия', 'Петровна'),
(13, 'Гладкова', 'Ольга', 'Николаевна'),
(13, 'Соловьев', 'Антон', 'Станиславович'),

-- Кафедра клинической психологии
(14, 'Харченко', 'Елена', 'Анатольевна'),  -- 1 преподаватель

-- Кафедра социальной психологии
(15, 'Горбачев', 'Виктор', 'Иванович'),  -- 2 преподавателя
(15, 'Белоусов', 'Сергей', 'Дмитриевич'),

-- Кафедра политологии
(16, 'Сергеев', 'Максим', 'Дмитриевич'),  -- 3 преподавателя
(16, 'Шевченко', 'Алексей', 'Игоревич'),
(16, 'Зайцев', 'Игорь', 'Станиславович'),

-- Кафедра социологии
(17, 'Мирошниченко', 'Ольга', 'Алексеевна'),  -- 2 преподавателя
(17, 'Костенко', 'Светлана', 'Петровна'),

-- Кафедра социальной работы
(18, 'Дьяченко', 'Наталья', 'Станиславовна'),  -- 1 преподаватель

-- Кафедра филологии
(19, 'Иваненко', 'Андрей', 'Валерьевич'),  -- 4 преподавателя
(19, 'Котов', 'Денис', 'Олегович'),
(19, 'Снегирев', 'Алексей', 'Станиславович'),
(19, 'Крылова', 'Мария', 'Петровна'),

-- Кафедра лингвистики
(20, 'Лисицын', 'Евгений', 'Михайлович'),  -- 2 преподавателя
(20, 'Головко', 'Людмила', 'Владимировна'),

-- Кафедра перевода
(21, 'Шпак', 'Наталья', 'Юрьевна'),  -- 3 преподавателя
(21, 'Сорокин', 'Игорь', 'Станиславович'),
(21, 'Громова', 'Анна', 'Дмитриевна'),

-- Кафедра физики
(22, 'Григорьев', 'Дмитрий', 'Анатольевич'),  -- 1 преподаватель

-- Кафедра космической физики
(23, 'Ефимов', 'Александр', 'Станиславович'),  -- 3 преподавателя
(23, 'Лаптев', 'Николай', 'Иванович'),
(23, 'Каштанов', 'Денис', 'Петрович'),

-- Кафедра квантовой физики
(24, 'Дубровский', 'Виктор', 'Валерьевич'),  -- 1 преподаватель

-- Кафедра журналистики
(25, 'Снегирев', 'Алексей', 'Станиславович'),  -- 2 преподавателя
(25, 'Васильева', 'Анна', 'Ивановна'),

-- Кафедра коммуникаций
(26, 'Зайцева', 'Наталья', 'Петровна'),  -- 4 преподавателя
(26, 'Савельева', 'Юлия', 'Анатольевна'),
(26, 'Кутузов', 'Евгений', 'Викторович'),
(26, 'Олейников', 'Тимур', 'Олегович'),

-- Кафедра экономики
(27, 'Киселев', 'Владимир', 'Дмитриевич'),  -- 3 преподавателя
(27, 'Семенова', 'Татьяна', 'Николаевна'),
(27, 'Беспалов', 'Андрей', 'Валерьевич'),

-- Кафедра финансов
(28, 'Федосов', 'Денис', 'Анатольевич'),  -- 2 преподавателя
(28, 'Иванов', 'Олег', 'Игоревич'),

-- Кафедра бухгалтерского учета
(29, 'Гриценко', 'Людмила', 'Петровна'),  -- 1 преподаватель

-- Кафедра правоведения
(30, 'Соболев', 'Сергей', 'Алексеевич'),  -- 4 преподавателя
(30, 'Фомина', 'Елена', 'Викторовна'),
(30, 'Смирнов', 'Игорь', 'Анатольевич'),
(30, 'Гладков', 'Степан', 'Станиславович'),

-- Кафедра уголовного права
(31, 'Якубович', 'Александр', 'Станиславович'),  -- 2 преподавателя
(31, 'Климова', 'Мария', 'Алексеевна'),

-- Кафедра общего образования
(32, 'Петренко', 'Ирина', 'Николаевна'),  -- 1 преподаватель

-- Кафедра кросс-дисциплинарных исследований
(33, 'Романов', 'Дмитрий', 'Валерьевич'),   -- 2 преподавателя
(33, 'Баранов', 'Евгений', 'Алексеевич');

-- Добавляем преподавателей для каждой кафедры
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
-- Кафедра биологии
(1, 'Иванов', 'Иван', 'Иванович'),
(1, 'Петрова', 'Анна', 'Сергеевна'),
(1, 'Сидоров', 'Дмитрий', 'Александрович'),
(1, 'Акимов', 'Олег', 'Анатольевич'),
(1, 'Мухамедов', 'Али', 'Султанович'),

-- Кафедра экологии
(2, 'Ларина', 'Елена', 'Викторовна'),
(2, 'Смирнов', 'Алексей', 'Станиславович'),
(2, 'Тимуров', 'Сергей', 'Юрьевич'),

-- Кафедра зоологии
(3, 'Кузнецов', 'Николай', 'Владимирович'),
(3, 'Старостин', 'Максим', 'Николаевич'),
(3, 'Ашуров', 'Рустам', 'Алиевич'),
(3, 'Турганбаев', 'Досым', 'Касымович'),

-- Кафедра программирования
(4, 'Петров', 'Владимир', 'Иванович'),
(4, 'Григорьева', 'Мария', 'Александровна'),
(4, 'Ковалев', 'Александр', 'Сергеевич'),
(4, 'Сидорова', 'Ольга', 'Вячеславовна'),

-- Кафедра кибербезопасности
(5, 'Набиева', 'Майя', 'Ильгизовна'),
(5, 'Фармаков', 'Станислав', 'Александрович'),

-- Кафедра информационных технологий
(6, 'Денисов', 'Роман', 'Юрьевич'),
(6, 'Герасимова', 'Наталья', 'Станиславовна'),
(6, 'Ибрагимов', 'Рустем', 'Рауфович'),

-- Кафедра истории
(7, 'Белов', 'Артем', 'Сергеевич'),
(7, 'Ермолаев', 'Георгий', 'Анатольевич'),
(7, 'Смирнова', 'Ксения', 'Дмитриевна'),

-- Кафедра археологии
(8, 'Гусев', 'Игорь', 'Сергеевич'),
(8, 'Абдуллаев', 'Нурлан', 'Амангельдиевич'),
(8, 'Павлова', 'Анна', 'Петровна'),

-- Кафедра культурологии
(9, 'Лебедев', 'Степан', 'Валерьевич'),
(9, 'Зайцева', 'Вера', 'Федоровна'),

-- Кафедра математики
(10, 'Головин', 'Илья', 'Александрович'),
(10, 'Дмитриев', 'Станислав', 'Евгеньевич'),
(10, 'Зимина', 'Светлана', 'Михайловна'),

-- Кафедра прикладной математики
(11, 'Савельев', 'Вадим', 'Дмитриевич'),
(11, 'Костина', 'Юлия', 'Алексеевна'),
(11, 'Суханов', 'Денис', 'Геннадьевич'),
(11, 'Левина', 'Мира', 'Фатиховна'),

-- Кафедра статистики
(12, 'Фролов', 'Павел', 'Сергеевич'),
(12, 'Черняев', 'Василий', 'Петрович'),

-- Кафедра психологии
(13, 'Филиппова', 'Людмила', 'Станиславовна'),
(13, 'Романов', 'Григорий', 'Игоревич'),

-- Кафедра клинической психологии
(14, 'Серова', 'Наталья', 'Викторовна'),
(14, 'Егоров', 'Роман', 'Николаевич'),

-- Кафедра социальной психологии
(15, 'Терентьева', 'Ольга', 'Петровна'),

-- Кафедра политологии
(16, 'Васильев', 'Станислав', 'Станиславович'),
(16, 'Молотова', 'Татьяна', 'Владимировна'),

-- Кафедра социологии
(17, 'Богданов', 'Дмитрий', 'Денисович'),
(17, 'Устинова', 'Маргарита', 'Сергеевна'),

-- Кафедра социальной работы
(18, 'Лавров', 'Петр', 'Александрович'),

-- Кафедра филологии
(19, 'Седова', 'Алина', 'Игоревна'),
(19, 'Коновалова', 'Наталья', 'Станиславовна'),

-- Кафедра лингвистики
(20, 'Сергеева', 'Татьяна', 'Филипповна'),
(20, 'Морозов', 'Николай', 'Вячеславович'),

-- Кафедра перевода
(21, 'Коваль', 'Ирина', 'Юрьевна'),

-- Кафедра физики
(22, 'Соловьев', 'Александр', 'Игоревич'),
(22, 'Барышева', 'Елизавета', 'Станиславовна'),

-- Кафедра космической физики
(23, 'Тихонов', 'Виктор', 'Сергеевич'),
(23, 'Маслова', 'Оксана', 'Владимировна'),

-- Кафедра квантовой физики
(24, 'Кравцов', 'Егор', 'Валерьевич'),
(24, 'Фомина', 'Мария', 'Александровна'),

-- Кафедра журналистики
(25, 'Терешкова', 'Юлия', 'Николаевна'),
(25, 'Галковский', 'Роман', 'Олегович'),

-- Кафедра коммуникаций
(26, 'Малюгина', 'Нина', 'Станиславовна'),

-- Кафедра экономики
(27, 'Забродин', 'Виктор', 'Семенович'),
(27, 'Яковлева', 'Ольга', 'Николаевна'),

-- Кафедра финансов
(28, 'Торопова', 'Анастасия', 'Дмитриевна'),
(28, 'Шевченко', 'Антон', 'Алексеевич'),

-- Кафедра бухгалтерского учета
(29, 'Соколов', 'Анатолий', 'Сергеевич'),

-- Кафедра правоведения
(30, 'Федосов', 'Кирилл', 'Дмитриевич'),
(30, 'Масленникова', 'Алина', 'Романовна'),

-- Кафедра уголовного права
(31, 'Ефремов', 'Денис', 'Станиславович'),
(31, 'Сергеев', 'Григорий', 'Петрович'),

-- Кафедра общего образования
(32, 'Гусева', 'Светлана', 'Юрьевна'),
(32, 'Костенко', 'Алексей', 'Владимирович'),

-- Кафедра кросс-дисциплинарных исследований
(33, 'Павленко', 'Роман', 'Дмитриевич');

-- Добавляем по одному преподавателю на разные кафедры
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
-- Кафедра экологии (Беларусь)
(2, 'Ковалёв', 'Александр', 'Викторович'),  -- Беларусская фамилия

-- Кафедра психологии (Украина)
(5, 'Шевченко', 'Оксана', 'Андреевна'),     -- Украинская фамилия

-- Кафедра истории (Германия)
(7, 'Мюллер', 'Кристиан', 'Фридрихович'),   -- Немецкая фамилия

-- Кафедра программирования (Китай)
(4, 'Ли', 'Вэй', 'Чжун'),                     -- Китайская фамилия

-- Кафедра финансов (Турция)
(10, 'Ялчин', 'Али', 'Мехметович');          -- Турецкая фамилия

-- Кафедра биологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(1, 'Сидоров', 'Иван', 'Александрович'),
(1, 'Петров', 'Мария', 'Сергеевна'),
(1, 'Тихонов', 'Сергей', 'Дмитриевич'),
(1, 'Григорьева', 'Ольга', 'Ивановна'),
(1, 'Дьяков', 'Алексей', 'Владимирович'),
(1, 'Ширяев', 'Николай', 'Михайлович'),
(1, 'Кузнецова', 'Екатерина', 'Станиславовна'),
(1, 'Федоров', 'Виктор', 'Романович');

-- Кафедра экологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(2, 'Ковалёв', 'Александр', 'Викторович'),
(2, 'Зайцева', 'Анна', 'Петровна'),
(2, 'Голубев', 'Денис', 'Игоревич'),
(2, 'Соловьёв', 'Елена', 'Викторовна'),
(2, 'Николаев', 'Станислав', 'Денисович'),
(2, 'Семенова', 'Ирина', 'Сергеевна');

-- Кафедра зоологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(3, 'Мартынов', 'Вадим', 'Петрович'),
(3, 'Шевченко', 'Анастасия', 'Дмитриевна'),
(3, 'Рябов', 'Максим', 'Александрович'),
(3, 'Евдокимова', 'Юлия', 'Сергеевна'),
(3, 'Еремин', 'Дмитрий', 'Валерьевич'),
(3, 'Артемова', 'Татьяна', 'Игоревна'),
(3, 'Котов', 'Игорь', 'Анатольевич');

-- Кафедра программирования
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(4, 'Иванов', 'Петр', 'Андреевич'),
(4, 'Ли', 'Вэй', 'Чжун'),                      -- Китайская фамилия
(4, 'Петров', 'Дмитрий', 'Сергеевич'),
(4, 'Мартынова', 'Светлана', 'Николаевна'),
(4, 'Коваль', 'Ярослав', 'Игоревич'),
(4, 'Мишина', 'Тамара', 'Вячеславовна'),
(4, 'Соловьёв', 'Георгий', 'Анатольевич');

-- Кафедра кибербезопасности
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(5, 'Суровцев', 'Анатолий', 'Петрович'),
(5, 'Гончарова', 'Людмила', 'Станиславовна'),
(5, 'Мюллер', 'Кристиан', 'Фридрихович'),   -- Немецкая фамилия
(5, 'Тимошенко', 'Алексей', 'Валерьевич'),
(5, 'Фролова', 'Светлана', 'Александровна');

-- Кафедра информационных технологий
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(6, 'Григорьев', 'Александр', 'Вячеславович'),
(6, 'Калинина', 'Надежда', 'Сергеевна'),
(6, 'Ширяев', 'Дмитрий', 'Александрович'),
(6, 'Львов', 'Станислав', 'Игоревич'),
(6, 'Никитина', 'Юлия', 'Анатольевна'),
(6, 'Громова', 'Елена', 'Владимировна'),
(6, 'Захаров', 'Артем', 'Николаевич'),
(6, 'Иванов', 'Максим', 'Дмитриевич');

-- Кафедра истории
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(7, 'Сидорова', 'Анна', 'Владимировна'),
(7, 'Тихомиров', 'Сергей', 'Александрович'),
(7, 'Мухина', 'Татьяна', 'Игоревна'),
(7, 'Штанько', 'Николай', 'Петрович'),
(7, 'Ковалев', 'Александр', 'Романович'),
(7, 'Сергеева', 'Дарья', 'Денисовна');

-- Кафедра культурологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(8, 'Козлов', 'Максим', 'Александрович'),
(8, 'Гуляев', 'Виктор', 'Викторович'),
(8, 'Алексеева', 'Ольга', 'Викторовна'),
(8, 'Галиева', 'Лилия', 'Альфировна'),
(8, 'Ковалёв', 'Мирослав', 'Олегович'),
(8, 'Шевчук', 'Светлана', 'Анатольевна');

-- Кафедра психологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(9, 'Семенов', 'Андрей', 'Викторович'),
(9, 'Золотарева', 'Лариса', 'Станиславовна'),
(9, 'Кулешова', 'Светлана', 'Александровна'),
(9, 'Якубов', 'Алексей', 'Дмитриевич'),
(9, 'Романов', 'Денис', 'Романович'),
(9, 'Соломонова', 'Галина', 'Степановна'),
(9, 'Стариков', 'Игорь', 'Николаевич');

-- Кафедра клинической психологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(10, 'Шубина', 'Алина', 'Игоревна'),
(10, 'Воронова', 'Анастасия', 'Сергеевна'),
(10, 'Якимов', 'Сергей', 'Анатольевич'),
(10, 'Горбачёв', 'Илья', 'Валерьевич'),
(10, 'Руденко', 'Евгений', 'Геннадьевич'),
(10, 'Лебедев', 'Станислав', 'Александрович');

-- Кафедра социальной психологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(11, 'Фомичев', 'Антон', 'Владимирович'),
(11, 'Якубова', 'Ксения', 'Романовна'),
(11, 'Варламова', 'Ольга', 'Сергеевна'),
(11, 'Головкин', 'Игорь', 'Алексеевич'),
(11, 'Кириллова', 'Татьяна', 'Дмитриевна'),
(11, 'Афанасьев', 'Дмитрий', 'Викторович');

-- Кафедра политологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(12, 'Светлов', 'Павел', 'Вячеславович'),
(12, 'Пушкина', 'Олеся', 'Степановна'),
(12, 'Смирнов', 'Станислав', 'Анатольевич'),
(12, 'Егоров', 'Дмитрий', 'Игоревич'),
(12, 'Семенов', 'Леонид', 'Петрович'),
(12, 'Федорова', 'Екатерина', 'Геннадьевна');

-- Кафедра социологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(13, 'Ларина', 'Анастасия', 'Викторовна'),
(13, 'Беляев', 'Владимир', 'Станиславович'),
(13, 'Харченко', 'Елена', 'Александровна'),
(13, 'Глазунов', 'Роман', 'Анатольевич'),
(13, 'Терехова', 'Нина', 'Валерьевна'),
(13, 'Жуков', 'Григорий', 'Алексеевич');

-- Кафедра социальной работы
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(14, 'Соловьев', 'Денис', 'Анатольевич'),
(14, 'Богданова', 'Евгения', 'Викторовна'),
(14, 'Маликов', 'Степан', 'Валерьевич'),
(14, 'Бакумов', 'Роман', 'Станиславович'),
(14, 'Васильева', 'Екатерина', 'Алексеевна'),
(14, 'Дмитриев', 'Георгий', 'Николаевич');

-- Кафедра филологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(15, 'Лебедева', 'Наталья', 'Ивановна'),
(15, 'Дорошенко', 'Алексей', 'Дмитриевич'),
(15, 'Крамаренко', 'Евгения', 'Владимировна'),
(15, 'Станиславская', 'Татьяна', 'Алексеевна'),
(15, 'Филатов', 'Станислав', 'Сергеевич'),
(15, 'Ямамото', 'Сатоси', 'Хирошиевич');  -- Японская фамилия

-- Кафедра лингвистики
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(16, 'Михайлов', 'Андрей', 'Викторович'),
(16, 'Тихонова', 'Наталья', 'Станиславовна'),
(16, 'Шубин', 'Станислав', 'Геннадьевич'),
(16, 'Дуров', 'Геннадий', 'Игоревич'),
(16, 'Солдатов', 'Анатолий', 'Петрович');

-- Кафедра перевода
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(17, 'Громов', 'Григорий', 'Петрович'),
(17, 'Трошина', 'Вера', 'Александровна'),
(17, 'Иванов', 'Сергей', 'Анатольевич'),
(17, 'Фролов', 'Денис', 'Игоревич'),
(17, 'Чуркин', 'Николай', 'Анатольевич');

-- Кафедра физики
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(18, 'Смирнов', 'Иван', 'Анатольевич'),
(18, 'Сазонов', 'Андрей', 'Станиславович'),
(18, 'Непомнящий', 'Виктор', 'Владимирович'),
(18, 'Терещенко', 'Светлана', 'Дмитриевна'),
(18, 'Зайцева', 'Мария', 'Игоревна'),
(18, 'Кириллова', 'Олеся', 'Денисовна'),
(18, 'Прокофьева', 'Татьяна', 'Алексеевна');

-- Кафедра космической физики
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(19, 'Лебедев', 'Николай', 'Сергеевич'),
(19, 'Степанова', 'Наталья', 'Анатольевна'),
(19, 'Денисов', 'Станислав', 'Игоревич'),
(19, 'Федоров', 'Владимир', 'Петрович'),
(19, 'Александров', 'Михаил', 'Дмитриевич');

-- Кафедра квантовой физики
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(20, 'Васильев', 'Кирилл', 'Алексеевич'),
(20, 'Мельников', 'Павел', 'Дмитриевич'),
(20, 'Федотов', 'Николай', 'Александрович'),
(20, 'Мурзин', 'Сергей', 'Петрович'),
(20, 'Григорьев', 'Олег', 'Станиславович'),
(20, 'Афанасьев', 'Тимур', 'Викторович');

-- Кафедра журналистики
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(21, 'Королёв', 'Денис', 'Игоревич'),
(21, 'Сидорова', 'Екатерина', 'Александровна'),
(21, 'Тепляков', 'Станислав', 'Сергеевич'),
(21, 'Шумкова', 'Татьяна', 'Николаевна'),
(21, 'Демидова', 'Дарья', 'Алексеевна');

-- Кафедра коммуникаций
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(22, 'Голубев', 'Антон', 'Валерьевич'),
(22, 'Воробьев', 'Григорий', 'Алексеевич'),
(22, 'Гришина', 'Алина', 'Александровна'),
(22, 'Митрофанова', 'Елизавета', 'Викторовна'),
(22, 'Захарова', 'Анастасия', 'Станиславовна');

-- Кафедра общего образования
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(23, 'Селезнёв', 'Владимир', 'Петрович'),
(23, 'Калинин', 'Николай', 'Иванович'),
(23, 'Лисовский', 'Дмитрий', 'Сергеевич'),
(23, 'Громова', 'Елена', 'Александровна'),
(23, 'Тихомиров', 'Станислав', 'Денисович'),
(23, 'Семенова', 'Анна', 'Александровна'),
(23, 'Морозов', 'Игорь', 'Владимирович');

-- Кафедра кросс-дисциплинарных исследований
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(24, 'Дьячков', 'Анатолий', 'Николаевич'),
(24, 'Кузьмина', 'Мария', 'Александровна'),
(24, 'Савченко', 'Денис', 'Станиславович'),
(24, 'Никитина', 'Евгения', 'Геннадьевна'),
(24, 'Терехов', 'Игорь', 'Александрович'),
(24, 'Сидорова', 'Виктория', 'Игоревна');

-- Кафедра религиоведения
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(25, 'Ермакова', 'Светлана', 'Алексеевна'),
(25, 'Хомяков', 'Степан', 'Николаевич'),
(25, 'Губарева', 'Дарья', 'Викторовна'),
(25, 'Панфилова', 'Людмила', 'Геннадьевна'),
(25, 'Кочетков', 'Анатолий', 'Дмитриевич'),
(25, 'Шевченко', 'Оксана', 'Игоревна');

-- Кафедра культурологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(26, 'Бояркин', 'Андрей', 'Викторович'),
(26, 'Смирнова', 'Ксения', 'Владимировна'),
(26, 'Волков', 'Илья', 'Петрович'),
(26, 'Алексеева', 'Марина', 'Дмитриевна'),
(26, 'Шереметев', 'Георгий', 'Анатольевич'),
(26, 'Зотов', 'Лев', 'Сергеевич');

-- Кафедра философии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(27, 'Кириллов', 'Станислав', 'Романович'),
(27, 'Калинина', 'Елизавета', 'Станиславовна'),
(27, 'Сидоров', 'Евгений', 'Валерьевич'),
(27, 'Степанова', 'Надежда', 'Викторовна'),
(27, 'Петров', 'Григорий', 'Михайлович'),
(27, 'Лебедева', 'Анастасия', 'Дмитриевна');

-- Кафедра социальной работы
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(28, 'Логинов', 'Роман', 'Алексеевич'),
(28, 'Афанасьева', 'Татьяна', 'Ивановна'),
(28, 'Сапожников', 'Денис', 'Николаевич'),
(28, 'Фролова', 'Галина', 'Сергеевна'),
(28, 'Яковлев', 'Павел', 'Станиславович'),
(28, 'Климова', 'Светлана', 'Алексеевна');

-- Кафедра социальных наук
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(29, 'Виноградова', 'Инна', 'Дмитриевна'),
(29, 'Доронин', 'Максим', 'Анатольевич'),
(29, 'Захарова', 'Олеся', 'Станиславовна'),
(29, 'Кутузова', 'Лариса', 'Петровна'),
(29, 'Коваль', 'Олег', 'Игоревич'),
(29, 'Воронцова', 'Наталья', 'Викторовна');

-- Кафедра истории искусств
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(30, 'Сухов', 'Геннадий', 'Александрович'),
(30, 'Гребнев', 'Станислав', 'Николаевич'),
(30, 'Панков', 'Дмитрий', 'Сергеевич'),
(30, 'Левин', 'Алексей', 'Романович'),
(30, 'Титова', 'Татьяна', 'Ивановна'),
(30, 'Ефремова', 'Алиса', 'Денисовна');

-- Кафедра педагогики
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(31, 'Мартынов', 'Станислав', 'Игоревич'),
(31, 'Фёдоров', 'Николай', 'Владимирович'),
(31, 'Шатохин', 'Игорь', 'Александрович'),
(31, 'Киселёв', 'Денис', 'Игоревич'),
(31, 'Бакшеев', 'Сергей', 'Игоревич'),
(31, 'Борисова', 'Анна', 'Вячеславовна');

-- Кафедра экологии
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(32, 'Морозова', 'Светлана', 'Геннадьевна'),
(32, 'Денисенко', 'Анна', 'Игоревна'),
(32, 'Тетерина', 'Кристина', 'Станиславовна'),
(32, 'Скворцов', 'Анатолий', 'Викторович'),
(32, 'Воробьёв', 'Сергей', 'Михайлович'),
(32, 'Демиденко', 'Светлана', 'Алексеевна');

-- Кафедра ботаники
INSERT INTO professor (department_id, surname, "name", patronymic)
VALUES
(33, 'Сидоренко', 'Николай', 'Дмитриевич'),
(33, 'Говорова', 'Елена', 'Сергеевна'),
(33, 'Лукьянов', 'Станислав', 'Анатольевич'),
(33, 'Петрова', 'Татьяна', 'Алексеевна'),
(33, 'Тимофеев', 'Дмитрий', 'Станиславович'),
(33, 'Федосеева', 'Людмила', 'Игоревна');


-- Вставка студентов для направления 'Биология' (bachelor)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 1, 'Иванов', 'Иван', 'Иванович', 1),
(NULL, 1, 'Петров', 'Петр', 'Петрович', 2),
(NULL, 1, 'Сидоров', 'Сидор', 'Сидорович', 1),
(2, 1, 'Громов', 'Алексей', 'Алексеевич', 3),
(2, 1, 'Белов', 'Николай', 'Николаевич', 4),
(1, 1, 'Васильев', 'Дмитрий', 'Дмитриевич', 3),
(1, 1, 'Кузнецов', 'Антон', 'Антонович', 4),
(3, 1, 'Лебедев', 'Александр', 'Александрович', 3),
(NULL, 1, 'Алексеев', 'Иван', 'Иванович', 1),
(NULL, 1, 'Дмитриев', 'Александр', 'Александрович', 1),
(NULL, 1, 'Фролова', 'Елена', 'Ивановна', 2),
(NULL, 1, 'Борисова', 'Мария', 'Николаевна', 2),
(2, 1, 'Захаров', 'Станислав', 'Станиславович', 3),
(1, 1, 'Шевченко', 'Николай', 'Николаевич', 3),
(1, 1, 'Петров', 'Денис', 'Денисович', 4),
(3, 1, 'Сидорова', 'Татьяна', 'Викторовна', 4),
(NULL, 1, 'Иванов', 'Алексей', 'Иванович', 1),
(NULL, 1, 'Петров', 'Сергей', 'Сергеевич', 1),
(NULL, 1, 'Сидорова', 'Анна', 'Викторовна', 2),
(NULL, 1, 'Кузнецова', 'Мария', 'Александровна', 2),
(3, 1, 'Смирнов', 'Дмитрий', 'Дмитриевич', 3),
(3, 1, 'Лебедев', 'Егор', 'Егорович', 3),
(3, 1, 'Тихомиров', 'Станислав', 'Станиславович', 4),
(1, 1, 'Баранов', 'Денис', 'Денисович', 4),
(NULL, 1, 'Орлов', 'Анатолий', 'Анатольевич', 1),
(NULL, 1, 'Дроздова', 'Ксения', 'Станиславовна', 1),
(NULL, 1, 'Ковалев', 'Игорь', 'Игоревич', 1),
(NULL, 1, 'Захарова', 'Елизавета', 'Алексеевна', 1),
(NULL, 1, 'Федорова', 'Татьяна', 'Викторовна', 1),
(NULL, 1, 'Панова', 'Екатерина', 'Андреевна', 1),
(NULL, 1, 'Николаев', 'Станислав', 'Станиславович', 2),
(NULL, 1, 'Громова', 'Вероника', 'Сергеевна', 2),
(NULL, 1, 'Белов', 'Илья', 'Ильич', 2),
(NULL, 1, 'Федотова', 'Надежда', 'Александровна', 2),
(NULL, 1, 'Лещенко', 'Дмитрий', 'Владимирович', 2),
(NULL, 1, 'Зинченко', 'Александра', 'Николаевна', 2),
(1, 1, 'Климов', 'Алексей', 'Алексеевич', 3),
(2, 1, 'Васильева', 'Ольга', 'Сергеевна', 3),
(3, 1, 'Астапенко', 'Тимофей', 'Тимофеевич', 3),
(3, 1, 'Ярославцева', 'Анастасия', 'Ивановна', 3),
(3, 1, 'Капустин', 'Денис', 'Денисович', 3),
(1, 1, 'Галкин', 'Михаил', 'Михайлович', 3),
(3, 1, 'Петрова', 'Екатерина', 'Дмитриевна', 4),
(1, 1, 'Михайлов', 'Александр', 'Александрович', 4),
(2, 1, 'Суворов', 'Даниил', 'Даниилович', 4),
(2, 1, 'Григорьева', 'Полина', 'Станиславовна', 4),
(3, 1, 'Ларин', 'Роман', 'Романович', 4),
(1, 1, 'Кошелева', 'Татьяна', 'Сергеевна', 4);


-- Вставка студентов для направления 'Экология' (master)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(1, 2, 'Смирнов', 'Андрей', 'Алексеевич', 1),
(1, 2, 'Петров', 'Евгений', 'Алексеевич', 1),
(1, 2, 'Кузнецова', 'Мария', 'Игоревна', 1),
(1, 2, 'Тихомиров', 'Станислав', 'Станиславович', 1),
(1, 2, 'Громова', 'Анастасия', 'Владимировна', 1),
(3, 2, 'Шмидт', 'Татьяна', 'Григорьевна', 1),
(3, 2, 'Орлов', 'Игорь', 'Михайлович', 1),
(3, 2, 'Дубровин', 'Владимир', 'Сергеевич', 1),
(3, 2, 'Зайцев', 'Алексей', 'Валерьевич', 1),
(3, 2, 'Ковальчук', 'Анна', 'Станиславовна', 1),
(2, 2, 'Романов', 'Денис', 'Сергеевич', 1),
(2, 2, 'Ларин', 'Егор', 'Николаевич', 1),
(1, 2, 'Сидорова', 'Виктория', 'Александровна', 2),
(1, 2, 'Петров', 'Дмитрий', 'Владимирович', 2),
(1, 2, 'Александров', 'Константин', 'Станиславович', 2),
(2, 2, 'Федорова', 'Елизавета', 'Анатольевна', 2),
(2, 2, 'Зайцева', 'Светлана', 'Григорьевна', 2),
(2, 2, 'Герасимов', 'Роман', 'Иванович', 2),
(2, 2, 'Ковалев', 'Денис', 'Петрович', 2),
(2, 2, 'Савельев', 'Артем', 'Николаевич', 2),
(2, 2, 'Беляев', 'Илья', 'Михайлович', 2),
(3, 2, 'Лебедева', 'Алина', 'Викторовна', 2),
(3, 2, 'Никитина', 'Дарья', 'Ивановна', 2),
(3, 2, 'Шевченко', 'Оксана', 'Анатольевна', 2);


-- Вставка студентов для направления 'Биофизика' (bachelor)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 3, 'Анисимов', 'Дмитрий', 'Анатольевич', 1),
(NULL, 3, 'Савельева', 'Татьяна', 'Сергеевна', 1),
(NULL, 3, 'Морозов', 'Иван', 'Викторович', 1),
(NULL, 3, 'Данилов', 'Александр', 'Александрович', 1),
(NULL, 3, 'Кириллова', 'Елена', 'Ивановна', 1),
(NULL, 3, 'Кузнецова', 'Анна', 'Анатольевна', 1),
(NULL, 3, 'Григорьев', 'Максим', 'Олегович', 1),
(NULL, 3, 'Волкова', 'Ирина', 'Валерьевна', 1),
(NULL, 3, 'Смирнов', 'Роман', 'Станиславович', 1),
(NULL, 3, 'Селиванов', 'Андрей', 'Андреевич', 1),
(NULL, 3, 'Лебедев', 'Анатолий', 'Дмитриевич', 1),
(NULL, 3, 'Тимофеев', 'Василий', 'Васильевич', 1),
(NULL, 3, 'Трофимова', 'Надежда', 'Петровна', 1),
(NULL, 3, 'Филиппова', 'Ольга', 'Александровна', 1),
(NULL, 3, 'Ковалев', 'Сергей', 'Николаевич', 2),
(NULL, 3, 'Завьялов', 'Игорь', 'Викторович', 2),
(NULL, 3, 'Маликова', 'Евгения', 'Сергеевна', 2),
(NULL, 3, 'Гусев', 'Александр', 'Станиславович', 2),
(NULL, 3, 'Федотова', 'Светлана', 'Ивановна', 2),
(NULL, 3, 'Зубова', 'Валентина', 'Григорьевна', 2),
(NULL, 3, 'Иванова', 'Нина', 'Николаевна', 2),
(NULL, 3, 'Королева', 'Татьяна', 'Денисовна', 2),
(NULL, 3, 'Сосновский', 'Николай', 'Иванович', 2),
(NULL, 3, 'Бурмистрова', 'Мария', 'Александровна', 2),
(NULL, 3, 'Ткаченко', 'Кирилл', 'Анатольевич', 2),
(NULL, 3, 'Демидова', 'Елена', 'Станиславовна', 2),
(NULL, 3, 'Широков', 'Илья', 'Викторович', 2),
(NULL, 3, 'Николаева', 'Елена', 'Ивановна', 2),
(1, 3, 'Тимошенко', 'Екатерина', 'Сергеевна', 3),
(2, 3, 'Чекунов', 'Степан', 'Иванович', 3),
(3, 3, 'Благовещенский', 'Григорий', 'Сергеевич', 3),
(3, 3, 'Давыдова', 'Марина', 'Олеговна', 3),
(2, 3, 'Борисова', 'Татьяна', 'Петровна', 3),
(1, 3, 'Сергеев', 'Анатолий', 'Николаевич', 3),
(3, 3, 'Ермаков', 'Артем', 'Александрович', 3),
(3, 3, 'Каштанова', 'Вероника', 'Романовна', 3),
(1, 3, 'Шульгин', 'Никита', 'Иванович', 3),
(2, 3, 'Костина', 'Юлия', 'Денисовна', 3),
(3, 3, 'Рябов', 'Петр', 'Григорьевич', 3),
(2, 3, 'Глушкова', 'Светлана', 'Станиславовна', 3),
(1, 3, 'Широков', 'Александр', 'Михайлович', 3),
(1, 3, 'Платонов', 'Василий', 'Сергеевич', 3),
(3, 3, 'Калинин', 'Виктор', 'Петрович', 4),
(1, 3, 'Гончарова', 'Евгения', 'Алексеевна', 4),
(1, 3, 'Ищенко', 'Семен', 'Игоревич', 4),
(2, 3, 'Зимина', 'Екатерина', 'Николаевна', 4),
(3, 3, 'Ковалев', 'Алексей', 'Сергеевич', 4),
(2, 3, 'Лавров', 'Анатолий', 'Дмитриевич', 4),
(2, 3, 'Куликова', 'Лилия', 'Николаевна', 4),
(2, 3, 'Павлов', 'Станислав', 'Иванович', 4),
(1, 3, 'Лепешков', 'Дмитрий', 'Сергеевич', 4),
(2, 3, 'Соболев', 'Андрей', 'Николаевич', 4),
(1, 3, 'Забелин', 'Петр', 'Станиславович', 4),
(2, 3, 'Лебедев', 'Георгий', 'Александрович', 4),
(1, 3, 'Мельников', 'Роман', 'Денисович', 4),
(3, 3, 'Чистякова', 'Оксана', 'Петровна', 4);


-- Вставка студентов для направления 'Микробиология' (bachelor)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 4, 'Федотов', 'Александр', 'Станиславович', 1),
(NULL, 4, 'Сидорова', 'Ольга', 'Дмитриевна', 1),
(NULL, 4, 'Тихонов', 'Анатолий', 'Иванович', 1),
(NULL, 4, 'Кузнецова', 'Татьяна', 'Сергеевна', 1),
(NULL, 4, 'Морозова', 'Елена', 'Александровна', 1),
(NULL, 4, 'Смирнов', 'Денис', 'Петрович', 1),
(NULL, 4, 'Лебедев', 'Виктор', 'Геннадиевич', 1),
(NULL, 4, 'Куликова', 'Наталья', 'Петровна', 1),
(NULL, 4, 'Демидова', 'Елизавета', 'Валерьевна', 1),
(NULL, 4, 'Савельев', 'Кирилл', 'Алексеевич', 1),
(NULL, 4, 'Григорьева', 'Анна', 'Игоревна', 1),
(NULL, 4, 'Чистякова', 'Светлана', 'Михайловна', 1),
(NULL, 4, 'Анисимова', 'Ксения', 'Сергеевна', 2),
(NULL, 4, 'Федорова', 'Галина', 'Степановна', 2),
(NULL, 4, 'Калинин', 'Никита', 'Игоревич', 2),
(NULL, 4, 'Павлова', 'Екатерина', 'Александровна', 2),
(NULL, 4, 'Костина', 'Мария', 'Викторовна', 2),
(NULL, 4, 'Крылова', 'Татьяна', 'Геннадиевна', 2),
(NULL, 4, 'Рябков', 'Алексей', 'Станиславович', 2),
(NULL, 4, 'Волков', 'Семен', 'Анатольевич', 2),
(NULL, 4, 'Баранова', 'Людмила', 'Александровна', 2),
(NULL, 4, 'Семенова', 'Инна', 'Станиславовна', 2),
(NULL, 4, 'Лесков', 'Олег', 'Дмитриевич', 2),
(NULL, 4, 'Завьялов', 'Степан', 'Григорьевич', 2),
(1, 4, 'Станиславова', 'Варвара', 'Анатольевна', 3),
(2, 4, 'Лобанова', 'Наталья', 'Сергеевна', 3),
(1, 4, 'Богданов', 'Артем', 'Вячеславович', 3),
(2, 4, 'Гаврилова', 'Олеся', 'Дмитриевна', 3),
(3, 4, 'Печенкин', 'Роман', 'Александрович', 3),
(1, 4, 'Тихомиров', 'Игорь', 'Станиславович', 3),
(2, 4, 'Кудрявцев', 'Василий', 'Анатольевич', 3),
(1, 4, 'Куприянов', 'Дмитрий', 'Геннадиевич', 3),
(2, 4, 'Шевченко', 'Татьяна', 'Валерьевна', 3),
(1, 4, 'Петухов', 'Станислав', 'Иванович', 3),
(1, 4, 'Медведева', 'Елизавета', 'Денисовна', 3),
(3, 4, 'Соболев', 'Максим', 'Викторович', 3),
(3, 4, 'Ларина', 'Анастасия', 'Валерьевна', 4),
(2, 4, 'Кудрявцева', 'Светлана', 'Сергеевна', 4),
(1, 4, 'Синяков', 'Вячеслав', 'Станиславович', 4),
(2, 4, 'Зимин', 'Денис', 'Александрович', 4),
(1, 4, 'Соколова', 'Ирина', 'Николаевна', 4),
(3, 4, 'Анохина', 'Людмила', 'Григорьевна', 4),
(1, 4, 'Шубина', 'Маргарита', 'Игоревна', 4),
(1, 4, 'Зайцева', 'Татьяна', 'Алексеевна', 4),
(3, 4, 'Громов', 'Степан', 'Дмитриевич', 4),
(3, 4, 'Тихонов', 'Андрей', 'Иванович', 4),
(2, 4, 'Маслов', 'Олег', 'Анатольевич', 4),
(2, 4, 'Герасимова', 'Евгения', 'Денисовна', 4);


-- Вставка студентов для направления 'Биохимия' (master)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(1, 5, 'Иванов', 'Александр', 'Сергеевич', 1),
(2, 5, 'Петрова', 'Мария', 'Ивановна', 1),
(1, 5, 'Сидоров', 'Дмитрий', 'Станиславович', 1),
(2, 5, 'Смирнова', 'Елена', 'Николаевна', 1),
(1, 5, 'Ковалев', 'Антон', 'Геннадиевич', 1),
(1, 5, 'Александрова', 'Татьяна', 'Петровна', 1),
(1, 5, 'Григорьев', 'Роман', 'Олегович', 1),
(2, 5, 'Федоров', 'Игорь', 'Дмитриевич', 1),
(1, 5, 'Шевченко', 'Оксана', 'Сергеевна', 1),
(3, 5, 'Кириллова', 'Светлана', 'Викторовна', 1),
(3, 5, 'Морозов', 'Денис', 'Николаевич', 1),
(3, 5, 'Савельев', 'Константин', 'Алексеевич', 1),
(2, 5, 'Волкова', 'Нина', 'Валентиновна', 2),
(1, 5, 'Тихомиров', 'Артем', 'Александрович', 2),
(1, 5, 'Данилова', 'Елизавета', 'Владимировна', 2),
(3, 5, 'Солдатова', 'Людмила', 'Григорьевна', 2),
(1, 5, 'Коваль', 'Тимофей', 'Степанович', 2),
(3, 5, 'Малахов', 'Петр', 'Игоревич', 2),
(1, 5, 'Горбунова', 'Анна', 'Николаевна', 2),
(3, 5, 'Сидоренко', 'Данил', 'Петрович', 2),
(3, 5, 'Бурмистрова', 'Ольга', 'Ивановна', 2),
(2, 5, 'Рябова', 'Ксения', 'Алексеевна', 2),
(3, 5, 'Шульгин', 'Семен', 'Анатольевич', 2),
(1, 5, 'Белов', 'Ярослав', 'Михайлович', 2);



-- Вставка студентов на 6 направление (course_id = 6, education_level = bachelor)
-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 6, 'Иванов', 'Алексей', 'Сергеевич', 1),
(NULL, 6, 'Петров', 'Дмитрий', 'Алексеевич', 1),
(NULL, 6, 'Сидорова', 'Ольга', 'Викторовна', 1),
(NULL, 6, 'Смирнов', 'Анатолий', 'Игоревич', 1),
(NULL, 6, 'Кузнецова', 'Анна', 'Вячеславовна', 1),
(NULL, 6, 'Федоров', 'Андрей', 'Николаевич', 1),
(NULL, 6, 'Лебедев', 'Роман', 'Сергеевич', 1),
(NULL, 6, 'Ковалев', 'Станислав', 'Олегович', 1),
(NULL, 6, 'Давыдова', 'Елена', 'Валентиновна', 1),
(NULL, 6, 'Соловьев', 'Вячеслав', 'Анатольевич', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 6, 'Громова', 'Евгения', 'Петровна', 2),
(NULL, 6, 'Куликов', 'Станислав', 'Олегович', 2),
(NULL, 6, 'Тихонов', 'Валерий', 'Игоревич', 2),
(NULL, 6, 'Зайцева', 'Мария', 'Дмитриевна', 2),
(NULL, 6, 'Кондратьев', 'Роман', 'Вячеславович', 2),
(NULL, 6, 'Романова', 'Светлана', 'Анатольевна', 2),
(NULL, 6, 'Герасимова', 'Нина', 'Петровна', 2),
(NULL, 6, 'Павлов', 'Денис', 'Владимирович', 2),
(NULL, 6, 'Рябов', 'Алексей', 'Алексеевич', 2),
(NULL, 6, 'Панина', 'Елизавета', 'Сергеевна', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(4, 6, 'Солдатова', 'Людмила', 'Григорьевна', 3),
(4, 6, 'Лобанова', 'Светлана', 'Петровна', 3),
(4, 6, 'Семёнов', 'Григорий', 'Анатольевич', 3),
(5, 6, 'Андреева', 'Ксения', 'Денисовна', 3),
(5, 6, 'Сафонова', 'Антонина', 'Николаевна', 3),
(5, 6, 'Тихомирова', 'Елена', 'Сергеевна', 3),
(4, 6, 'Калашников', 'Илья', 'Станиславович', 3),
(6, 6, 'Синяков', 'Степан', 'Игоревич', 3),
(4, 6, 'Егорова', 'Татьяна', 'Михайловна', 3),
(4, 6, 'Мартынов', 'Петр', 'Станиславович', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(5, 6, 'Федосеев', 'Игорь', 'Геннадиевич', 4),
(5, 6, 'Кудрявцева', 'Елизавета', 'Денисовна', 4),
(5, 6, 'Степанова', 'София', 'Петровна', 4),
(5, 6, 'Снегирева', 'Анна', 'Викторовна', 4),
(4, 6, 'Ковалев', 'Игорь', 'Станиславович', 4),
(5, 6, 'Третьякова', 'Ольга', 'Сергеевна', 4),
(4, 6, 'Касаткин', 'Дмитрий', 'Александрович', 4),
(5, 6, 'Лебедев', 'Анатолий', 'Михайлович', 4),
(5, 6, 'Мальцева', 'Светлана', 'Станиславовна', 4),
(6, 6, 'Королева', 'Тамара', 'Григорьевна', 4);

-- Вставка студентов на 7 направление (course_id = 7, education_level = master)
-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(4, 7, 'Иванова', 'Кристина', 'Сергеевна', 1),
(6, 7, 'Ким', 'Анна', 'Дмитриевна', 1),
(4, 7, 'Петрова', 'Елена', 'Станиславовна', 1),
(6, 7, 'Федосова', 'Людмила', 'Викторовна', 1),
(6, 7, 'Сидорова', 'Ксения', 'Валентиновна', 1),
(6, 7, 'Григорьева', 'Татьяна', 'Николаевна', 1),
(6, 7, 'Тихонов', 'Анатолий', 'Геннадиевич', 1),
(6, 7, 'Лебедев', 'Виктор', 'Станиславович', 1),
(6, 7, 'Панова', 'Наталья', 'Станиславовна', 1),
(6, 7, 'Рябова', 'Евгения', 'Александровна', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(4, 7, 'Михайлов', 'Денис', 'Владимирович', 2),
(6, 7, 'Зайцева', 'Тамара', 'Игоревна', 2),
(6, 7, 'Смирнов', 'Анатолий', 'Дмитриевич', 2),
(6, 7, 'Романов', 'Станислав', 'Дмитриевич', 2),
(4, 7, 'Косарев', 'Сергей', 'Петрович', 2),
(5, 7, 'Евдокимов', 'Александр', 'Анатольевич', 2),
(5, 7, 'Шаповалов', 'Виктор', 'Михайлович', 2),
(5, 7, 'Третьяков', 'Роман', 'Денисович', 2),
(5, 7, 'Королева', 'Светлана', 'Александровна', 2),
(5, 7, 'Тихомирова', 'Ксения', 'Павловна', 2);

-- Вставка студентов на 8 направление (course_id = 8, education_level = bachelor)
-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 8, 'Федосов', 'Иван', 'Геннадиевич', 1),
(NULL, 8, 'Медведева', 'Наталья', 'Александровна', 1),
(NULL, 8, 'Романов', 'Евгений', 'Алексеевич', 1),
(NULL, 8, 'Громова', 'Анастасия', 'Петровна', 1),
(NULL, 8, 'Ильина', 'Екатерина', 'Вячеславовна', 1),
(NULL, 8, 'Шмидт', 'Ольга', 'Станиславовна', 1),
(NULL, 8, 'Лапин', 'Алексей', 'Сергеевич', 1),
(NULL, 8, 'Степанова', 'Светлана', 'Михайловна', 1),
(NULL, 8, 'Афанасиев', 'Станислав', 'Геннадиевич', 1),
(NULL, 8, 'Барышников', 'Дмитрий', 'Анатольевич', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 8, 'Костина', 'Вера', 'Дмитриевна', 2),
(NULL, 8, 'Ларина', 'Валентина', 'Игоревна', 2),
(NULL, 8, 'Сенин', 'Анатолий', 'Петрович', 2),
(NULL, 8, 'Соколова', 'Надежда', 'Станиславовна', 2),
(NULL, 8, 'Мишина', 'Мария', 'Викторовна', 2),
(NULL, 8, 'Трофимова', 'София', 'Станиславовна', 2),
(NULL, 8, 'Лисицын', 'Денис', 'Александрович', 2),
(NULL, 8, 'Кудряшов', 'Кирилл', 'Сергеевич', 2),
(NULL, 8, 'Давыдова', 'Наталья', 'Дмитриевна', 2),
(NULL, 8, 'Солдатов', 'Роман', 'Викторович', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(5, 8, 'Кузнецова', 'Марина', 'Денисовна', 3),
(5, 8, 'Тихомирова', 'Ксения', 'Дмитриевна', 3),
(5, 8, 'Шевченко', 'Ирина', 'Вячеславовна', 3),
(5, 8, 'Гуляев', 'Сергей', 'Александрович', 3),
(4, 8, 'Королева', 'Юлия', 'Станиславовна', 3),
(5, 8, 'Лебедева', 'Елена', 'Николаевна', 3),
(5, 8, 'Тихонов', 'Роман', 'Алексеевич', 3),
(4, 8, 'Герасимова', 'Людмила', 'Сергеевна', 3),
(4, 8, 'Киселева', 'Евгения', 'Игоревна', 3),
(4, 8, 'Доронина', 'Татьяна', 'Александровна', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(6, 8, 'Соколов', 'Владимир', 'Иванович', 4),
(5, 8, 'Коновалова', 'Анна', 'Сергеевна', 4),
(6, 8, 'Сидоренко', 'Анастасия', 'Дмитриевна', 4),
(6, 8, 'Ефимова', 'Елена', 'Игоревна', 4),
(6, 8, 'Павлова', 'Наталья', 'Геннадиевна', 4),
(6, 8, 'Кривошапка', 'Илья', 'Дмитриевич', 4),
(5, 8, 'Давыдов', 'Степан', 'Викторович', 4),
(4, 8, 'Глухов', 'Алексей', 'Станиславович', 4),
(4, 8, 'Михайлова', 'Анна', 'Сергеевна', 4),
(5, 8, 'Сафонова', 'Ольга', 'Викторовна', 4);

-- Вставка студентов на 9 направление (course_id = 9, education_level = bachelor)
-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 9, 'Иванов', 'Александр', 'Сергеевич', 1),
(NULL, 9, 'Петров', 'Дмитрий', 'Алексеевич', 1),
(NULL, 9, 'Сидорова', 'Анна', 'Игоревна', 1),
(NULL, 9, 'Смирнов', 'Роман', 'Николаевич', 1),
(NULL, 9, 'Кузнецова', 'Екатерина', 'Станиславовна', 1),
(NULL, 9, 'Федоров', 'Анатолий', 'Геннадиевич', 1),
(NULL, 9, 'Лебедев', 'Никита', 'Петрович', 1),
(NULL, 9, 'Давыдова', 'Татьяна', 'Сергеевна', 1),
(NULL, 9, 'Громова', 'Светлана', 'Дмитриевна', 1),
(NULL, 9, 'Ковалев', 'Евгений', 'Станиславович', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 9, 'Костина', 'Марина', 'Алексеевна', 2),
(NULL, 9, 'Ларина', 'Анастасия', 'Викторовна', 2),
(NULL, 9, 'Сенин', 'Владислав', 'Игоревич', 2),
(NULL, 9, 'Смирнова', 'Елизавета', 'Сергеевна', 2),
(NULL, 9, 'Мишина', 'Ксения', 'Вячеславовна', 2),
(NULL, 9, 'Трофимова', 'Наталья', 'Дмитриевна', 2),
(NULL, 9, 'Лисицын', 'Денис', 'Александрович', 2),
(NULL, 9, 'Кудряшов', 'Илья', 'Станиславович', 2),
(NULL, 9, 'Давыдова', 'Анастасия', 'Игоревна', 2),
(NULL, 9, 'Солдатов', 'Роман', 'Геннадиевич', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(6, 9, 'Кузнецов', 'Станислав', 'Александрович', 3),
(6, 9, 'Тихомирова', 'Елена', 'Станиславовна', 3),
(6, 9, 'Шевченко', 'Григорий', 'Петрович', 3),
(5, 9, 'Гуляев', 'Сергей', 'Александрович', 3),
(6, 9, 'Королева', 'Юлия', 'Станиславовна', 3),
(6, 9, 'Лебедева', 'Наталья', 'Николаевна', 3),
(5, 9, 'Тихонов', 'Роман', 'Алексеевич', 3),
(6, 9, 'Герасимова', 'Людмила', 'Сергеевна', 3),
(6, 9, 'Киселева', 'Евгения', 'Игоревна', 3),
(5, 9, 'Доронина', 'Татьяна', 'Александровна', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(4, 9, 'Соколов', 'Владимир', 'Иванович', 4),
(4, 9, 'Коновалова', 'Анна', 'Сергеевна', 4),
(4, 9, 'Сидоренко', 'Анастасия', 'Дмитриевна', 4),
(4, 9, 'Ефимова', 'Елена', 'Игоревна', 4),
(4, 9, 'Павлова', 'Наталья', 'Геннадиевна', 4),
(4, 9, 'Кривошапка', 'Илья', 'Дмитриевич', 4),
(6, 9, 'Давыдов', 'Степан', 'Викторович', 4),
(6, 9, 'Глухов', 'Алексей', 'Станиславович', 4),
(5, 9, 'Михайлова', 'Анна', 'Сергеевна', 4),
(4, 9, 'Сафонова', 'Ольга', 'Викторовна', 4);


-- Вставка студентов на 10 направление (course_id = 10, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 10, 'Сергеев', 'Дмитрий', 'Александрович', 1),
(NULL, 10, 'Иванов', 'Алексей', 'Николаевич', 1),
(NULL, 10, 'Петров', 'Роман', 'Анатольевич', 1),
(NULL, 10, 'Федоров', 'Александр', 'Владимирович', 1),
(NULL, 10, 'Сидорова', 'Татьяна', 'Александровна', 1),
(NULL, 10, 'Кузнецова', 'Екатерина', 'Сергеевна', 1),
(NULL, 10, 'Смирнов', 'Антон', 'Дмитриевич', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 10, 'Громова', 'Мария', 'Ивановна', 2),
(NULL, 10, 'Лебедев', 'Никита', 'Петрович', 2),
(NULL, 10, 'Зайцева', 'Ольга', 'Алексеевна', 2),
(NULL, 10, 'Синицина', 'Ирина', 'Викторовна', 2),
(NULL, 10, 'Кравцов', 'Станислав', 'Дмитриевич', 2),
(NULL, 10, 'Герасимова', 'Евгения', 'Анатольевна', 2),
(NULL, 10, 'Шарова', 'Ксения', 'Вячеславовна', 2),
(NULL, 10, 'Лысенко', 'Владислав', 'Александрович', 2),
(NULL, 10, 'Трофимова', 'Анна', 'Николаевна', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(7, 10, 'Павлов', 'Александр', 'Сергеевич', 3),
(8, 10, 'Доронина', 'Марина', 'Игоревна', 3),
(8, 10, 'Анисимов', 'Артем', 'Владимирович', 3),
(7, 10, 'Левина', 'Светлана', 'Дмитриевна', 3),
(9, 10, 'Миронов', 'Олег', 'Николаевич', 3),
(9, 10, 'Николаев', 'Дмитрий', 'Геннадиевич', 3),
(7, 10, 'Семенова', 'Анна', 'Александровна', 3),
(8, 10, 'Фомин', 'Иван', 'Анатольевич', 3),
(7, 10, 'Тимофеева', 'Елизавета', 'Станиславовна', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(7, 10, 'Евдокимова', 'Анастасия', 'Сергеевна', 4),
(8, 10, 'Ковалев', 'Григорий', 'Станиславович', 4),
(8, 10, 'Глушкова', 'Татьяна', 'Ивановна', 4),
(7, 10, 'Костина', 'Светлана', 'Анатольевна', 4),
(8, 10, 'Рыбаков', 'Станислав', 'Владимирович', 4),
(9, 10, 'Курилова', 'Светлана', 'Викторовна', 4),
(8, 10, 'Боровиков', 'Сергей', 'Дмитриевич', 4),
(8, 10, 'Миронова', 'Анна', 'Владимировна', 4),
(8, 10, 'Костюков', 'Алексей', 'Иванович', 4),
(8, 10, 'Сосновский', 'Кирилл', 'Станиславович', 4);

-- Вставка студентов на 11 направление (course_id = 11, education_level = master)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(7, 11, 'Соболева', 'Наталья', 'Ивановна', 1),
(8, 11, 'Васильева', 'Лариса', 'Сергеевна', 1),
(9, 11, 'Гребенщиков', 'Станислав', 'Дмитриевич', 1),
(8, 11, 'Харитонов', 'Евгений', 'Станиславович', 1),
(7, 11, 'Федотов', 'Дмитрий', 'Сергеевич', 1),
(9, 11, 'Степанова', 'Ольга', 'Николаевна', 1),
(9, 11, 'Ширяев', 'Кирилл', 'Викторович', 1),
(9, 11, 'Морозова', 'Нина', 'Анатольевна', 1),
(8, 11, 'Лобанов', 'Григорий', 'Станиславович', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(8, 11, 'Соломатина', 'Елена', 'Игоревна', 2),
(7, 11, 'Воробьева', 'Светлана', 'Анатольевна', 2),
(9, 11, 'Григорьева', 'Анна', 'Николаевна', 2),
(7, 11, 'Исаев', 'Роман', 'Станиславович', 2),
(7, 11, 'Симонов', 'Павел', 'Александрович', 2),
(8, 11, 'Васильев', 'Станислав', 'Геннадиевич', 2),
(9, 11, 'Волкова', 'Ирина', 'Станиславовна', 2),
(7, 11, 'Калинин', 'Дмитрий', 'Иванович', 2),
(7, 11, 'Баранов', 'Олег', 'Сергеевич', 2),
(8, 11, 'Долгова', 'Татьяна', 'Петровна', 2);

-- Вставка студентов на 12 направление (course_id = 12, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 12, 'Лебедев', 'Никита', 'Александрович', 1),
(NULL, 12, 'Соколов', 'Егор', 'Станиславович', 1),
(NULL, 12, 'Коваленко', 'Светлана', 'Алексеевна', 1),
(NULL, 12, 'Сидорова', 'Анастасия', 'Викторовна', 1),
(NULL, 12, 'Алексеева', 'Мария', 'Геннадиевна', 1),
(NULL, 12, 'Евдокимова', 'Полина', 'Сергеевна', 1),
(NULL, 12, 'Фролов', 'Иван', 'Дмитриевич', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 12, 'Головин', 'Степан', 'Дмитриевич', 2),
(NULL, 12, 'Васильева', 'Софья', 'Александровна', 2),
(NULL, 12, 'Лобанов', 'Роман', 'Иванович', 2),
(NULL, 12, 'Тимофеев', 'Петр', 'Николаевич', 2),
(NULL, 12, 'Терентьев', 'Сергей', 'Игоревич', 2),
(NULL, 12, 'Семенова', 'Нина', 'Геннадиевна', 2),
(NULL, 12, 'Шарова', 'Александра', 'Дмитриевна', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(8, 12, 'Никифоров', 'Андрей', 'Станиславович', 3),
(7, 12, 'Левин', 'Константин', 'Дмитриевич', 3),
(8, 12, 'Анисимов', 'Роман', 'Игоревич', 3),
(9, 12, 'Семенов', 'Александр', 'Александрович', 3),
(7, 12, 'Сидорова', 'Татьяна', 'Сергеевна', 3),
(8, 12, 'Ковалева', 'Анастасия', 'Дмитриевна', 3),
(8, 12, 'Баранов', 'Дмитрий', 'Александрович', 3),
(7, 12, 'Григорьев', 'Максим', 'Станиславович', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(8, 12, 'Лебедев', 'Станислав', 'Петрович', 4),
(8, 12, 'Федорова', 'Ольга', 'Николаевна', 4),
(7, 12, 'Гордеева', 'Елена', 'Анатольевна', 4),
(9, 12, 'Долгушев', 'Александр', 'Геннадиевич', 4),
(9, 12, 'Гаврилов', 'Андрей', 'Александрович', 4),
(7, 12, 'Боровиков', 'Сергей', 'Дмитриевич', 4),
(8, 12, 'Кузнецова', 'Варвара', 'Станиславовна', 4),
(9, 12, 'Костина', 'Светлана', 'Геннадиевна', 4),
(9, 12, 'Савельева', 'Екатерина', 'Дмитриевна', 4),
(8, 12, 'Зайцева', 'Ольга', 'Станиславовна', 4);

-- Вставка студентов на 13 направление (course_id = 13, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 13, 'Соломонов', 'Алексей', 'Станиславович', 1),
(NULL, 13, 'Тихомиров', 'Станислав', 'Геннадиевич', 1),
(NULL, 13, 'Николаев', 'Никита', 'Алексеевич', 1),
(NULL, 13, 'Федосеев', 'Игорь', 'Анатольевич', 1),
(NULL, 13, 'Лебедев', 'Даниил', 'Сергеевич', 1),
(NULL, 13, 'Евдокимова', 'Екатерина', 'Александровна', 1),
(NULL, 13, 'Ковалев', 'Артем', 'Станиславович', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 13, 'Васильева', 'Светлана', 'Ивановна', 2),
(NULL, 13, 'Громова', 'Ксения', 'Николаевна', 2),
(NULL, 13, 'Иванов', 'Степан', 'Анатольевич', 2),
(NULL, 13, 'Сидорова', 'Анна', 'Дмитриевна', 2),
(NULL, 13, 'Сергеев', 'Роман', 'Александрович', 2),
(NULL, 13, 'Петрова', 'Алена', 'Геннадиевна', 2),
(NULL, 13, 'Трофимова', 'Даша', 'Станиславовна', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(8, 13, 'Григорьева', 'Ирина', 'Анатольевна', 3),
(7, 13, 'Павлов', 'Валентин', 'Дмитриевич', 3),
(8, 13, 'Сидорова', 'Екатерина', 'Станиславовна', 3),
(7, 13, 'Кузнецова', 'Валерия', 'Дмитриевна', 3),
(8, 13, 'Анисимов', 'Виктор', 'Игоревич', 3),
(7, 13, 'Светов', 'Анатолий', 'Дмитриевич', 3),
(7, 13, 'Гусев', 'Кирилл', 'Сергеевич', 3),
(8, 13, 'Морозова', 'Надежда', 'Алексеевна', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(9, 13, 'Федотов', 'Дмитрий', 'Станиславович', 4),
(9, 13, 'Ларина', 'Светлана', 'Викторовна', 4),
(9, 13, 'Мартынов', 'Степан', 'Александрович', 4),
(9, 13, 'Шарапов', 'Александр', 'Викторович', 4),
(7, 13, 'Калашников', 'Владимир', 'Александрович', 4),
(9, 13, 'Трофимова', 'Елена', 'Дмитриевна', 4),
(7, 13, 'Шаров', 'Сергей', 'Геннадиевич', 4),
(9, 13, 'Васильев', 'Роман', 'Петрович', 4),
(9, 13, 'Зайцева', 'Мария', 'Станиславовна', 4),
(9, 13, 'Левин', 'Александр', 'Анатольевич', 4);

-- Вставка студентов на 14 направление (course_id = 14, education_level = master)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(7, 14, 'Смирнов', 'Алексей', 'Дмитриевич', 1),
(8, 14, 'Иванова', 'Елена', 'Александровна', 1),
(7, 14, 'Федоров', 'Станислав', 'Александрович', 1),
(8, 14, 'Морозов', 'Дмитрий', 'Сергеевич', 1),
(7, 14, 'Кириллова', 'Ольга', 'Александровна', 1),
(7, 14, 'Петров', 'Владислав', 'Анатольевич', 1),
(8, 14, 'Кузнецов', 'Егор', 'Дмитриевич', 1),
(8, 14, 'Лавров', 'Григорий', 'Станиславович', 1),
(8, 14, 'Давыдов', 'Артем', 'Алексеевич', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(7, 14, 'Сергеев', 'Илья', 'Николаевич', 2),
(8, 14, 'Фролова', 'Анастасия', 'Станиславовна', 2),
(7, 14, 'Громова', 'Алена', 'Алексеевна', 2),
(8, 14, 'Анисимова', 'Ксения', 'Анатольевна', 2),
(7, 14, 'Морозов', 'Олег', 'Вячеславович', 2),
(8, 14, 'Никитина', 'Марина', 'Сергеевна', 2),
(7, 14, 'Терентьев', 'Александр', 'Николаевич', 2),
(7, 14, 'Ларин', 'Егор', 'Алексеевич', 2),
(8, 14, 'Долгова', 'Екатерина', 'Станиславовна', 2);

-- Вставка студентов на 15 направление (course_id = 15, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 15, 'Шевченко', 'Александр', 'Сергеевич', 1),
(NULL, 15, 'Коваленко', 'Ирина', 'Васильевна', 1),
(NULL, 15, 'Петренко', 'Дмитрий', 'Николаевич', 1),
(NULL, 15, 'Бондарь', 'Татьяна', 'Станиславовна', 1),
(NULL, 15, 'Грищенко', 'Сергей', 'Вячеславович', 1),
(NULL, 15, 'Мельниченко', 'Елена', 'Анатольевна', 1),
(NULL, 15, 'Тимошенко', 'Наталья', 'Олеговна', 1),
(NULL, 15, 'Кучер', 'Анна', 'Дмитриевна', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 15, 'Литвин', 'Виктор', 'Станиславович', 2),
(NULL, 15, 'Сидоренко', 'Анна', 'Геннадиевна', 2),
(NULL, 15, 'Кириленко', 'Даниил', 'Петрович', 2),
(NULL, 15, 'Савченко', 'Андрей', 'Николаевич', 2),
(NULL, 15, 'Ковалев', 'Светлана', 'Анатольевна', 2),
(NULL, 15, 'Федоренко', 'Сергей', 'Игоревич', 2),
(NULL, 15, 'Бойко', 'Ольга', 'Михайловна', 2),
(NULL, 15, 'Павлюк', 'Алексей', 'Владимирович', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(10, 15, 'Давыдов', 'Анатолий', 'Станиславович', 3),
(11, 15, 'Морозов', 'Сергей', 'Алексеевич', 3),
(10, 15, 'Ларина', 'Наталья', 'Игоревна', 3),
(11, 15, 'Зайцева', 'Екатерина', 'Александровна', 3),
(10, 15, 'Фролов', 'Дмитрий', 'Вячеславович', 3),
(11, 15, 'Голуб', 'Ольга', 'Сергеевна', 3),
(10, 15, 'Рябченко', 'Оксана', 'Николаевна', 3),
(11, 15, 'Кравченко', 'Станислав', 'Игоревич', 3),
(10, 15, 'Тищенко', 'Алена', 'Александровна', 3),
(11, 15, 'Мельников', 'Максим', 'Игоревич', 3),
(10, 15, 'Власенко', 'Егор', 'Сергеевич', 3),
(11, 15, 'Семёнов', 'Екатерина', 'Денисовна', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(10, 15, 'Иванов', 'Павел', 'Дмитриевич', 4),
(11, 15, 'Петрова', 'Татьяна', 'Игоревна', 4),
(12, 15, 'Маслов', 'Степан', 'Сергеевич', 4),
(10, 15, 'Смирнова', 'Анна', 'Викторовна', 4),
(11, 15, 'Громов', 'Евгений', 'Александрович', 4),
(12, 15, 'Костюк', 'Денис', 'Александрович', 4),
(10, 15, 'Богдан', 'Мария', 'Петровна', 4),
(11, 15, 'Харченко', 'Алексей', 'Игоревич', 4),
(12, 15, 'Романов', 'Николай', 'Алексеевич', 4),
(11, 15, 'Кучер', 'Мария', 'Сергеевна', 4),
(10, 15, 'Савицкий', 'Иван', 'Викторович', 4),
(11, 15, 'Ковалев', 'Анастасия', 'Николаевна', 4);

-- Вставка студентов на 16 направление (course_id = 16, education_level = master)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(10, 16, 'Панченко', 'Елена', 'Олеговна', 1),
(11, 16, 'Захарченко', 'Тимур', 'Романович', 1),
(12, 16, 'Тимуров', 'Тамара', 'Сергеевна', 1),
(10, 16, 'Гурьянов', 'Никита', 'Васильевич', 1),
(11, 16, 'Симоненко', 'Станислав', 'Александрович', 1),
(12, 16, 'Купцов', 'Роман', 'Алексеевич', 1),
(10, 16, 'Гуляева', 'Виктория', 'Дмитриевна', 1),
(11, 16, 'Ситникова', 'Светлана', 'Игоревна', 1),
(10, 16, 'Рашидова', 'Гульнара', 'Игоревна', 1),
(11, 16, 'Лебедев', 'Сергей', 'Петрович', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(10, 16, 'Терентьев', 'Евгений', 'Алексеевич', 2),
(11, 16, 'Соболев', 'Николай', 'Иванович', 2),
(12, 16, 'Кулагин', 'Леонид', 'Геннадиевич', 2),
(10, 16, 'Агафонов', 'Роман', 'Олегович', 2),
(11, 16, 'Шевченко', 'Ольга', 'Сергеевна', 2),
(12, 16, 'Никитин', 'Анатолий', 'Алексеевич', 2),
(10, 16, 'Кириллов', 'Даниил', 'Петрович', 2),
(11, 16, 'Соколов', 'Григорий', 'Викторович', 2);

-- Вставка студентов на 17 направление (course_id = 17, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 17, 'Афанасьев', 'Валентин', 'Дмитриевич', 1),
(NULL, 17, 'Червоненко', 'Наталья', 'Васильевна', 1),
(NULL, 17, 'Косенко', 'Сергей', 'Олегович', 1),
(NULL, 17, 'Сенкевич', 'Ольга', 'Петровна', 1),
(NULL, 17, 'Костюк', 'Анастасия', 'Станиславовна', 1),
(NULL, 17, 'Гуляев', 'Игорь', 'Сергеевич', 1),
(NULL, 17, 'Косов', 'Елена', 'Николаевна', 1),
(NULL, 17, 'Викулов', 'Никита', 'Дмитриевич', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 17, 'Григорьев', 'Денис', 'Владимирович', 2),
(NULL, 17, 'Тихомиров', 'Евгений', 'Станиславович', 2),
(NULL, 17, 'Шевцова', 'Людмила', 'Алексеевна', 2),
(NULL, 17, 'Савельев', 'Александр', 'Игоревич', 2),
(NULL, 17, 'Бобров', 'Станислав', 'Иванович', 2),
(NULL, 17, 'Лебедева', 'Мария', 'Олеговна', 2),
(NULL, 17, 'Сидоренко', 'Игорь', 'Анатольевич', 2),
(NULL, 17, 'Букреев', 'Алена', 'Сергеевна', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(10, 17, 'Петров', 'Павел', 'Денисович', 3),
(11, 17, 'Семенова', 'Евгения', 'Дмитриевна', 3),
(10, 17, 'Рыков', 'Алексей', 'Вячеславович', 3),
(11, 17, 'Василенко', 'Анна', 'Николаевна', 3),
(12, 17, 'Левченко', 'Марина', 'Станиславовна', 3),
(10, 17, 'Головко', 'Александр', 'Валерьевич', 3),
(11, 17, 'Лебедев', 'Игорь', 'Станиславович', 3),
(12, 17, 'Ковалев', 'Светлана', 'Анатольевна', 3),
(10, 17, 'Коваленко', 'Денис', 'Александрович', 3),
(11, 17, 'Ширяев', 'Роман', 'Игоревич', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(10, 17, 'Кочетов', 'Валерий', 'Станиславович', 4),
(11, 17, 'Савельева', 'Елена', 'Дмитриевна', 4),
(12, 17, 'Федорова', 'Ирина', 'Николаевна', 4),
(10, 17, 'Фролов', 'Евгений', 'Игоревич', 4),
(11, 17, 'Тимошенко', 'Анастасия', 'Валерьевна', 4),
(12, 17, 'Борисов', 'Станислав', 'Дмитриевич', 4),
(10, 17, 'Глухов', 'Дмитрий', 'Александрович', 4),
(11, 17, 'Алексеева', 'Наталья', 'Сергеевна', 4);

-- Вставка студентов на 18 направление (course_id = 18, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 18, 'Нан', 'Ли', 'Вэньцзе', 1),
(NULL, 18, 'Тан', 'Цзян', 'Мэй', 1),
(NULL, 18, 'Ши', 'Дэ', 'Ли', 1),
(NULL, 18, 'Ли', 'Синь', 'Чжэн', 1),
(NULL, 18, 'Сун', 'Хай', 'Цзюнь', 1),
(NULL, 18, 'Чен', 'Го', 'Цзинь', 1),
(NULL, 18, 'Лу', 'Ян', 'Тин', 1),
(NULL, 18, 'Ху', 'Цзинь', 'Линь', 1),
(NULL, 18, 'Ван', 'Фан', 'Лу', 1),
(NULL, 18, 'Цай', 'Шунь', 'Цзы', 1),
(NULL, 18, 'Дин', 'Тин', 'Янь', 1),
(NULL, 18, 'Пан', 'Юн', 'Цзюнь', 1),
(NULL, 18, 'Мэй', 'Цзин', 'Гуо', 1),
(NULL, 18, 'Ян', 'Лун', 'Ли', 1),
(NULL, 18, 'Ши', 'Юй', 'Ху', 1),
(NULL, 18, 'Ким', 'Сун', 'Пэ', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 18, 'Ли', 'Хао', 'Синь', 2),
(NULL, 18, 'Чжоу', 'Вэнь', 'Ли', 2),
(NULL, 18, 'Лян', 'Гао', 'Чжэн', 2),
(NULL, 18, 'Сюй', 'Цзинь', 'Цзюнь', 2),
(NULL, 18, 'Линь', 'Цзинь', 'Вань', 2),
(NULL, 18, 'Чжэнь', 'И', 'Сюэ', 2),
(NULL, 18, 'Сун', 'Мэй', 'Фу', 2),
(NULL, 18, 'Ци', 'Дэ', 'Го', 2),
(NULL, 18, 'Пэн', 'Тин', 'Ли', 2),
(NULL, 18, 'Фан', 'Ли', 'Ву', 2),
(NULL, 18, 'Ко', 'Синь', 'Юй', 2),
(NULL, 18, 'Яо', 'И', 'Гуо', 2),
(NULL, 18, 'Го', 'Фан', 'Си', 2),
(NULL, 18, 'Цао', 'Ши', 'Сю', 2),
(NULL, 18, 'Нин', 'Лин', 'Ян', 2),
(NULL, 18, 'Ши', 'Сяо', 'Мин', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(13, 18, 'Джабраилов', 'Тагир', 'Валерьевич', 3),
(14, 18, 'Магомедов', 'Али', 'Альбертович', 3),
(13, 18, 'Султанов', 'Данияр', 'Николаевич', 3),
(15, 18, 'Хакимов', 'Рамазан', 'Сергиевич', 3),
(13, 18, 'Салехов', 'Лев', 'Денисович', 3),
(14, 18, 'Гаджиев', 'Муса', 'Давидович', 3),
(15, 18, 'Касумов', 'Азамат', 'Русланович', 3),
(13, 18, 'Пшеница', 'Евгений', 'Олегович', 3),
(14, 18, 'Поляков', 'Антон', 'Валерьевич', 3),
(15, 18, 'Семёнов', 'Данила', 'Николаевич', 3),
(13, 18, 'Туркмен', 'Илья', 'Владиславович', 3),
(14, 18, 'Князев', 'Степан', 'Вячеславович', 3),
(15, 18, 'Гарунов', 'Тимур', 'Станиславович', 3),
(14, 18, 'Каракулов', 'Игорь', 'Денисович', 3),
(15, 18, 'Гатауллин', 'Эльдар', 'Дмитриевич', 3),
(13, 18, 'Мирзабеков', 'Умид', 'Шерзодович', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(13, 18, 'Нагимов', 'Гаджи', 'Борисович', 4),
(14, 18, 'Латыпов', 'Дмитрий', 'Сергеевич', 4),
(15, 18, 'Песков', 'Станислав', 'Евгеньевич', 4),
(13, 18, 'Кобулов', 'Нуридин', 'Михайлович', 4),
(14, 18, 'Мунаев', 'Мидхат', 'Набирович', 4),
(15, 18, 'Шевченко', 'Светлана', 'Васильевна', 4),
(13, 18, 'Сагарбеков', 'Асылбек', 'Оразбаевич', 4),
(14, 18, 'Рахманов', 'Рустам', 'Салатович', 4),
(15, 18, 'Умиров', 'Алишер', 'Гаджиевич', 4),
(14, 18, 'Лебедев', 'Олег', 'Иванович', 4),
(15, 18, 'Караев', 'Марат', 'Сергеевич', 4),
(14, 18, 'Шарипов', 'Дамир', 'Камильевич', 4),
(13, 18, 'Татевосов', 'Андрей', 'Юрьевич', 4),
(15, 18, 'Черкесов', 'Егор', 'Станиславович', 4),
(14, 18, 'Трещёв', 'Анатолий', 'Владимирович', 4);

-- Вставка студентов на 19 направление (course_id = 19, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 19, 'Кан', 'Чжун', 'Шу', 1),
(NULL, 19, 'Ли', 'Ян', 'Гуо', 1),
(NULL, 19, 'Шан', 'Минг', 'Фу', 1),
(NULL, 19, 'Чжоу', 'Ли', 'Сян', 1),
(NULL, 19, 'Сун', 'Фанг', 'Линь', 1),
(NULL, 19, 'Пэн', 'Ши', 'Цзюнь', 1),
(NULL, 19, 'Ху', 'Цзе', 'Цзинь', 1),
(NULL, 19, 'Дин', 'Ли', 'Гао', 1),
(NULL, 19, 'Ван', 'Лин', 'Ян', 1),
(NULL, 19, 'Чэнь', 'Чао', 'Синь', 1),
(NULL, 19, 'Цао', 'Ши', 'Ли', 1),
(NULL, 19, 'Фу', 'Вэнь', 'Ли', 1),
(NULL, 19, 'Ли', 'Чжун', 'Го', 1),
(NULL, 19, 'Лю', 'Дэ', 'Цзюнь', 1),
(NULL, 19, 'Тан', 'Дин', 'Ли', 1),
(NULL, 19, 'Ляо', 'Гуо', 'Сяо', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 19, 'Гусейнов', 'Родион', 'Станиславович', 2),
(NULL, 19, 'Алиев', 'Илья', 'Иванович', 2),
(NULL, 19, 'Магомедов', 'Аслан', 'Артурович', 2),
(NULL, 19, 'Султанов', 'Фарид', 'Шарифович', 2),
(NULL, 19, 'Хангалов', 'Сердар', 'Рамзиевич', 2),
(NULL, 19, 'Мишин', 'Дмитрий', 'Станиславович', 2),
(NULL, 19, 'Шерзод', 'Ибрагим', 'Нуралиевич', 2),
(NULL, 19, 'Ашуров', 'Камол', 'Джамилевич', 2),
(NULL, 19, 'Хасанов', 'Ашот', 'Петерович', 2),
(NULL, 19, 'Касумов', 'Данияр', 'Николаевич', 2),
(NULL, 19, 'Кутузов', 'Иван', 'Михайлович', 2),
(NULL, 19, 'Семёнов', 'Алексей', 'Дмитриевич', 2),
(NULL, 19, 'Ермолаев', 'Кирилл', 'Александрович', 2),
(NULL, 19, 'Бородин', 'Сергей', 'Иванович', 2),
(NULL, 19, 'Агапов', 'Станислав', 'Алексеевич', 2),
(NULL, 19, 'Егоров', 'Роман', 'Алексеевич', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(13, 19, 'Петров', 'Станислав', 'Петрович', 3),
(14, 19, 'Титов', 'Игорь', 'Владимирович', 3),
(13, 19, 'Дмитриев', 'Алексей', 'Юрьевич', 3),
(15, 19, 'Смирнов', 'Иван', 'Денисович', 3),
(13, 19, 'Панов', 'Анатолий', 'Дмитриевич', 3),
(14, 19, 'Баранов', 'Игорь', 'Валерьевич', 3),
(15, 19, 'Сидоров', 'Максим', 'Алексеевич', 3),
(13, 19, 'Федоров', 'Андрей', 'Станиславович', 3),
(14, 19, 'Сергеев', 'Дмитрий', 'Станиславович', 3),
(15, 19, 'Сычёв', 'Григорий', 'Денисович', 3),
(13, 19, 'Нестеров', 'Александр', 'Владимирович', 3),
(14, 19, 'Лебедев', 'Станислав', 'Олегович', 3),
(15, 19, 'Сорокин', 'Тимофей', 'Андреевич', 3),
(13, 19, 'Андреев', 'Даниил', 'Валерьевич', 3),
(14, 19, 'Крылов', 'Денис', 'Сергеевич', 3),
(15, 19, 'Григорьев', 'Илья', 'Николаевич', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(13, 19, 'Голубев', 'Алексей', 'Владимирович', 4),
(14, 19, 'Громов', 'Илья', 'Юрьевич', 4),
(15, 19, 'Токарев', 'Станислав', 'Петрович', 4),
(13, 19, 'Хлебников', 'Виктор', 'Анатольевич', 4),
(14, 19, 'Медведев', 'Евгений', 'Дмитриевич', 4),
(15, 19, 'Сергеев', 'Василий', 'Петрович', 4),
(13, 19, 'Пушкин', 'Семен', 'Станиславович', 4),
(14, 19, 'Тимофеев', 'Дмитрий', 'Алексеевич', 4),
(15, 19, 'Евдокимов', 'Анатолий', 'Валерьевич', 4),
(13, 19, 'Соколов', 'Александр', 'Анатольевич', 4),
(15, 19, 'Кузнецов', 'Виктор', 'Петрович', 4),
(14, 19, 'Станкевич', 'Станислав', 'Алексеевич', 4),
(13, 19, 'Шевченко', 'Дмитрий', 'Юрьевич', 4),
(15, 19, 'Аверин', 'Никита', 'Дмитриевич', 4),
(14, 19, 'Смирнов', 'Егор', 'Алексеевич', 4),
(13, 19, 'Зайцев', 'Владимир', 'Алексеевич', 4);

-- Вставка студентов на 20 направление (course_id = 20, education_level = master)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(13, 20, 'Сунь', 'Ли', 'Цзинь', 1),
(14, 20, 'Ли', 'Гао', 'Чжун', 1),
(15, 20, 'Ху', 'Ван', 'Цзюнь', 1),
(13, 20, 'Чжан', 'Сяо', 'Ли', 1),
(14, 20, 'Линь', 'Чжун', 'Синь', 1),
(15, 20, 'Цинь', 'Ли', 'Го', 1),
(13, 20, 'Кан', 'Чжун', 'Чжун', 1),
(14, 20, 'Сяо', 'Цзинь', 'Го', 1),
(15, 20, 'Пан', 'Мэй', 'Фанг', 1),
(13, 20, 'Ли', 'Чэнь', 'И', 1),
(14, 20, 'Цао', 'Ши', 'Чжун', 1),
(15, 20, 'Сяо', 'Ван', 'Чжэн', 1),
(13, 20, 'Сун', 'Чжун', 'Ли', 1),
(14, 20, 'Ли', 'Чжэнь', 'Фан', 1),
(15, 20, 'Линь', 'Гао', 'Лун', 1),
(13, 20, 'Чжоу', 'Хай', 'Мэй', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(13, 20, 'Гаджиев', 'Давид', 'Шерзодович', 2),
(14, 20, 'Ахмедов', 'Аслан', 'Ильярович', 2),
(15, 20, 'Магомедов', 'Эмиль', 'Элбрусевич', 2),
(13, 20, 'Ибрагимов', 'Тимур', 'Аскерович', 2),
(14, 20, 'Гумаров', 'Станислав', 'Забирович', 2),
(15, 20, 'Султанов', 'Магомед', 'Саидович', 2),
(13, 20, 'Гаджиев', 'Сослан', 'Шарикович', 2),
(14, 20, 'Сериков', 'Данияр', 'Альбертович', 2),
(15, 20, 'Курбанов', 'Салават', 'Тахирович', 2),
(13, 20, 'Шарипов', 'Алексей', 'Евгеньевич', 2),
(14, 20, 'Шевченко', 'Григорий', 'Романович', 2),
(15, 20, 'Петров', 'Игорь', 'Викторович', 2),
(13, 20, 'Соловьев', 'Иван', 'Валерьевич', 2),
(14, 20, 'Каракулов', 'Санжар', 'Алиевич', 2),
(15, 20, 'Пашков', 'Александр', 'Степанович', 2),
(13, 20, 'Сазонов', 'Дмитрий', 'Анатольевич', 2);

-- Студенты для направления 21 (уровень образования - bachelor)

INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
-- 1 курс
(NULL, 21, 'Иванов', 'Иван', 'Иванович', 1),
(NULL, 21, 'Петрова', 'Анна', 'Александровна', 1),
(NULL, 21, 'Сидоров', 'Дмитрий', 'Сергеевич', 1),
(NULL, 21, 'Коваленко', 'Оксана', 'Ивановна', 1),
(NULL, 21, 'Григорьев', 'Сергей', 'Анатольевич', 1),
(NULL, 21, 'Лебедева', 'Елена', 'Николаевна', 1),
(NULL, 21, 'Смирнов', 'Алексей', 'Викторович', 1),
(NULL, 21, 'Ткаченко', 'Олег', 'Владимирович', 1),
(NULL, 21, 'Федорова', 'Мария', 'Петровна', 1),
(NULL, 21, 'Михайлова', 'Татьяна', 'Юрьевна', 1),
(NULL, 21, 'Дьяков', 'Артем', 'Станиславович', 1),
(NULL, 21, 'Козлов', 'Андрей', 'Валерьевич', 1),
(NULL, 21, 'Ходос', 'Юлия', 'Игоревна', 1),

-- 2 курс
(NULL, 21, 'Савченко', 'Николай', 'Александрович', 2),
(NULL, 21, 'Зайцева', 'Анастасия', 'Сергеевна', 2),
(NULL, 21, 'Ковалев', 'Владимир', 'Михайлович', 2),
(NULL, 21, 'Попова', 'Дарья', 'Петровна', 2),
(NULL, 21, 'Степанова', 'Светлана', 'Владимировна', 2),
(NULL, 21, 'Селиверстов', 'Евгений', 'Николаевич', 2),
(NULL, 21, 'Гусев', 'Виктор', 'Федорович', 2),

-- 3 курс
(16, 21, 'Тимофеева', 'Екатерина', 'Алексеевна', 3),
(17, 21, 'Семенов', 'Максим', 'Павлович', 3),
(18, 21, 'Кириллова', 'Ольга', 'Сергеевна', 3),
(16, 21, 'Лисичкин', 'Петр', 'Анатольевич', 3),
(17, 21, 'Мельников', 'Игорь', 'Романович', 3),
(18, 21, 'Волкова', 'Ксения', 'Станиславовна', 3),

-- 4 курс (28 студентов)
(16, 21, 'Никитина', 'Вера', 'Степановна', 4),
(16, 21, 'Фролов', 'Станислав', 'Викторович', 4),
(17, 21, 'Миронова', 'Галина', 'Юрьевна', 4),
(18, 21, 'Исаев', 'Егор', 'Сергеевич', 4),
(17, 21, 'Борисова', 'Маргарита', 'Олеговна', 4),
(16, 21, 'Семёнова', 'Татьяна', 'Анатольевна', 4),
(18, 21, 'Тихонов', 'Денис', 'Михайлович', 4),
(17, 21, 'Васильева', 'Людмила', 'Сергеевна', 4),
(18, 21, 'Шевченко', 'Андрей', 'Станиславович', 4),
(16, 21, 'Лапина', 'Виктория', 'Николаевна', 4),
(18, 21, 'Горбунова', 'Анна', 'Дмитриевна', 4),
(17, 21, 'Федотов', 'Ярослав', 'Александрович', 4),
(18, 21, 'Шестакова', 'Евдокия', 'Владимировна', 4),
(16, 21, 'Дмитриев', 'Иван', 'Александрович', 4),
(16, 21, 'Благовещенский', 'Илья', 'Юрьевич', 4),
(16, 21, 'Гришина', 'Дарья', 'Павловна', 4),
(18, 21, 'Рябков', 'Максим', 'Викторович', 4),
(16, 21, 'Смирнова', 'Светлана', 'Петровна', 4),
(18, 21, 'Тихомиров', 'Роман', 'Станиславович', 4),
(18, 21, 'Крючков', 'Никита', 'Сергеевич', 4),
(17, 21, 'Григорьева', 'Екатерина', 'Валерьевна', 4),
(18, 21, 'Фокин', 'Дмитрий', 'Григорьевич', 4),
(17, 21, 'Сизова', 'Алиса', 'Ивановна', 4);

-- Вставка студентов на 22 направление (course_id = 22, education_level = master)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(16, 22, 'Смирнов', 'Алексей', 'Игоревич', 1),
(17, 22, 'Кузнецов', 'Дмитрий', 'Владимирович', 1),
(16, 22, 'Петров', 'Иван', 'Сергеевич', 1),
(17, 22, 'Лебедев', 'Виктор', 'Петрович', 1),
(16, 22, 'Попов', 'Станислав', 'Дмитриевич', 1),
(17, 22, 'Морозов', 'Андрей', 'Иванович', 1),
(16, 22, 'Васильев', 'Николай', 'Александрович', 1),
(17, 22, 'Зайцев', 'Денис', 'Игоревич', 1),
(16, 22, 'Голубев', 'Роман', 'Анатольевич', 1),
(17, 22, 'Тимофеев', 'Сергей', 'Алексеевич', 1),
(16, 22, 'Карасева', 'Елена', 'Дмитриевна', 1),
(17, 22, 'Мельников', 'Станислав', 'Валерьевич', 1),
(16, 22, 'Алексеев', 'Никита', 'Юрьевич', 1),
(17, 22, 'Романов', 'Станислав', 'Александрович', 1),
(16, 22, 'Худяков', 'Александр', 'Игоревич', 1),
(17, 22, 'Иванов', 'Григорий', 'Романович', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(16, 22, 'Шевченко', 'Олег', 'Игоревич', 2),
(17, 22, 'Морозов', 'Виктор', 'Петрович', 2),
(16, 22, 'Лукьянов', 'Андрей', 'Юрьевич', 2),
(17, 22, 'Соловьев', 'Алексей', 'Сергеевич', 2),
(16, 22, 'Панкратов', 'Станислав', 'Дмитриевич', 2),
(17, 22, 'Коваленко', 'Оксана', 'Анатольевна', 2),
(16, 22, 'Баранов', 'Игорь', 'Александрович', 2),
(17, 22, 'Козлов', 'Сергей', 'Александрович', 2),
(16, 22, 'Сидоров', 'Андрей', 'Дмитриевич', 2),
(17, 22, 'Трошин', 'Роман', 'Викторович', 2),
(16, 22, 'Гришин', 'Владимир', 'Сергеевич', 2),
(17, 22, 'Белов', 'Виктор', 'Романович', 2);

-- Вставка студентов на 23 направление (course_id = 23, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 23, 'Сидоренко', 'Анна', 'Петровна', 1),
(NULL, 23, 'Петров', 'Иван', 'Анатольевич', 1),
(NULL, 23, 'Шевченко', 'Ольга', 'Григорьевна', 1),
(NULL, 23, 'Кравцов', 'Максим', 'Александрович', 1),
(NULL, 23, 'Громов', 'Дмитрий', 'Игоревич', 1),
(NULL, 23, 'Алексеев', 'Иван', 'Александрович', 1),
(NULL, 23, 'Ковалев', 'Даниил', 'Сергеевич', 1),
(NULL, 23, 'Тимофеев', 'Степан', 'Дмитриевич', 1),
(NULL, 23, 'Станиславов', 'Григорий', 'Юрьевич', 1),
(NULL, 23, 'Морозов', 'Евгений', 'Анатольевич', 1),
(NULL, 23, 'Григорьев', 'Павел', 'Станиславович', 1),
(NULL, 23, 'Иванов', 'Алексей', 'Анатольевич', 1),
(NULL, 23, 'Котенко', 'Светлана', 'Викторовна', 1),
(NULL, 23, 'Костенко', 'Денис', 'Станиславович', 1),
(NULL, 23, 'Павлов', 'Михаил', 'Олегович', 1),
(NULL, 23, 'Борисенко', 'Виктория', 'Игоревна', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 23, 'Лазарев', 'Станислав', 'Николаевич', 2),
(NULL, 23, 'Сидоров', 'Денис', 'Валерьевич', 2),
(NULL, 23, 'Громов', 'Александр', 'Дмитриевич', 2),
(NULL, 23, 'Рябков', 'Кирилл', 'Петрович', 2),
(NULL, 23, 'Агафонов', 'Артем', 'Сергеевич', 2),
(NULL, 23, 'Лебедев', 'Наталья', 'Вячеславовна', 2),
(NULL, 23, 'Сиверцев', 'Максим', 'Дмитриевич', 2),
(NULL, 23, 'Шатунов', 'Игорь', 'Анатольевич', 2),
(NULL, 23, 'Гончарова', 'Светлана', 'Викторовна', 2),
(NULL, 23, 'Николаев', 'Игорь', 'Игоревич', 2),
(NULL, 23, 'Чаплига', 'Мария', 'Александровна', 2),
(NULL, 23, 'Кочев', 'Дмитрий', 'Игоревич', 2),
(NULL, 23, 'Коваленко', 'Татьяна', 'Владимировна', 2),
(NULL, 23, 'Шаповал', 'Олег', 'Александрович', 2),
(NULL, 23, 'Демиденко', 'Николай', 'Александрович', 2),
(NULL, 23, 'Глушенко', 'Геннадий', 'Анатольевич', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(16, 23, 'Соколов', 'Анна', 'Александровна', 3),
(17, 23, 'Митрофанов', 'Владимир', 'Анатольевич', 3),
(16, 23, 'Лебедев', 'Анатолий', 'Игоревич', 3),
(17, 23, 'Заречная', 'Виктория', 'Павловна', 3),
(16, 23, 'Мельников', 'Олег', 'Игоревич', 3),
(17, 23, 'Голубев', 'Петр', 'Станиславович', 3),
(16, 23, 'Лазарев', 'Степан', 'Анатольевич', 3),
(17, 23, 'Королев', 'Александр', 'Сергеевич', 3),
(16, 23, 'Чумаков', 'Алексей', 'Николаевич', 3),
(17, 23, 'Кравцов', 'Игорь', 'Анатольевич', 3),
(16, 23, 'Копылов', 'Дмитрий', 'Анатольевич', 3),
(17, 23, 'Грибов', 'Станислав', 'Сергеевич', 3),
(16, 23, 'Кудрявцев', 'Павел', 'Станиславович', 3),
(17, 23, 'Молотов', 'Виктор', 'Игоревич', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(16, 23, 'Полищук', 'Оксана', 'Вячеславовна', 4),
(17, 23, 'Хроменко', 'Игорь', 'Алексеевич', 4),
(16, 23, 'Савченко', 'Анастасия', 'Олеговна', 4),
(17, 23, 'Сурков', 'Александр', 'Алексеевич', 4),
(16, 23, 'Бондар', 'Николай', 'Петрович', 4),
(17, 23, 'Ляшенко', 'Дмитрий', 'Геннадьевич', 4),
(16, 23, 'Петренко', 'Анатолий', 'Викторович', 4),
(17, 23, 'Филонов', 'Максим', 'Дмитриевич', 4),
(18, 23, 'Басов', 'Кирилл', 'Олегович', 4),
(16, 23, 'Костенко', 'Светлана', 'Дмитриевна', 4),
(17, 23, 'Бондаренко', 'Екатерина', 'Петровна', 4),
(16, 23, 'Ласкин', 'Валерий', 'Станиславович', 4),
(17, 23, 'Данилов', 'Сергей', 'Игоревич', 4),
(16, 23, 'Терещенко', 'Ирина', 'Станиславовна', 4),
(17, 23, 'Ребров', 'Александр', 'Игоревич', 4);

-- Вставка студентов на 24 направление (course_id = 24, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 24, 'Солдатенко', 'Анастасия', 'Дмитриевна', 1),
(NULL, 24, 'Ларин', 'Игорь', 'Олегович', 1),
(NULL, 24, 'Пинчук', 'Елена', 'Станиславовна', 1),
(NULL, 24, 'Волков', 'Анатолий', 'Сергеевич', 1),
(NULL, 24, 'Чубенко', 'Наталья', 'Сергеевна', 1),
(NULL, 24, 'Копылов', 'Роман', 'Александрович', 1),
(NULL, 24, 'Гончаров', 'Данила', 'Викторович', 1),
(NULL, 24, 'Рыбалко', 'Татьяна', 'Александровна', 1),
(NULL, 24, 'Ковальчук', 'Алексей', 'Игоревич', 1),
(NULL, 24, 'Судько', 'Николай', 'Сергеевич', 1),
(NULL, 24, 'Гетман', 'Виктор', 'Анатольевич', 1),
(NULL, 24, 'Федоров', 'Анастасия', 'Павловна', 1),
(NULL, 24, 'Кудрявцева', 'Валентина', 'Ивановна', 1),
(NULL, 24, 'Скворцов', 'Кирилл', 'Олегович', 1),
(NULL, 24, 'Киселев', 'Олег', 'Викторович', 1),
(NULL, 24, 'Багдасаров', 'Станислав', 'Петрович', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 24, 'Литвинов', 'Никита', 'Олегович', 2),
(NULL, 24, 'Федотова', 'Светлана', 'Анатольевна', 2),
(NULL, 24, 'Шевчук', 'Денис', 'Станиславович', 2),
(NULL, 24, 'Могилевская', 'Анастасия', 'Геннадьевна', 2),
(NULL, 24, 'Харченко', 'Ирина', 'Александровна', 2),
(NULL, 24, 'Головко', 'Геннадий', 'Игоревич', 2),
(NULL, 24, 'Тихонов', 'Сергей', 'Анатольевич', 2),
(NULL, 24, 'Мельникова', 'Екатерина', 'Викторовна', 2),
(NULL, 24, 'Водяной', 'Анатолий', 'Станиславович', 2),
(NULL, 24, 'Дорохова', 'Мария', 'Сергеевна', 2),
(NULL, 24, 'Якушев', 'Григорий', 'Николаевич', 2),
(NULL, 24, 'Коробка', 'Станислав', 'Владимирович', 2),
(NULL, 24, 'Маркелов', 'Александр', 'Владимирович', 2),
(NULL, 24, 'Рябоконь', 'Петр', 'Дмитриевич', 2),
(NULL, 24, 'Савельев', 'Александр', 'Игоревич', 2),
(NULL, 24, 'Литвинов', 'Антон', 'Геннадьевич', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(16, 24, 'Бурков', 'Александр', 'Игоревич', 3),
(17, 24, 'Савенко', 'Евгений', 'Викторович', 3),
(16, 24, 'Степанов', 'Денис', 'Владимирович', 3),
(17, 24, 'Червоненко', 'Сергей', 'Станиславович', 3),
(16, 24, 'Рубцов', 'Никита', 'Дмитриевич', 3),
(18, 24, 'Лемешко', 'Павел', 'Владимирович', 3),
(16, 24, 'Гасанов', 'Олег', 'Станиславович', 3),
(17, 24, 'Коваленко', 'Дмитрий', 'Сергеевич', 3),
(16, 24, 'Яровой', 'Виктор', 'Александрович', 3),
(17, 24, 'Семёнов', 'Станислав', 'Анатольевич', 3),
(16, 24, 'Бондаренко', 'Михаил', 'Игоревич', 3),
(17, 24, 'Головко', 'Татьяна', 'Олеговна', 3),
(16, 24, 'Шевченко', 'Оксана', 'Дмитриевна', 3),
(17, 24, 'Смирнов', 'Иван', 'Сергеевич', 3),
(18, 24, 'Ковальчук', 'Анна', 'Николаевна', 3),
(17, 24, 'Мельников', 'Дмитрий', 'Олегович', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(16, 24, 'Тимошенко', 'Александр', 'Дмитриевич', 4),
(17, 24, 'Шевченко', 'Николай', 'Петрович', 4),
(16, 24, 'Голубев', 'Анатолий', 'Викторович', 4),
(17, 24, 'Панасенко', 'Денис', 'Вячеславович', 4),
(18, 24, 'Червоненко', 'Светлана', 'Игоревна', 4),
(16, 24, 'Ребров', 'Кирилл', 'Александрович', 4),
(17, 24, 'Тихонов', 'Андрей', 'Дмитриевич', 4),
(16, 24, 'Тищенко', 'Иван', 'Владимирович', 4),
(17, 24, 'Сенкевич', 'Ольга', 'Романовна', 4),
(18, 24, 'Середа', 'Татьяна', 'Валерьевна', 4),
(16, 24, 'Митрофанов', 'Степан', 'Станиславович', 4),
(17, 24, 'Дубровский', 'Станислав', 'Викторович', 4),
(18, 24, 'Гончар', 'Анатолий', 'Павлович', 4),
(16, 24, 'Грушевский', 'Евгений', 'Игоревич', 4),
(17, 24, 'Яровая', 'Ольга', 'Павловна', 4),
(18, 24, 'Костюк', 'Александр', 'Викторович', 4);

-- Вставка студентов на 25 направление (course_id = 25, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 25, 'Сидорова', 'Ирина', 'Александровна', 1),
(NULL, 25, 'Козлова', 'Анастасия', 'Дмитриевна', 1),
(NULL, 25, 'Коваленко', 'Оксана', 'Сергеевна', 1),
(NULL, 25, 'Браун', 'Пуран', 'Рамешович', 1),
(NULL, 25, 'Литвинова', 'Елена', 'Петровна', 1),
(NULL, 25, 'Панченко', 'Евгения', 'Игоревна', 1),
(NULL, 25, 'Маликова', 'Татьяна', 'Станиславовна', 1),
(NULL, 25, 'Тимошенко', 'Наталья', 'Владимировна', 1),
(NULL, 25, 'Кузнецова', 'Мария', 'Игоревна', 1),
(NULL, 25, 'Суркова', 'Светлана', 'Александровна', 1),
(NULL, 25, 'Гончарова', 'Алена', 'Дмитриевна', 1),
(NULL, 25, 'Иванова', 'Екатерина', 'Сергеевна', 1),
(NULL, 25, 'Герасимова', 'Юлия', 'Станиславовна', 1),
(NULL, 25, 'Зайцева', 'Анастасия', 'Дмитриевна', 1),
(NULL, 25, 'Шевченко', 'Виктория', 'Геннадьевна', 1),
(NULL, 25, 'Шафаренко', 'Светлана', 'Геннадьевна', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 25, 'Петрова', 'Александра', 'Анатольевна', 2),
(NULL, 25, 'Дьякова', 'Анна', 'Александровна', 2),
(NULL, 25, 'Воробьева', 'Кирилла', 'Игоревич', 2),
(NULL, 25, 'Бенедиктова', 'Алина', 'Александровна', 2),
(NULL, 25, 'Гусева', 'Роман', 'Павлович', 2),
(NULL, 25, 'Головина', 'Екатерина', 'Дмитриевна', 2),
(NULL, 25, 'Шаповал', 'Анастасия', 'Геннадьевна', 2),
(NULL, 25, 'Руденко', 'Станислава', 'Анатольевна', 2),
(NULL, 25, 'Тихонова', 'Валерия', 'Станиславовна', 2),
(NULL, 25, 'Курченко', 'Ирина', 'Анатольевна', 2),
(NULL, 25, 'Костенко', 'Николай', 'Игоревич', 2),
(NULL, 25, 'Кузьмичёва', 'Наталья', 'Олеговна', 2),
(NULL, 25, 'Рябова', 'Денис', 'Игоревич', 2),
(NULL, 25, 'Сергеевна', 'Анна', 'Олеговна', 2),
(NULL, 25, 'Сорокина', 'Екатерина', 'Алексеевна', 2),
(NULL, 25, 'Смирнова', 'Дмитрий', 'Анатольевич', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(19, 25, 'Митрофанов', 'Александр', 'Игоревич', 3),
(20, 25, 'Семенова', 'Мария', 'Олеговна', 3),
(19, 25, 'Герасимова', 'Олеся', 'Дмитриевна', 3),
(21, 25, 'Афанасьев', 'Рамеш', 'Станиславович', 3),
(19, 25, 'Лебедева', 'Ольга', 'Викторовна', 3),
(21, 25, 'Фомичева', 'Ксения', 'Анатольевна', 3),
(20, 25, 'Гончарова', 'Ксения', 'Игоревна', 3),
(19, 25, 'Шабанова', 'Евгения', 'Николаевна', 3),
(20, 25, 'Соболева', 'Татьяна', 'Александровна', 3),
(19, 25, 'Тимошенко', 'Станислав', 'Олегович', 3),
(20, 25, 'Бакуменко', 'Владислава', 'Анатольевна', 3),
(19, 25, 'Левченко', 'Светлана', 'Дмитриевна', 3),
(20, 25, 'Шевченко', 'Николай', 'Олегович', 3),
(20, 25, 'Копылова', 'Анастасия', 'Сергеевна', 3),
(20, 25, 'Ажадов', 'Раджеш', 'Иванович', 3),
(20, 25, 'Молотова', 'Анна', 'Станиславовна', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(19, 25, 'Дорохова', 'Николай', 'Сергеевич', 4),
(20, 25, 'Бурлакова', 'Андрея', 'Олеговна', 4),
(19, 25, 'Петрова', 'Ирина', 'Сергеевна', 4),
(20, 25, 'Литвинов', 'Александр', 'Игоревич', 4),
(21, 25, 'Круглова', 'Мария', 'Александровна', 4),
(20, 25, 'Бондаренко', 'Игорь', 'Анатольевич', 4),
(19, 25, 'Ярмоленко', 'Анна', 'Дмитриевна', 4),
(20, 25, 'Агаджанов', 'Рави', 'Петрович', 4),
(20, 25, 'Александрова', 'Станислава', 'Викторовна', 4),
(19, 25, 'Малышева', 'Евгения', 'Станиславовна', 4),
(19, 25, 'Шевченко', 'Екатерина', 'Геннадьевна', 4),
(20, 25, 'Семенова', 'Иван', 'Дмитриевич', 4),
(20, 25, 'Костюк', 'Татьяна', 'Игоревна', 4),
(20, 25, 'Сенкевич', 'Максим', 'Александрович', 4),
(19, 25, 'Тихомиров', 'Лев', 'Алексеевич', 4),
(20, 25, 'Чекмарева', 'Ольга', 'Геннадьевна', 4);

-- Вставка студентов на 26 направление (course_id = 26, education_level = master)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(19, 26, 'Логинова', 'Светлана', 'Викторовна', 1),
(20, 26, 'Касаткина', 'Александра', 'Павловна', 1),
(19, 26, 'Заварзина', 'Евгения', 'Игоревна', 1),
(21, 26, 'Ачалкова', 'Рамеша', 'Станиславович', 1),
(20, 26, 'Топоркова', 'Мария', 'Анатольевна', 1),
(20, 26, 'Миронова', 'Татьяна', 'Сергеевна', 1),
(19, 26, 'Гладкий', 'Тимур', 'Алексеевич', 1),
(21, 26, 'Савельева', 'Наталья', 'Олеговна', 1),
(19, 26, 'Баранов', 'Владислав', 'Александрович', 1),
(19, 26, 'Ларина', 'Даниела', 'Раджеславовна', 1),
(19, 26, 'Крыжановская', 'Оксана', 'Викторовна', 1),
(21, 26, 'Снежная', 'Евгения', 'Петровна', 1),
(21, 26, 'Гришакова', 'Елена', 'Станиславовна', 1),
(21, 26, 'Смирнова', 'Светлана', 'Геннадьевна', 1),
(21, 26, 'Кравченко', 'Алина', 'Станиславовна', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(19, 26, 'Клюева', 'Марина', 'Станиславовна', 2),
(20, 26, 'Панова', 'Алена', 'Дмитриевна', 2),
(20, 26, 'Кириченко', 'Оксана', 'Анатольевна', 2),
(19, 26, 'Фомина', 'Наталья', 'Алексеевна', 2),
(21, 26, 'Заяц', 'Александр', 'Викторович', 2),
(21, 26, 'Лукина', 'Татьяна', 'Павловна', 2),
(19, 26, 'Соловьева', 'Лилия', 'Николаевна', 2),
(20, 26, 'Лобанова', 'Светлана', 'Александровна', 2),
(19, 26, 'Романова', 'Дмитрий', 'Станиславович', 2),
(20, 26, 'Завьялова', 'Анастасия', 'Игоревна', 2);

-- Вставка студентов на 27 направление (course_id = 27, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 27, 'Скворцова', 'Екатерина', 'Дмитриевна', 1),
(NULL, 27, 'Литвинова', 'Ирина', 'Викторовна', 1),
(NULL, 27, 'Коваленко', 'Светлана', 'Анатольевна', 1),
(NULL, 27, 'Червоненко', 'Дмитрий', 'Станиславович', 1),
(NULL, 27, 'Малышев', 'Никита', 'Станиславович', 1),
(NULL, 27, 'Деревянко', 'Ольга', 'Алексеевна', 1),
(NULL, 27, 'Ярошенко', 'Татьяна', 'Викторовна', 1),
(NULL, 27, 'Промыслов', 'Виктор', 'Иванович', 1),
(NULL, 27, 'Дмитриев', 'Анатолий', 'Петрович', 1),
(NULL, 27, 'Горбунов', 'Станислав', 'Владимирович', 1),
(NULL, 27, 'Костенко', 'Анна', 'Николаевна', 1),
(NULL, 27, 'Кравец', 'Алексей', 'Дмитриевич', 1),
(NULL, 27, 'Тетерев', 'Олег', 'Игоревич', 1),
(NULL, 27, 'Чабан', 'Елена', 'Сергеевна', 1),
(NULL, 27, 'Лупенко', 'Светлана', 'Владимировна', 1),
(NULL, 27, 'Сидоренко', 'Денис', 'Анатольевич', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 27, 'Демиденко', 'Тимур', 'Рамешович', 2),
(NULL, 27, 'Гладков', 'Роман', 'Анатольевич', 2),
(NULL, 27, 'Шилова', 'Валентина', 'Станиславовна', 2),
(NULL, 27, 'Зубкова', 'Александр', 'Геннадьевич', 2),
(NULL, 27, 'Куликова', 'Анна', 'Олеговна', 2),
(NULL, 27, 'Котова', 'Сергей', 'Олегович', 2),
(NULL, 27, 'Дейнека', 'Анастасия', 'Владимировна', 2),
(NULL, 27, 'Кузнецов', 'Никита', 'Петрович', 2),
(NULL, 27, 'Лукьянова', 'Светлана', 'Дмитриевна', 2),
(NULL, 27, 'Дубровская', 'Татьяна', 'Николаевна', 2),
(NULL, 27, 'Долгих', 'Алексей', 'Игоревич', 2),
(NULL, 27, 'Бабичева', 'Надежда', 'Викторовна', 2),
(NULL, 27, 'Кайгородова', 'Григорий', 'Александрович', 2),
(NULL, 27, 'Пономарева', 'Светлана', 'Павловна', 2),
(NULL, 27, 'Атаева', 'Кирилл', 'Анатольевич', 2),
(NULL, 27, 'Агаева', 'Илья', 'Геннадьевич', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(19, 27, 'Михайлова', 'Иванна', 'Станиславовна', 3),
(21, 27, 'Тарасова', 'Светлана', 'Викторовна', 3),
(19, 27, 'Кузьмина', 'Оксана', 'Дмитриевна', 3),
(20, 27, 'Трофимова', 'Ольга', 'Анатольевна', 3),
(19, 27, 'Павленко', 'Татьяна', 'Игоревна', 3),
(20, 27, 'Степаненко', 'Ирина', 'Владимировна', 3),
(21, 27, 'Носкова', 'Кирилла', 'Петровна', 3),
(20, 27, 'Калинина', 'Мария', 'Станиславовна', 3),
(21, 27, 'Афанасьева', 'Раджеш', 'Викторовна', 3),
(20, 27, 'Никонорова', 'Лариса', 'Петровна', 3),
(20, 27, 'Еременко', 'Анна', 'Александровна', 3),
(21, 27, 'Кизилова', 'Дмитрий', 'Анатольевич', 3),
(20, 27, 'Сосновская', 'Тимура', 'Геннадьевна', 3),
(19, 27, 'Панасенко', 'Станислава', 'Олеговна', 3),
(19, 27, 'Федорова', 'Евгения', 'Дмитриевна', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(19, 27, 'Громова', 'Анна', 'Александровна', 4),
(21, 27, 'Глухова', 'Никита', 'Павлович', 4),
(19, 27, 'Кубракова', 'Дмитрия', 'Олеговна', 4),
(21, 27, 'Лихачева', 'Евгения', 'Станиславовна', 4),
(19, 27, 'Мартынова', 'Анна', 'Геннадьевна', 4),
(20, 27, 'Ульянова', 'Александр', 'Викторович', 4),
(20, 27, 'Чередник', 'Мария', 'Алексеевна', 4),
(20, 27, 'Пудовкин', 'Сергей', 'Дмитриевич', 4),
(19, 27, 'Сергеевна', 'Даша', 'Станиславовна', 4),
(20, 27, 'Чепыга', 'Станислав', 'Павлович', 4),
(19, 27, 'Зубарева', 'Анастасия', 'Игоревна', 4),
(21, 27, 'Дятлов', 'Алексей', 'Петрович', 4),
(21, 27, 'Чудова', 'Светлана', 'Александровна', 4),
(21, 27, 'Ведерникова', 'Лариса', 'Николаевна', 4),
(21, 27, 'Борисова', 'Елена', 'Станиславовна', 4),
(20, 27, 'Захарова', 'Ксения', 'Анатольевна', 4);


-- Вставка студентов на 28 направление (course_id = 28, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 28, 'Афанасиева', 'Дарья', 'Игоревна', 1),
(NULL, 28, 'Бекетова', 'Алия', 'Дмитриевна', 1),
(NULL, 28, 'Куриленко', 'Светлана', 'Викторовна', 1),
(NULL, 28, 'Тимошенко', 'Иван', 'Станиславович', 1),
(NULL, 28, 'Шевченко', 'Наталья', 'Анатольевна', 1),
(NULL, 28, 'Насибова', 'Рустам', 'Ильфатович', 1),
(NULL, 28, 'Ким', 'Соня', 'Валерьевна', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 28, 'Молдаван', 'Никита', 'Александрович', 2),
(NULL, 28, 'Костюченко', 'Татьяна', 'Сергеевна', 2),
(NULL, 28, 'Григорьева', 'София', 'Петровна', 2),
(NULL, 28, 'Гуляев', 'Владислав', 'Романович', 2),
(NULL, 28, 'Сидорова', 'Анна', 'Викторовна', 2),
(NULL, 28, 'Журова', 'Екатерина', 'Игоревна', 2),
(NULL, 28, 'Хан', 'Азамат', 'Серикович', 2),
(NULL, 28, 'Садова', 'Вероника', 'Денисовна', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(22, 28, 'Малышева', 'Лилия', 'Станиславовна', 3),
(22, 28, 'Миронов', 'Георгий', 'Станиславович', 3),
(23, 28, 'Гайдаенко', 'Анжела', 'Анатольевна', 3),
(22, 28, 'Султанов', 'Арсен', 'Рустамович', 3),
(23, 28, 'Яковлева', 'Евгения', 'Сергеевна', 3),
(23, 28, 'Долгушина', 'Татьяна', 'Викторовна', 3),
(22, 28, 'Павлов', 'Роман', 'Олегович', 3),
(22, 28, 'Давыдова', 'Ксения', 'Игоревна', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(22, 28, 'Смирнов', 'Алексей', 'Дмитриевич', 4),
(22, 28, 'Курбанов', 'Лейла', 'Анаровна', 4),
(23, 28, 'Калинин', 'Денис', 'Александрович', 4),
(24, 28, 'Степанова', 'Надежда', 'Викторовна', 4),
(23, 28, 'Жуков', 'Тимур', 'Агасиевич', 4),
(23, 28, 'Лимонова', 'Софья', 'Анатольевна', 4),
(22, 28, 'Левчук', 'Сергей', 'Дмитриевич', 4),
(23, 28, 'Садыкова', 'Ася', 'Тимуровна', 4);

-- Вставка студентов на 29 направление (course_id = 29, education_level = master)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(22, 29, 'Калинина', 'Евгения', 'Александровна', 1),
(23, 29, 'Мамедова', 'Нигяр', 'Сулеймановна', 1),
(22, 29, 'Савченко', 'Алексей', 'Олегович', 1),
(22, 29, 'Батырова', 'Нурия', 'Мажитовна', 1),
(23, 29, 'Дудкина', 'Татьяна', 'Игоревна', 1),
(22, 29, 'Насипова', 'Далия', 'Хабировна', 1),
(22, 29, 'Гончарова', 'Светлана', 'Петровна', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(22, 29, 'Пупырева', 'Ксения', 'Валерьевна', 2),
(23, 29, 'Петров', 'Игорь', 'Станиславович', 2),
(22, 29, 'Гервасьев', 'Алексей', 'Игоревич', 2),
(22, 29, 'Чалова', 'Анастасия', 'Романовна', 2),
(23, 29, 'Фролова', 'Дина', 'Сергеевна', 2),
(24, 29, 'Сахнов', 'Дмитрий', 'Олегович', 2);

-- Вставка студентов на 30 направление (course_id = 30, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 30, 'Джураев', 'Илхам', 'Рамилевич', 1),
(NULL, 30, 'Исаев', 'Никита', 'Степанович', 1),
(NULL, 30, 'Давыдова', 'Лилия', 'Викторовна', 1),
(NULL, 30, 'Капустин', 'Петр', 'Дмитриевич', 1),
(NULL, 30, 'Ржевская', 'Надежда', 'Викторовна', 1),
(NULL, 30, 'Соболева', 'Татьяна', 'Павловна', 1),
(NULL, 30, 'Курбанова', 'Алиса', 'Рамилевна', 1),
(NULL, 30, 'Акимов', 'Роман', 'Вячеславович', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 30, 'Костенко', 'Оксана', 'Геннадиевна', 2),
(NULL, 30, 'Кадыров', 'Тимур', 'Станиславович', 2),
(NULL, 30, 'Никитина', 'Светлана', 'Викторовна', 2),
(NULL, 30, 'Дмитриева', 'Елизавета', 'Алексеевна', 2),
(NULL, 30, 'Насиров', 'Сарвар', 'Азаматович', 2),
(NULL, 30, 'Тищенко', 'Игорь', 'Александрович', 2),
(NULL, 30, 'Мещерякова', 'Ксения', 'Сергеевна', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(22, 30, 'Небелицкая', 'Елена', 'Дмитриевна', 3),
(24, 30, 'Сабиров', 'Азамат', 'Геннадиевич', 3),
(24, 30, 'Аналов', 'Дмитрий', 'Сергеевич', 3),
(23, 30, 'Иванова', 'Мария', 'Александровна', 3),
(22, 30, 'Топорова', 'Вера', 'Игоревна', 3),
(23, 30, 'Бабичев', 'Артем', 'Дмитриевич', 3),
(22, 30, 'Зайцева', 'Анна', 'Александровна', 3),
(23, 30, 'Кириллова', 'Анастасия', 'Романовна', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(22, 30, 'Синельников', 'Станислав', 'Павлович', 4),
(23, 30, 'Казанцева', 'Анастасия', 'Игоревна', 4),
(24, 30, 'Устинов', 'Виктор', 'Михайлович', 4),
(24, 30, 'Соболева', 'Ольга', 'Дмитриевна', 4),
(24, 30, 'Мороз', 'Анастасия', 'Александровна', 4),
(22, 30, 'Григорьев', 'Марк', 'Иванович', 4);


-- Вставка студентов на 31 направление (course_id = 31, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 31, 'Аминова', 'Рашида', 'Маратовна', 1),
(NULL, 31, 'Каландарова', 'Мадина', 'Эльдаровна', 1),
(NULL, 31, 'Татаринова', 'Лилия', 'Игоревна', 1),
(NULL, 31, 'Смирнова', 'Светлана', 'Валерьевна', 1),
(NULL, 31, 'Нуруллин', 'Фарид', 'Ринатович', 1),
(NULL, 31, 'Давыдов', 'Алексей', 'Дмитриевич', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 31, 'Кириллов', 'Сергей', 'Александрович', 2),
(NULL, 31, 'Воронова', 'Мария', 'Александровна', 2),
(NULL, 31, 'Иванова', 'Татьяна', 'Сергеевна', 2),
(NULL, 31, 'Алиева', 'Наргиза', 'Эркиновна', 2),
(NULL, 31, 'Сердюкова', 'Вера', 'Игоревна', 2),
(NULL, 31, 'Бекетова', 'Наталья', 'Петровна', 2),
(NULL, 31, 'Шарафутдинова', 'Зульфия', 'Рамилевна', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(25, 31, 'Соколов', 'Дмитрий', 'Александрович', 3),
(26, 31, 'Доронина', 'Елизавета', 'Игоревна', 3),
(25, 31, 'Шевченко', 'Виктор', 'Николаевич', 3),
(25, 31, 'Кузнецова', 'Полина', 'Вячеславовна', 3),
(26, 31, 'Никитин', 'Максим', 'Станиславович', 3),
(25, 31, 'Афанасьева', 'Елена', 'Михайловна', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(26, 31, 'Федорова', 'Анастасия', 'Дмитриевна', 4),
(26, 31, 'Дьячкова', 'Татьяна', 'Викторовна', 4),
(25, 31, 'Горшкова', 'Ольга', 'Александровна', 4),
(25, 31, 'Набиев', 'Руслан', 'Сергеевич', 4);

-- Вставка студентов на 32 направление (course_id = 32, education_level = master)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(25, 32, 'Сахарова', 'Мария', 'Геннадиевна', 1),
(26, 32, 'Григорьев', 'Глеб', 'Александрович', 1),
(25, 32, 'Мусаев', 'Рустам', 'Ашрафович', 1),
(26, 32, 'Костина', 'Светлана', 'Анатольевна', 1),
(25, 32, 'Тимурова', 'Фарида', 'Эльдаровна', 1),
(25, 32, 'Калюжная', 'Анна', 'Александровна', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(26, 32, 'Егоров', 'Денис', 'Игоревич', 2),
(25, 32, 'Шпаков', 'Артем', 'Станиславович', 2),
(26, 32, 'Мухамедова', 'Алия', 'Султановна', 2),
(25, 32, 'Шишко', 'Роман', 'Михайлович', 2),
(26, 32, 'Семенова', 'Екатерина', 'Викторовна', 2);

-- Вставка студентов на 33 направление (course_id = 33, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 33, 'Токарев', 'Игорь', 'Станиславович', 1),
(NULL, 33, 'Зиновьева', 'Олеся', 'Сергеевна', 1),
(NULL, 33, 'Никифоров', 'Анатолий', 'Александрович', 1),
(NULL, 33, 'Шафаренко', 'Денис', 'Романович', 1),
(NULL, 33, 'Громова', 'Вероника', 'Игоревна', 1),
(NULL, 33, 'Шукуров', 'Зарецкий', 'Леонидович', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 33, 'Лисовский', 'Никита', 'Викторович', 2),
(NULL, 33, 'Танасевич', 'Маргарита', 'Станиславовна', 2),
(NULL, 33, 'Польских', 'Ярослав', 'Александрович', 2),
(NULL, 33, 'Бахарев', 'Дмитрий', 'Игоревич', 2),
(NULL, 33, 'Лепешкина', 'Анастасия', 'Викторовна', 2),
(NULL, 33, 'Косарев', 'Олег', 'Вячеславович', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(25, 33, 'Сарапулова', 'Аделина', 'Дамировна', 3),
(26, 33, 'Власов', 'Александр', 'Андреевич', 3),
(26, 33, 'Апальков', 'Дмитрий', 'Михайлович', 3),
(26, 33, 'Шалимова', 'Кристина', 'Викторовна', 3),
(25, 33, 'Хусаинов', 'Рамиль', 'Шамилевич', 3),
(25, 33, 'Занизов', 'Денис', 'Сергеевич', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(25, 33, 'Гордеев', 'Игорь', 'Станиславович', 4),
(26, 33, 'Токарев', 'Антон', 'Алексеевич', 4),
(25, 33, 'Шахов', 'Сергей', 'Дмитриевич', 4),
(26, 33, 'Богданова', 'Вероника', 'Олеговна', 4);

-- Вставка студентов на 31 направление (course_id = 31, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 31, 'Шевченко', 'Ольга', 'Станиславовна', 1),
(NULL, 31, 'Солдатов', 'Игорь', 'Дмитриевич', 1),
(NULL, 31, 'Баранов', 'Максим', 'Александрович', 1),
(NULL, 31, 'Багирова', 'Даша', 'Ильинична', 1),
(NULL, 31, 'Калужская', 'Анна', 'Алексеевна', 1),
(NULL, 31, 'Супрун', 'Евгений', 'Игоревич', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 31, 'Фетисова', 'Мария', 'Станиславовна', 2),
(NULL, 31, 'Дьячков', 'Станислав', 'Романович', 2),
(NULL, 31, 'Тишина', 'Светлана', 'Анатольевна', 2),
(NULL, 31, 'Афанасьев', 'Павел', 'Геннадиевич', 2),
(NULL, 31, 'Смирнов', 'Иван', 'Денисович', 2),
(NULL, 31, 'Захарова', 'Екатерина', 'Викторовна', 2),
(NULL, 31, 'Руденко', 'Татьяна', 'Алексеевна', 2),
(NULL, 31, 'Лисицын', 'Константин', 'Александрович', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(25, 31, 'Сычев', 'Анатолий', 'Сергеевич', 3),
(26, 31, 'Лосев', 'Олег', 'Дмитриевич', 3),
(25, 31, 'Рябова', 'Полина', 'Вячеславовна', 3),
(25, 31, 'Широков', 'Федор', 'Иванович', 3),
(26, 31, 'Соловьев', 'Дмитрий', 'Александрович', 3),
(25, 31, 'Трошина', 'Валентина', 'Сергеевна', 3),
(26, 31, 'Гончарова', 'Дарья', 'Денисовна', 3),
(25, 31, 'Микрюков', 'Данила', 'Денисович', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(26, 31, 'Дубровин', 'Станислав', 'Иванович', 4),
(26, 31, 'Трифонов', 'Евгений', 'Александрович', 4),
(25, 31, 'Долгих', 'Александр', 'Сергеевич', 4),
(25, 31, 'Лещенко', 'Надежда', 'Владимировна', 4),
(26, 31, 'Соколовская', 'Маргарита', 'Федоровна', 4),
(25, 31, 'Тихонов', 'Илья', 'Андреевич', 4);

-- Вставка студентов на 32 направление (course_id = 32, education_level = master)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(25, 32, 'Ковальчук', 'Светлана', 'Игоревна', 1),
(26, 32, 'Тарасенко', 'Роман', 'Николаевич', 1),
(25, 32, 'Садчиков', 'Денис', 'Станиславович', 1),
(26, 32, 'Ярошенко', 'Тамара', 'Анатольевна', 1),
(25, 32, 'Завьялов', 'Никита', 'Сергеевич', 1),
(25, 32, 'Семена', 'Ирина', 'Станиславовна', 1),
(25, 32, 'Боровик', 'Мария', 'Дмитриевна', 1),
(26, 32, 'Костромская', 'Надежда', 'Валентиновна', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(25, 32, 'Беляев', 'Михаил', 'Олегович', 2),
(26, 32, 'Лавров', 'Кирилл', 'Игоревич', 2),
(26, 32, 'Горбунов', 'Станислав', 'Игоревич', 2),
(25, 32, 'Остапенко', 'Елена', 'Павловна', 2),
(25, 32, 'Ефимова', 'Татьяна', 'Алексеевна', 2),
(25, 32, 'Савельев', 'Владислав', 'Юрьевич', 2);

-- Вставка студентов на 33 направление (course_id = 33, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 33, 'Павленко', 'Елизавета', 'Анатольевна', 1),
(NULL, 33, 'Николаев', 'Вячеслав', 'Сергеевич', 1),
(NULL, 33, 'Куприн', 'Семен', 'Иванович', 1),
(NULL, 33, 'Еременко', 'Арина', 'Дмитриевна', 1),
(NULL, 33, 'Рябцев', 'Даниил', 'Романович', 1),
(NULL, 33, 'Гулькова', 'Лидия', 'Станиславовна', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 33, 'Шереметьев', 'Александр', 'Валерьевич', 2),
(NULL, 33, 'Босова', 'Анастасия', 'Владимировна', 2),
(NULL, 33, 'Исаев', 'Артем', 'Петрович', 2),
(NULL, 33, 'Левин', 'Виктор', 'Станиславович', 2),
(NULL, 33, 'Никифоров', 'Станислав', 'Александрович', 2),
(NULL, 33, 'Белоусова', 'Татьяна', 'Игоревна', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(25, 33, 'Петров', 'Игорь', 'Викторович', 3),
(26, 33, 'Ширшов', 'Денис', 'Александрович', 3),
(25, 33, 'Тимченко', 'Анастасия', 'Андреевна', 3),
(26, 33, 'Лукин', 'Станислав', 'Сергеевич', 3),
(25, 33, 'Гвоздев', 'Алексей', 'Игоревич', 3),
(25, 33, 'Кошечкин', 'Валерий', 'Анатольевич', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(26, 33, 'Мальцев', 'Анатолий', 'Николаевич', 4),
(25, 33, 'Сухов', 'Игорь', 'Денисович', 4),
(25, 33, 'Карапетян', 'Евгений', 'Артемович', 4),
(26, 33, 'Кудряшов', 'Дмитрий', 'Станиславович', 4),
(25, 33, 'Ларин', 'Марк', 'Сергеевич', 4);

-- Вставка студентов на 34 направление (course_id = 34, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 34, 'Митрофанова', 'Анастасия', 'Александровна', 1),
(NULL, 34, 'Голубев', 'Максим', 'Сергеевич', 1),
(NULL, 34, 'Саликов', 'Евгений', 'Иванович', 1),
(NULL, 34, 'Курочкин', 'Тимур', 'Дмитриевич', 1),
(NULL, 34, 'Драгунов', 'Илья', 'Викторович', 1),
(NULL, 34, 'Анисимова', 'Людмила', 'Геннадиевна', 1),
(NULL, 34, 'Федотов', 'Александр', 'Игоревич', 1),
(NULL, 34, 'Яковлева', 'Екатерина', 'Николаевна', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 34, 'Романов', 'Кирилл', 'Станиславович', 2),
(NULL, 34, 'Субботина', 'Светлана', 'Викторовна', 2),
(NULL, 34, 'Боброва', 'Олеся', 'Дмитриевна', 2),
(NULL, 34, 'Дорошенко', 'Владимир', 'Александрович', 2),
(NULL, 34, 'Скворцов', 'Никита', 'Михайлович', 2),
(NULL, 34, 'Семенова', 'Дарья', 'Алексеевна', 2),
(NULL, 34, 'Серов', 'Филипп', 'Сергеевич', 2),
(NULL, 34, 'Кравцов', 'Роман', 'Геннадиевич', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(27, 34, 'Гвоздева', 'Виктория', 'Анатольевна', 3),
(29, 34, 'Левченко', 'Елизавета', 'Денисовна', 3),
(27, 34, 'Прокопенко', 'Дмитрий', 'Сергеевич', 3),
(28, 34, 'Шевченко', 'Анастасия', 'Викторовна', 3),
(27, 34, 'Тимошенко', 'Артем', 'Игоревич', 3),
(28, 34, 'Чередниченко', 'Анатолий', 'Романович', 3),
(29, 34, 'Диденко', 'Григорий', 'Станиславович', 3),
(27, 34, 'Ломов', 'Александр', 'Валерьевич', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(27, 34, 'Гончарова', 'Мария', 'Викторовна', 4),
(29, 34, 'Сергеева', 'Татьяна', 'Станиславовна', 4),
(28, 34, 'Шаповалов', 'Степан', 'Александрович', 4),
(29, 34, 'Ткаченко', 'Сергей', 'Владимирович', 4),
(27, 34, 'Симонова', 'Ирина', 'Петровна', 4),
(28, 34, 'Фролова', 'Ксения', 'Дмитриевна', 4);

-- Вставка студентов на 35 направление (course_id = 35, education_level = master)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(27, 35, 'Серебряков', 'Евгений', 'Игоревич', 1),
(28, 35, 'Ермакова', 'Людмила', 'Александровна', 1),
(29, 35, 'Бурков', 'Станислав', 'Дмитриевич', 1),
(27, 35, 'Тимофеев', 'Данила', 'Иванович', 1),
(28, 35, 'Мирошниченко', 'Анна', 'Сергеевна', 1),
(29, 35, 'Светлов', 'Николай', 'Алексеевич', 1),
(27, 35, 'Токарева', 'Татьяна', 'Ивановна', 1),
(28, 35, 'Денисенко', 'Федор', 'Станиславович', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(27, 35, 'Федоров', 'Илья', 'Павлович', 2),
(29, 35, 'Костина', 'Надежда', 'Вячеславовна', 2),
(27, 35, 'Горбатенко', 'Сергей', 'Анатольевич', 2),
(28, 35, 'Зубкова', 'Елизавета', 'Олеговна', 2),
(29, 35, 'Гришин', 'Дмитрий', 'Александрович', 2),
(28, 35, 'Тарасова', 'Юлия', 'Викторовна', 2);

-- Вставка студентов на 36 направление (course_id = 36, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 36, 'Зайцева', 'Анастасия', 'Валентиновна', 1),
(NULL, 36, 'Гринь', 'Станислав', 'Анатольевич', 1),
(NULL, 36, 'Тимошенко', 'Ирина', 'Сергеевна', 1),
(NULL, 36, 'Кузнецова', 'Мария', 'Станиславовна', 1),
(NULL, 36, 'Левков', 'Кирилл', 'Дмитриевич', 1),
(NULL, 36, 'Шинкаренко', 'Александра', 'Ивановна', 1),
(NULL, 36, 'Третьяков', 'Никита', 'Александрович', 1),
(NULL, 36, 'Бусыгина', 'Екатерина', 'Геннадиевна', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 36, 'Маслов', 'Александр', 'Николаевич', 2),
(NULL, 36, 'Савчук', 'Евгений', 'Геннадиевич', 2),
(NULL, 36, 'Павлова', 'Анна', 'Станиславовна', 2),
(NULL, 36, 'Мартыненко', 'Сергей', 'Игоревич', 2),
(NULL, 36, 'Борисова', 'Ольга', 'Александровна', 2),
(NULL, 36, 'Фадеева', 'Ирина', 'Дмитриевна', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(27, 36, 'Степаненко', 'Денис', 'Олегович', 3),
(28, 36, 'Никифоров', 'Алексей', 'Николаевич', 3),
(29, 36, 'Слепцов', 'Игорь', 'Михайлович', 3),
(27, 36, 'Беляева', 'Юлия', 'Станиславовна', 3),
(28, 36, 'Сидорова', 'Анна', 'Анатольевна', 3),
(29, 36, 'Гончарова', 'Татьяна', 'Дмитриевна', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(29, 36, 'Бекешев', 'Игорь', 'Алексеевич', 4),
(27, 36, 'Денисов', 'Максим', 'Анатольевич', 4),
(28, 36, 'Агафонов', 'Дмитрий', 'Сергеевич', 4),
(29, 36, 'Иванова', 'Светлана', 'Петровна', 4),
(27, 36, 'Коваленко', 'Евгений', 'Александрович', 4),
(28, 36, 'Лейко', 'Наталья', 'Дмитриевна', 4);

-- Вставка дополнительных студентов на 34 направление (course_id = 34, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 34, 'Лукьянова', 'Арина', 'Станиславовна', 1),
(NULL, 34, 'Панфилова', 'Ксения', 'Александровна', 1),
(NULL, 34, 'Силина', 'Татьяна', 'Дмитриевна', 1),
(NULL, 34, 'Николаева', 'Лариса', 'Александровна', 1),
(NULL, 34, 'Громов', 'Никита', 'Алексеевич', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 34, 'Миронова', 'Валентина', 'Ивановна', 2),
(NULL, 34, 'Яковлев', 'Григорий', 'Станиславович', 2),
(NULL, 34, 'Чистякова', 'Евгения', 'Петровна', 2),
(NULL, 34, 'Герасимов', 'Иван', 'Александрович', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(27, 34, 'Петрова', 'Анна', 'Сергеевна', 3),
(28, 34, 'Бурмистров', 'Андрей', 'Иванович', 3),
(29, 34, 'Круглова', 'Марина', 'Алексеевна', 3),
(27, 34, 'Молостов', 'Олег', 'Викторович', 3),
(28, 34, 'Сысоева', 'Светлана', 'Дмитриевна', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(27, 34, 'Лавров', 'Виктор', 'Иванович', 4),
(28, 34, 'Алексеев', 'Роман', 'Геннадьевич', 4),
(29, 34, 'Костина', 'Елена', 'Станиславовна', 4),
(27, 34, 'Куприяненко', 'Денис', 'Игоревич', 4);

-- Вставка дополнительных студентов на 35 направление (course_id = 35, education_level = master)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(27, 35, 'Чечет', 'Анна', 'Николаевна', 1),
(28, 35, 'Бузулукова', 'Елена', 'Анатольевна', 1),
(29, 35, 'Мельников', 'Дмитрий', 'Романович', 1),
(27, 35, 'Покровская', 'Татьяна', 'Игоревна', 1),
(28, 35, 'Серегин', 'Василий', 'Геннадиевич', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(27, 35, 'Лейбман', 'Семен', 'Александрович', 2),
(28, 35, 'Лаптев', 'Олег', 'Игоревич', 2),
(29, 35, 'Шпак', 'Виктор', 'Станиславович', 2),
(27, 35, 'Светов', 'Игорь', 'Анатольевич', 2);

-- Вставка дополнительных студентов на 36 направление (course_id = 36, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 36, 'Митрофанова', 'Анастасия', 'Александровна', 1),
(NULL, 36, 'Тихонов', 'Станислав', 'Геннадьевич', 1),
(NULL, 36, 'Устинова', 'Елена', 'Сергеевна', 1),
(NULL, 36, 'Денисов', 'Иван', 'Павлович', 1),
(NULL, 36, 'Сердюков', 'Николай', 'Иванович', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 36, 'Калинин', 'Анатолий', 'Викторович', 2),
(NULL, 36, 'Герасименко', 'Александр', 'Анатольевич', 2),
(NULL, 36, 'Боярчук', 'Татьяна', 'Николаевна', 2),
(NULL, 36, 'Никитина', 'Екатерина', 'Станиславовна', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(27, 36, 'Бороздова', 'Светлана', 'Петровна', 3),
(28, 36, 'Назаренко', 'Артем', 'Сергеевич', 3),
(29, 36, 'Смирнов', 'Павел', 'Алексеевич', 3),
(27, 36, 'Петрусенко', 'Елизавета', 'Николаевна', 3),
(28, 36, 'Михайлова', 'Мария', 'Алексеевна', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(29, 36, 'Трофимова', 'Елена', 'Станиславовна', 4),
(27, 36, 'Захаров', 'Александр', 'Викторович', 4),
(28, 36, 'Кутузов', 'Григорий', 'Дмитриевич', 4),
(29, 36, 'Щербань', 'Оксана', 'Викторовна', 4);

-- Вставка дополнительных студентов на 34 направление (course_id = 34, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 34, 'Демидова', 'София', 'Викторовна', 1),
(NULL, 34, 'Кривошапко', 'Станислав', 'Олегович', 1),
(NULL, 34, 'Зверева', 'Елизавета', 'Николаевна', 1),
(NULL, 34, 'Шевченко', 'Анастасия', 'Дмитриевна', 1),
(NULL, 34, 'Федоров', 'Павел', 'Сергеевич', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 34, 'Савченко', 'Наталья', 'Ивановна', 2),
(NULL, 34, 'Дзюба', 'Артем', 'Александрович', 2),
(NULL, 34, 'Курочкин', 'Григорий', 'Дмитриевич', 2),
(NULL, 34, 'Костенко', 'Алена', 'Викторовна', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(27, 34, 'Дубровин', 'Евгений', 'Анатольевич', 3),
(28, 34, 'Тимошенко', 'Светлана', 'Петровна', 3),
(29, 34, 'Левитин', 'Семен', 'Владимирович', 3),
(27, 34, 'Кондратенко', 'Лилия', 'Игоревна', 3),
(28, 34, 'Голубев', 'Константин', 'Викторович', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(27, 34, 'Дьякова', 'Юлия', 'Сергеевна', 4),
(28, 34, 'Грачев', 'Илья', 'Станиславович', 4),
(29, 34, 'Васильев', 'Олег', 'Владимирович', 4),
(27, 34, 'Семченко', 'Ирина', 'Алексеевна', 4);

-- Вставка дополнительных студентов на 35 направление (course_id = 35, education_level = master)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(27, 35, 'Агапова', 'Лилия', 'Александровна', 1),
(28, 35, 'Горбунов', 'Роман', 'Игоревич', 1),
(29, 35, 'Солдатова', 'Анна', 'Дмитриевна', 1),
(27, 35, 'Руденко', 'Артем', 'Сергеевич', 1),
(28, 35, 'Харитонов', 'Вадим', 'Викторович', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(27, 35, 'Забелин', 'Станислав', 'Олегович', 2),
(28, 35, 'Туманова', 'Татьяна', 'Сергеевна', 2),
(29, 35, 'Степанова', 'Екатерина', 'Александровна', 2),
(27, 35, 'Копылова', 'Светлана', 'Викторовна', 2);

-- Вставка дополнительных студентов на 36 направление (course_id = 36, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 36, 'Ширяев', 'Алексей', 'Петрович', 1),
(NULL, 36, 'Ланцов', 'Дмитрий', 'Александрович', 1),
(NULL, 36, 'Терентьев', 'Игорь', 'Николаевич', 1),
(NULL, 36, 'Котова', 'София', 'Дмитриевна', 1),
(NULL, 36, 'Яцков', 'Евгений', 'Викторович', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 36, 'Бакунов', 'Григорий', 'Федорович', 2),
(NULL, 36, 'Федосеева', 'Кристина', 'Алексеевна', 2),
(NULL, 36, 'Снегирев', 'Илья', 'Александрович', 2),
(NULL, 36, 'Шевцов', 'Антон', 'Дмитриевич', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(27, 36, 'Мусатов', 'Николай', 'Станиславович', 3),
(28, 36, 'Киселев', 'Станислав', 'Павлович', 3),
(29, 36, 'Кудрявцева', 'Юлия', 'Алексеевна', 3),
(27, 36, 'Ларина', 'Ольга', 'Дмитриевна', 3),
(28, 36, 'Злобин', 'Андрей', 'Николаевич', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(29, 36, 'Быков', 'Станислав', 'Александрович', 4),
(27, 36, 'Коровин', 'Вадим', 'Олегович', 4),
(28, 36, 'Василиса', 'Екатерина', 'Викторовна', 4),
(29, 36, 'Громов', 'Игорь', 'Анатольевич', 4);

-- Вставка дополнительных студентов на 36 направление (course_id = 36, education_level = bachelor)

-- Курс 1 (year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 36, 'Никифоров', 'Андрей', 'Викторович', 1),
(NULL, 36, 'Миронова', 'Дарья', 'Александровна', 1),
(NULL, 36, 'Лебедева', 'Евгения', 'Дмитриевна', 1),
(NULL, 36, 'Климова', 'Светлана', 'Владимировна', 1),
(NULL, 36, 'Панина', 'Анна', 'Павловна', 1);

-- Курс 2 (year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 36, 'Артемьев', 'Никита', 'Александрович', 2),
(NULL, 36, 'Мокряков', 'Денис', 'Сергеевич', 2),
(NULL, 36, 'Бурова', 'Людмила', 'Алексеевна', 2),
(NULL, 36, 'Доронин', 'Сергей', 'Игоревич', 2),
(NULL, 36, 'Батраков', 'Григорий', 'Олегович', 2);

-- Курс 3 (year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(27, 36, 'Ширшов', 'Анатолий', 'Владимирович', 3),
(28, 36, 'Карасева', 'Кристина', 'Дмитриевна', 3),
(29, 36, 'Терентьев', 'Станислав', 'Игоревич', 3),
(27, 36, 'Садовников', 'Алексей', 'Станиславович', 3),
(28, 36, 'Серова', 'Екатерина', 'Олеговна', 3);

-- Курс 4 (year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(29, 36, 'Филиппов', 'Петр', 'Анатольевич', 4),
(27, 36, 'Гвоздев', 'Максим', 'Игоревич', 4),
(28, 36, 'Кузнецова', 'Вероника', 'Николаевна', 4),
(29, 36, 'Сергеев', 'Дмитрий', 'Александрович', 4),
(27, 36, 'Ларина', 'Юлия', 'Станиславовна', 4);

-- Вставка студентов на 37 направление (course_id = 37, education_level = bachelor)

-- Курс 1 (year = 1) - 35 студентов
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 37, 'Коваленко', 'Татьяна', 'Петровна', 1),
(NULL, 37, 'Дудченко', 'Станислав', 'Валерьевич', 1),
(NULL, 37, 'Шевченко', 'Алена', 'Александровна', 1),
(NULL, 37, 'Петров', 'Иван', 'Сергеевич', 1),
(NULL, 37, 'Гусев', 'Арсений', 'Олегович', 1),
(NULL, 37, 'Курбатова', 'Екатерина', 'Игоревна', 1),
(NULL, 37, 'Сидорова', 'Марина', 'Дмитриевна', 1),
(NULL, 37, 'Левченко', 'Ольга', 'Николаевна', 1),
(NULL, 37, 'Тимченко', 'Анатолий', 'Станиславович', 1),
(NULL, 37, 'Васильев', 'Денис', 'Андреевич', 1),
(NULL, 37, 'Яременко', 'Людмила', 'Павловна', 1),
(NULL, 37, 'Бойко', 'Николай', 'Игоревич', 1),
(NULL, 37, 'Федорова', 'Светлана', 'Валентиновна', 1),
(NULL, 37, 'Смирнов', 'Дмитрий', 'Сергеевич', 1),
(NULL, 37, 'Тихомиров', 'Алексей', 'Петрович', 1),
(NULL, 37, 'Нестерова', 'Анастасия', 'Александровна', 1),
(NULL, 37, 'Власенко', 'Маргарита', 'Юрьевна', 1),
(NULL, 37, 'Зайцева', 'Оксана', 'Николаевна', 1),
(NULL, 37, 'Афанасьев', 'Павел', 'Станиславович', 1),
(NULL, 37, 'Дьякова', 'Елена', 'Анатольевна', 1),
(NULL, 37, 'Баранов', 'Роман', 'Викторович', 1),
(NULL, 37, 'Кузнецова', 'Анна', 'Валентиновна', 1),
(NULL, 37, 'Соловьева', 'Татьяна', 'Александровна', 1),
(NULL, 37, 'Чумак', 'Александр', 'Игоревич', 1),
(NULL, 37, 'Логинов', 'Максим', 'Сергеевич', 1),
(NULL, 37, 'Калинина', 'Наталья', 'Петровна', 1),
(NULL, 37, 'Яковлев', 'Денис', 'Станиславович', 1);

-- Курс 2 (year = 2) - 30 студентов
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 37, 'Полякова', 'Евгения', 'Игоревна', 2),
(NULL, 37, 'Тищенко', 'Андрей', 'Вячеславович', 2),
(NULL, 37, 'Захарова', 'Ольга', 'Сергеевна', 2),
(NULL, 37, 'Кравцов', 'Станислав', 'Николаевич', 2),
(NULL, 37, 'Рябова', 'Елена', 'Петровна', 2),
(NULL, 37, 'Шереметев', 'Владимир', 'Александрович', 2),
(NULL, 37, 'Скворцов', 'Игорь', 'Дмитриевич', 2),
(NULL, 37, 'Павленко', 'Людмила', 'Алексеевна', 2),
(NULL, 37, 'Куликова', 'Вера', 'Викторовна', 2),
(NULL, 37, 'Мирошниченко', 'Олеся', 'Сергеевна', 2),
(NULL, 37, 'Громова', 'Светлана', 'Юрьевна', 2),
(NULL, 37, 'Кириленко', 'Марина', 'Вячеславовна', 2),
(NULL, 37, 'Артемова', 'Ольга', 'Алексеевна', 2),
(NULL, 37, 'Федоров', 'Сергей', 'Олегович', 2),
(NULL, 37, 'Савельев', 'Григорий', 'Дмитриевич', 2),
(NULL, 37, 'Сотников', 'Никита', 'Степанович', 2),
(NULL, 37, 'Тихонов', 'Роман', 'Викторович', 2),
(NULL, 37, 'Стариков', 'Виктор', 'Анатольевич', 2),
(NULL, 37, 'Кушнир', 'Валерий', 'Николаевич', 2),
(NULL, 37, 'Боброва', 'Татьяна', 'Александровна', 2),
(NULL, 37, 'Фролов', 'Андрей', 'Владимирович', 2),
(NULL, 37, 'Гусев', 'Николай', 'Петрович', 2),
(NULL, 37, 'Потапова', 'Елена', 'Александровна', 2),
(NULL, 37, 'Степанов', 'Игорь', 'Анатольевич', 2);

-- Курс 3 (year = 3) - 40 студентов
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(30, 37, 'Лебедев', 'Станислав', 'Николаевич', 3),
(30, 37, 'Левина', 'Вера', 'Петровна', 3),
(31, 37, 'Григорьев', 'Игорь', 'Вячеславович', 3),
(30, 37, 'Лукин', 'Роман', 'Сергеевич', 3),
(31, 37, 'Хорошавина', 'Мария', 'Николаевна', 3),
(30, 37, 'Белоусов', 'Станислав', 'Александрович', 3),
(31, 37, 'Филиппова', 'Светлана', 'Олеговна', 3),
(30, 37, 'Тихомирова', 'Евгения', 'Игоревна', 3),
(30, 37, 'Федосеева', 'Анастасия', 'Станиславовна', 3),
(31, 37, 'Семенова', 'Ольга', 'Игоревна', 3),
(31, 37, 'Дмитриева', 'Евгения', 'Павловна', 3),
(30, 37, 'Яровой', 'Иван', 'Сергеевич', 3),
(31, 37, 'Насырова', 'Светлана', 'Александровна', 3),
(30, 37, 'Коростелев', 'Павел', 'Игоревич', 3),
(30, 37, 'Заводов', 'Никита', 'Викторович', 3),
(31, 37, 'Сергеев', 'Олег', 'Владимирович', 3),
(30, 37, 'Бережная', 'Ирина', 'Алексеевна', 3),
(31, 37, 'Смирнов', 'Денис', 'Анатольевич', 3),
(30, 37, 'Литвинова', 'Наталья', 'Игоревна', 3),
(31, 37, 'Старостина', 'Виктория', 'Сергеевна', 3),
(30, 37, 'Терехова', 'Татьяна', 'Юрьевна', 3),
(31, 37, 'Беляева', 'Александра', 'Александровна', 3),
(30, 37, 'Бабич', 'Николай', 'Станиславович', 3),
(31, 37, 'Трошина', 'Екатерина', 'Викторовна', 3),
(30, 37, 'Панченко', 'Алексей', 'Сергеевич', 3),
(31, 37, 'Михайлова', 'Дарья', 'Дмитриевна', 3);

-- Курс 4 (year = 4) - 30 студентов
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(31, 37, 'Громова', 'Татьяна', 'Игоревна', 4),
(30, 37, 'Герасимов', 'Роман', 'Александрович', 4),
(31, 37, 'Власова', 'Евгения', 'Петровна', 4),
(30, 37, 'Соловьев', 'Константин', 'Станиславович', 4),
(31, 37, 'Дмитриева', 'Наталья', 'Юрьевна', 4),
(30, 37, 'Киселев', 'Станислав', 'Алексеевич', 4),
(31, 37, 'Сорокин', 'Илья', 'Андреевич', 4),
(30, 37, 'Чистяков', 'Андрей', 'Сергеевич', 4),
(31, 37, 'Семенова', 'Анастасия', 'Дмитриевна', 4),
(30, 37, 'Лопатин', 'Виктор', 'Петрович', 4),
(31, 37, 'Галкин', 'Роман', 'Игоревич', 4),
(30, 37, 'Рябинин', 'Сергей', 'Денисович', 4),
(31, 37, 'Воробьева', 'Ксения', 'Сергеевна', 4),
(30, 37, 'Гоголь', 'Александр', 'Станиславович', 4),
(31, 37, 'Медведева', 'Лидия', 'Игоревна', 4),
(30, 37, 'Евдокимов', 'Владимир', 'Петрович', 4),
(31, 37, 'Князева', 'Ольга', 'Николаевна', 4),
(30, 37, 'Ким', 'Никита', 'Валерьевич', 4),
(31, 37, 'Руденко', 'Григорий', 'Алексеевич', 4),
(30, 37, 'Климова', 'Евгения', 'Павловна', 4),
(31, 37, 'Жукова', 'Кристина', 'Олеговна', 4),
(30, 37, 'Коковин', 'Станислав', 'Игоревич', 4),
(31, 37, 'Туркевич', 'Сергей', 'Александрович', 4),
(30, 37, 'Ясинов', 'Леонид', 'Валерьевич', 4),
(31, 37, 'Суслова', 'Мирослава', 'Дмитриевна', 4);

-- Вставка студентов на 38 направление (course_id = 38, education_level = master)

-- Курс 1 (year = 1) - 30 студентов
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(30, 38, 'Николаев', 'Сергей', 'Вячеславович', 1),
(31, 38, 'Сухов', 'Олег', 'Игоревич', 1),
(30, 38, 'Алексеев', 'Иван', 'Сергеевич', 1),
(31, 38, 'Рябова', 'Евгения', 'Игоревна', 1),
(30, 38, 'Тимошенко', 'Галина', 'Александровна', 1),
(31, 38, 'Глушкова', 'Оксана', 'Николаевна', 1),
(30, 38, 'Савельев', 'Дмитрий', 'Андреевич', 1),
(31, 38, 'Семенова', 'Светлана', 'Петровна', 1),
(30, 38, 'Куликов', 'Никита', 'Александрович', 1),
(31, 38, 'Ларионов', 'Алексей', 'Станиславович', 1),
(30, 38, 'Трофимова', 'Маргарита', 'Сергеевна', 1),
(31, 38, 'Филиппов', 'Кирилл', 'Владимирович', 1),
(30, 38, 'Суворова', 'Людмила', 'Вячеславовна', 1),
(31, 38, 'Масленникова', 'Евгения', 'Анатольевна', 1),
(30, 38, 'Карасев', 'Григорий', 'Петрович', 1),
(31, 38, 'Баранова', 'Наталья', 'Станиславовна', 1),
(30, 38, 'Ткаченко', 'Александр', 'Игоревич', 1),
(31, 38, 'Левченко', 'Татьяна', 'Олеговна', 1),
(30, 38, 'Лисицын', 'Степан', 'Андреевич', 1),
(31, 38, 'Кузнецова', 'Марина', 'Павловна', 1),
(30, 38, 'Светлов', 'Данил', 'Игоревич', 1),
(31, 38, 'Куликова', 'Анастасия', 'Дмитриевна', 1),
(30, 38, 'Зинченко', 'Сергей', 'Николаевич', 1),
(31, 38, 'Миронова', 'Кристина', 'Сергеевна', 1),
(30, 38, 'Панфилова', 'Ксения', 'Алексеевна', 1),
(31, 38, 'Синицина', 'Алина', 'Александровна', 1),
(30, 38, 'Лукьяненко', 'Олег', 'Петрович', 1);

-- Курс 2 (year = 2) - 30 студентов
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(30, 38, 'Громов', 'Владимир', 'Анатольевич', 2),
(31, 38, 'Мельников', 'Роман', 'Сергеевич', 2),
(30, 38, 'Шевченко', 'Анатолий', 'Николаевич', 2),
(31, 38, 'Терещенко', 'Геннадий', 'Петрович', 2),
(30, 38, 'Калинов', 'Степан', 'Олегович', 2),
(31, 38, 'Федоров', 'Максим', 'Александрович', 2),
(30, 38, 'Корнеев', 'Дмитрий', 'Викторович', 2),
(31, 38, 'Фокин', 'Сергей', 'Олегович', 2),
(30, 38, 'Савчук', 'Лилия', 'Дмитриевна', 2),
(31, 38, 'Руденко', 'Евгений', 'Александрович', 2),
(30, 38, 'Трошина', 'Екатерина', 'Станиславовна', 2),
(31, 38, 'Костенко', 'Лариса', 'Вячеславовна', 2),
(30, 38, 'Петухов', 'Виктор', 'Сергеевич', 2),
(31, 38, 'Зуев', 'Александр', 'Андреевич', 2),
(30, 38, 'Коваленко', 'Наталья', 'Викторовна', 2),
(31, 38, 'Митрофанова', 'Татьяна', 'Игоревна', 2),
(30, 38, 'Малинин', 'Григорий', 'Денисович', 2),
(31, 38, 'Шубин', 'Денис', 'Станиславович', 2),
(30, 38, 'Пробиренко', 'Роман', 'Сергеевич', 2),
(31, 38, 'Зайцева', 'Кристина', 'Викторовна', 2),
(30, 38, 'Тимофеева', 'Лидия', 'Алексеевна', 2),
(31, 38, 'Федосеев', 'Константин', 'Алексеевич', 2),
(30, 38, 'Соловьев', 'Анатолий', 'Петрович', 2),
(31, 38, 'Громова', 'Евгения', 'Александровна', 2),
(30, 38, 'Григорьев', 'Сергей', 'Станиславович', 2),
(31, 38, 'Баранова', 'Татьяна', 'Валентиновна', 2);

-- Вставка студентов на 39 направление (course_id = 39, education_level = bachelor)

-- Курс 1 (year = 1) - 35 студентов
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 39, 'Волков', 'Станислав', 'Денисович', 1),
(NULL, 39, 'Лаврова', 'Екатерина', 'Станиславовна', 1),
(NULL, 39, 'Горбунов', 'Игорь', 'Анатольевич', 1),
(NULL, 39, 'Зайцева', 'Алина', 'Николаевна', 1),
(NULL, 39, 'Нестеров', 'Александр', 'Владимирович', 1),
(NULL, 39, 'Федорова', 'Светлана', 'Сергеевна', 1),
(NULL, 39, 'Кузьмин', 'Роман', 'Алексеевич', 1),
(NULL, 39, 'Захарченко', 'Дмитрий', 'Станиславович', 1),
(NULL, 39, 'Тарасенко', 'Ирина', 'Анатольевна', 1),
(NULL, 39, 'Панин', 'Андрей', 'Григорьевич', 1),
(NULL, 39, 'Смирнов', 'Николай', 'Алексеевич', 1),
(NULL, 39, 'Костюк', 'Ольга', 'Валерьевна', 1),
(NULL, 39, 'Шевцов', 'Сергей', 'Петрович', 1),
(NULL, 39, 'Чистяков', 'Анатолий', 'Вячеславович', 1),
(NULL, 39, 'Мишин', 'Денис', 'Сергеевич', 1),
(NULL, 39, 'Васильева', 'Елена', 'Викторовна', 1),
(NULL, 39, 'Степанов', 'Владимир', 'Дмитриевич', 1),
(NULL, 39, 'Тимошенко', 'Татьяна', 'Игоревна', 1),
(NULL, 39, 'Лазарев', 'Николай', 'Степанович', 1),
(NULL, 39, 'Беляев', 'Иван', 'Николаевич', 1),
(NULL, 39, 'Морозова', 'Юлия', 'Сергеевна', 1),
(NULL, 39, 'Червонец', 'Василий', 'Станиславович', 1),
(NULL, 39, 'Шаповалова', 'Анастасия', 'Дмитриевна', 1),
(NULL, 39, 'Сердюков', 'Андрей', 'Николаевич', 1),
(NULL, 39, 'Афанасьева', 'Наталья', 'Григорьевна', 1),
(NULL, 39, 'Королев', 'Алексей', 'Андреевич', 1),
(NULL, 39, 'Евдокимова', 'Тамара', 'Степановна', 1),
(NULL, 39, 'Крючков', 'Олег', 'Викторович', 1),
(NULL, 39, 'Шереметов', 'Сергей', 'Николаевич', 1);

-- Курс 2 (year = 2) - 35 студентов
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 39, 'Ермакова', 'Ольга', 'Николаевна', 2),
(NULL, 39, 'Тимофеева', 'Анна', 'Сергеевна', 2),
(NULL, 39, 'Климова', 'Елизавета', 'Дмитриевна', 2),
(NULL, 39, 'Рябова', 'Евгения', 'Анатольевна', 2),
(NULL, 39, 'Калашников', 'Григорий', 'Андреевич', 2),
(NULL, 39, 'Киселев', 'Сергей', 'Дмитриевич', 2),
(NULL, 39, 'Герман', 'Светлана', 'Игоревна', 2),
(NULL, 39, 'Семенова', 'Ирина', 'Николаевна', 2),
(NULL, 39, 'Белоусов', 'Дмитрий', 'Викторович', 2),
(NULL, 39, 'Задорожный', 'Алексей', 'Петрович', 2),
(NULL, 39, 'Сидоров', 'Роман', 'Игоревич', 2),
(NULL, 39, 'Филиппов', 'Олег', 'Станиславович', 2),
(NULL, 39, 'Золотов', 'Александр', 'Валерьевич', 2),
(NULL, 39, 'Сорокин', 'Николай', 'Петрович', 2),
(NULL, 39, 'Голубева', 'Кристина', 'Юрьевна', 2),
(NULL, 39, 'Панов', 'Данила', 'Александрович', 2),
(NULL, 39, 'Беляев', 'Станислав', 'Александрович', 2),
(NULL, 39, 'Дроздова', 'Татьяна', 'Олеговна', 2),
(NULL, 39, 'Соколов', 'Иван', 'Николаевич', 2),
(NULL, 39, 'Лисов', 'Анатолий', 'Александрович', 2),
(NULL, 39, 'Гусев', 'Станислав', 'Валерьевич', 2),
(NULL, 39, 'Лебедева', 'Евгения', 'Сергеевна', 2),
(NULL, 39, 'Семёнов', 'Сергей', 'Олегович', 2),
(NULL, 39, 'Петрова', 'Анна', 'Николаевна', 2),
(NULL, 39, 'Семенова', 'Елизавета', 'Петровна', 2),
(NULL, 39, 'Старостин', 'Геннадий', 'Анатольевич', 2);

-- Курс 3 (year = 3) - 40 студентов
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(30, 39, 'Бондарь', 'Станислав', 'Денисович', 3),
(31, 39, 'Тарасов', 'Роман', 'Олегович', 3),
(30, 39, 'Смирнов', 'Игорь', 'Александрович', 3),
(31, 39, 'Григорьева', 'Екатерина', 'Викторовна', 3),
(30, 39, 'Лапин', 'Валентин', 'Николаевич', 3),
(31, 39, 'Кравченко', 'Анастасия', 'Станиславовна', 3),
(30, 39, 'Афанасьев', 'Сергей', 'Олегович', 3),
(31, 39, 'Шинкарев', 'Анатолий', 'Петрович', 3),
(30, 39, 'Королева', 'Ксения', 'Павловна', 3),
(31, 39, 'Лавров', 'Станислав', 'Вячеславович', 3),
(30, 39, 'Евдокимов', 'Денис', 'Алексеевич', 3),
(31, 39, 'Федосеев', 'Дмитрий', 'Александрович', 3),
(30, 39, 'Скворцова', 'Татьяна', 'Алексеевна', 3),
(31, 39, 'Смирнова', 'Анастасия', 'Игоревна', 3),
(30, 39, 'Тимофеев', 'Григорий', 'Николаевич', 3),
(31, 39, 'Козлов', 'Максим', 'Сергеевич', 3),
(30, 39, 'Панфилов', 'Степан', 'Олегович', 3),
(31, 39, 'Филиппова', 'Елена', 'Викторовна', 3),
(30, 39, 'Шубина', 'Анна', 'Игоревна', 3),
(31, 39, 'Дмитриев', 'Николай', 'Вячеславович', 3),
(30, 39, 'Соловьев', 'Николай', 'Александрович', 3),
(31, 39, 'Власова', 'Кристина', 'Викторовна', 3),
(30, 39, 'Александров', 'Кирилл', 'Дмитриевич', 3),
(31, 39, 'Мельников', 'Вячеслав', 'Станиславович', 3),
(30, 39, 'Гончарова', 'Анна', 'Игоревна', 3),
(31, 39, 'Шмидт', 'Анатолий', 'Петрович', 3),
(30, 39, 'Никифоров', 'Анатолий', 'Денисович', 3),
(31, 39, 'Никитина', 'Юлия', 'Сергеевна', 3),
(30, 39, 'Горшков', 'Константин', 'Денисович', 3),
(31, 39, 'Федосеев', 'Дмитрий', 'Алексеевич', 3),
(30, 39, 'Ковалев', 'Сергей', 'Алексеевич', 3),
(31, 39, 'Мельникова', 'Татьяна', 'Олеговна', 3),
(30, 39, 'Шаров', 'Алексей', 'Сергеевич', 3),
(31, 39, 'Еремеев', 'Станислав', 'Викторович', 3),
(30, 39, 'Заболотный', 'Владимир', 'Вячеславович', 3),
(31, 39, 'Носков', 'Виктор', 'Станиславович', 3);

-- Вставка студентов на 4 курс направления 39 (course_id = 39, year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(30, 39, 'Лебедев', 'Александр', 'Петрович', 4),
(31, 39, 'Соловьева', 'Анастасия', 'Дмитриевна', 4),
(30, 39, 'Федотов', 'Станислав', 'Анатольевич', 4),
(31, 39, 'Ковальчук', 'Анна', 'Сергеевна', 4),
(30, 39, 'Заболотный', 'Григорий', 'Иванович', 4),
(31, 39, 'Голубев', 'Дмитрий', 'Валерьевич', 4),
(30, 39, 'Морозова', 'Ольга', 'Станиславовна', 4),
(31, 39, 'Иванов', 'Виктор', 'Станиславович', 4),
(30, 39, 'Давыдов', 'Роман', 'Сергеевич', 4),
(31, 39, 'Филиппова', 'Наталья', 'Александровна', 4),
(30, 39, 'Никитина', 'Светлана', 'Александровна', 4),
(31, 39, 'Смирнов', 'Илья', 'Денисович', 4),
(30, 39, 'Кузнецов', 'Григорий', 'Анатольевич', 4),
(31, 39, 'Румянцева', 'Ксения', 'Геннадьевна', 4),
(30, 39, 'Павлов', 'Алексей', 'Викторович', 4),
(31, 39, 'Костюченко', 'Лариса', 'Ивановна', 4),
(30, 39, 'Сидоров', 'Анатолий', 'Владимирович', 4),
(31, 39, 'Шевченко', 'Евгений', 'Петрович', 4),
(30, 39, 'Скоробогатов', 'Александр', 'Николаевич', 4),
(31, 39, 'Терещенко', 'Светлана', 'Анатольевна', 4),
(30, 39, 'Трофимов', 'Дмитрий', 'Вячеславович', 4),
(31, 39, 'Ларина', 'Валерия', 'Станиславовна', 4),
(30, 39, 'Ковалев', 'Александр', 'Викторович', 4),
(31, 39, 'Егоров', 'Кирилл', 'Александрович', 4),
(30, 39, 'Семенова', 'Анна', 'Сергеевна', 4),
(31, 39, 'Гончаров', 'Анатолий', 'Игоревич', 4),
(30, 39, 'Мельникова', 'Лидия', 'Романовна', 4),
(31, 39, 'Зайцева', 'Екатерина', 'Петровна', 4),
(30, 39, 'Баранов', 'Игорь', 'Алексеевич', 4),
(31, 39, 'Степанова', 'Анастасия', 'Григорьевна', 4),
(30, 39, 'Панфилов', 'Роман', 'Станиславович', 4),
(31, 39, 'Морозов', 'Вячеслав', 'Анатольевич', 4),
(30, 39, 'Федосеев', 'Денис', 'Николаевич', 4),
(31, 39, 'Куликова', 'Марина', 'Анатольевна', 4),
(30, 39, 'Александров', 'Илья', 'Станиславович', 4),
(31, 39, 'Гусев', 'Геннадий', 'Денисович', 4),
(30, 39, 'Шмидт', 'Владислав', 'Дмитриевич', 4);

-- Вставка студентов на 1 курс направления 40 (course_id = 40, year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 40, 'Петрова', 'Анастасия', 'Сергеевна', 1),
(NULL, 40, 'Иванов', 'Дмитрий', 'Александрович', 1),
(NULL, 40, 'Сидорова', 'Елена', 'Викторовна', 1),
(NULL, 40, 'Кузнецов', 'Алексей', 'Михайлович', 1),
(NULL, 40, 'Лебедева', 'Мария', 'Николаевна', 1),
(NULL, 40, 'Зайцев', 'Илья', 'Станиславович', 1),
(NULL, 40, 'Коваленко', 'Оксана', 'Викторовна', 1),
(NULL, 40, 'Панфилова', 'Светлана', 'Дмитриевна', 1),
(NULL, 40, 'Федоров', 'Сергей', 'Петрович', 1),
(NULL, 40, 'Морозова', 'Анна', 'Александровна', 1),
(NULL, 40, 'Гончаров', 'Роман', 'Игоревич', 1),
(NULL, 40, 'Семёнов', 'Денис', 'Олегович', 1),
(NULL, 40, 'Ларина', 'Наталья', 'Романовна', 1),
(NULL, 40, 'Васильева', 'Ирина', 'Владимировна', 1),
(NULL, 40, 'Шевченко', 'Светлана', 'Станиславовна', 1),
(NULL, 40, 'Харитонов', 'Анатолий', 'Николаевич', 1);

-- Вставка студентов на 2 курс направления 40 (course_id = 40, year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(NULL, 40, 'Дорофеева', 'Полина', 'Денисовна', 2),
(NULL, 40, 'Николаев', 'Валентин', 'Юрьевич', 2),
(NULL, 40, 'Сухарева', 'Кристина', 'Геннадьевна', 2),
(NULL, 40, 'Левина', 'Юлия', 'Павловна', 2),
(NULL, 40, 'Тимошенко', 'Анна', 'Вячеславовна', 2),
(NULL, 40, 'Ковалев', 'Игорь', 'Александрович', 2),
(NULL, 40, 'Лебедев', 'Максим', 'Сергеевич', 2),
(NULL, 40, 'Фролова', 'Татьяна', 'Викторовна', 2),
(NULL, 40, 'Иванова', 'Дарья', 'Андреевна', 2),
(NULL, 40, 'Старков', 'Станислав', 'Владимирович', 2),
(NULL, 40, 'Мельникова', 'Ольга', 'Николаевна', 2),
(NULL, 40, 'Сазонов', 'Егор', 'Романович', 2),
(NULL, 40, 'Семенова', 'Ксения', 'Станиславовна', 2),
(NULL, 40, 'Денисов', 'Денис', 'Петрович', 2),
(NULL, 40, 'Степанова', 'Оксана', 'Игоревна', 2),
(NULL, 40, 'Аминова', 'Дина', 'Сергеевна', 2);

-- Вставка студентов на 3 курс направления 40 (course_id = 40, year = 3)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(32, 40, 'Морозов', 'Денис', 'Анатольевич', 3),
(33, 40, 'Смирнов', 'Виктор', 'Дмитриевич', 3),
(32, 40, 'Петров', 'Иван', 'Викторович', 3),
(32, 40, 'Шевченко', 'Олег', 'Владимирович', 3),
(33, 40, 'Гусев', 'Роман', 'Александрович', 3),
(32, 40, 'Соколова', 'Анастасия', 'Алексеевна', 3),
(32, 40, 'Мельников', 'Станислав', 'Петрович', 3),
(32, 40, 'Лапина', 'Елена', 'Дмитриевна', 3),
(32, 40, 'Васильев', 'Дмитрий', 'Александрович', 3),
(33, 40, 'Ким', 'Евгений', 'Анатольевич', 3),
(32, 40, 'Арутюнян', 'Лев', 'Сергеевич', 3),
(33, 40, 'Сидорова', 'Екатерина', 'Сергеевна', 3),
(32, 40, 'Шарикова', 'Анастасия', 'Игоревна', 3),
(33, 40, 'Фролов', 'Никита', 'Сергеевич', 3),
(33, 40, 'Родионова', 'Софья', 'Игоревна', 3),
(32, 40, 'Харитонов', 'Игорь', 'Алексеевич', 3);

-- Вставка студентов на 4 курс направления 40 (course_id = 40, year = 4)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(32, 40, 'Нестеров', 'Александр', 'Викторович', 4),
(32, 40, 'Григорьев', 'Дмитрий', 'Анатольевич', 4),
(32, 40, 'Павлов', 'Игорь', 'Станиславович', 4),
(33, 40, 'Сидорова', 'Татьяна', 'Геннадьевна', 4),
(33, 40, 'Дудкин', 'Станислав', 'Владимирович', 4),
(32, 40, 'Ларина', 'Ксения', 'Сергеевна', 4),
(33, 40, 'Краев', 'Антон', 'Олегович', 4),
(33, 40, 'Евдокимова', 'Светлана', 'Юрьевна', 4),
(32, 40, 'Мальцева', 'Ирина', 'Валерьевна', 4),
(32, 40, 'Тимофеев', 'Григорий', 'Николаевич', 4),
(33, 40, 'Куликов', 'Илья', 'Станиславович', 4),
(32, 40, 'Иванов', 'Павел', 'Александрович', 4),
(32, 40, 'Тихонова', 'Анна', 'Дмитриевна', 4),
(32, 40, 'Кузьмина', 'Олеся', 'Игоревна', 4),
(32, 40, 'Ковалев', 'Дмитрий', 'Алексеевич', 4),
(33, 40, 'Смирнов', 'Алексей', 'Владимирович', 4);

-- Вставка студентов на 1 курс направления 41 (course_id = 41, year = 1)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(32, 41, 'Семенова', 'Анна', 'Игоревна', 1),
(32, 41, 'Григорьев', 'Павел', 'Анатольевич', 1),
(33, 41, 'Мельникова', 'Екатерина', 'Станиславовна', 1),
(32, 41, 'Кузнецов', 'Сергей', 'Александрович', 1),
(33, 41, 'Никитина', 'Светлана', 'Викторовна', 1),
(32, 41, 'Тарасова', 'Мария', 'Дмитриевна', 1),
(33, 41, 'Лебедев', 'Алексей', 'Николаевич', 1),
(32, 41, 'Соловьева', 'Варвара', 'Петровна', 1),
(32, 41, 'Васильев', 'Даниил', 'Максимович', 1),
(33, 41, 'Тихонова', 'Ольга', 'Геннадьевна', 1),
(32, 41, 'Зайцева', 'Ксения', 'Александровна', 1),
(33, 41, 'Денисов', 'Илья', 'Сергеевич', 1),
(32, 41, 'Ковалев', 'Константин', 'Анатольевич', 1),
(33, 41, 'Смирнов', 'Артем', 'Дмитриевич', 1),
(32, 41, 'Федорова', 'Алина', 'Викторовна', 1),
(33, 41, 'Петрова', 'Елена', 'Олеговна', 1);

-- Вставка студентов на 2 курс направления 41 (course_id = 41, year = 2)
INSERT INTO student (department_id, course_id, surname, name, patronymic, year) VALUES
(32, 41, 'Савельев', 'Дмитрий', 'Вячеславович', 2),
(33, 41, 'Калинина', 'Татьяна', 'Сергеевна', 2),
(32, 41, 'Кириллова', 'Вероника', 'Ивановна', 2),
(33, 41, 'Алексеев', 'Денис', 'Александрович', 2),
(32, 41, 'Громова', 'Полина', 'Николаевна', 2),
(33, 41, 'Левин', 'Вадим', 'Станиславович', 2),
(32, 41, 'Дорофеева', 'Анна', 'Игоревна', 2),
(33, 41, 'Савина', 'Людмила', 'Владимировна', 2),
(32, 41, 'Филиппов', 'Станислав', 'Михайлович', 2),
(32, 41, 'Рябкова', 'Кристина', 'Дмитриевна', 2),
(33, 41, 'Степанов', 'Никита', 'Александрович', 2),
(32, 41, 'Гусев', 'Арсений', 'Валерьевич', 2),
(33, 41, 'Боброва', 'Анастасия', 'Романовна', 2),
(32, 41, 'Косарева', 'Елизавета', 'Игоревна', 2),
(33, 41, 'Хохлов', 'Евгений', 'Вячеславович', 2),
(32, 41, 'Тихонов', 'Александр', 'Алексеевич', 2);